{
    "lang-sel-label": "Language: ",
    "lang-sel-opt-es": "Spanish",
    "lang-sel-opt-en": "English",
    "lang-port-name": "Joel Alejandro Espinoza Sánchez",
    "lang-port-title": "My Way",
    "lang-intro-title": "My Way",
    "lang-intro-p1": "I developed this website to showcase and comment on the learning I obtained and the products I made during my learning journey, from the notes I managed to save from my early education to those products of my most recent or self-taught education, as I present it divided by stages as shown below.",
    "lang-intro-p2": "Furthermore, I share my experiences of what it was like to study in the various institutions I attended, recounting both the positive experiences and the challenges. I provide a lot of study material that I created available to the public with the hope that these products may be useful to someone, either as study support material or for resolving doubts.",
    "lang-intro-p3": "Even though the text on this website is translated into English, the text of my notes in the PDF documents is not, since the PDFs were scanned just as I wrote each of my notes. Therefore, they may not be very useful as content if you wish to consult them in English.",
    "lang-bach": "High School",
    "lang-bach-1": "Even before entering high school, I already envisioned this stage as the time when I wanted my life to take a very drastic turn from the type of life I had in my previous stage, mainly in terms of social aspects.",
    "lang-bach-2": "My intention was never to neglect the (self-thought) great academic work I was doing in my basic education stage; however, I never took the time to build friendships, and I wanted to finally establish solid social relationships. I entered this three-year stage with this focus and goal primarily in mind.",
    "lang-bach-3": "I achieved this while also not neglecting my grades as much (except for the first year) and leaving this stage with memories of people with whom I am glad to maintain the bonds that I began some time ago.",
    "lang-bach-4": "I studied my high school in the central campus of the <a href=\"https://www.uaa.mx/portal/\" target=\"_blank\">Aguascalientes Autonomous University</a> High School Center from July 2015 to June 2018 being, in general, a very enjoyable experience from social aspects to academic terms.",
    "lang-bach-s1": "First Semester",
    "lang-bach-s1-quote": "All we can do is our best, and sometimes the best that we can do is to start over - Peggy Carter (Captain America: The Winter Soldier)",
    "lang-bach-s1-1": "This first semester was a wake-up call in terms of education, feeling that coming from my secondary I wasn't as prepared for the demands in certain subjects. I was very enthusiastic about the algebra course because Professor Eduardo Guerrero Miranda gave us a mathematics primer that sparked my curiosity for math. However, on the other hand, subjects like Biology or History felt overloaded with content that I thought I wouldn't be able to handle, not only in this semester but also in the continuation of these subjects in the next semester.",
    "lang-bach-s1-2": "However, despite things not going as smoothly, academically it wasn't so bad for me, as I managed to pass all the subjects satisfactorily this semester.",
    "lang-bach-s1-algb": "Algebra",
    "lang-bach-s1-algb-1": "We started the semester every day at 7:00 a.m. with the algebra class. Taught by Professor Eduardo Guerrero Miranda, the course was dynamic and sometimes frantic, but in my opinion, it was always interesting, where we learned the basics of algebra, including equations, fractions, factorization, and other topics that, from my perspective, were very well taught by the teacher.",
    "lang-bach-s1-algb-2": "With Professor Eduardo, I will feel eternally grateful for teaching me this course because through it, I understood mathematics after nine years of studying them without much enthusiasm, as I didn't know their use, comprehension, and application until this course. It was thanks to him that I became interested and passionate about them, so much so that even the professor himself noticed, pointing me towards an internal mathematics competition and motivating me to participate in larger competitions such as the mathematics olympiads, which I ended up participating in during the fourth semester of my high school (along with the support of another friend I met later on).",
    "lang-bach-s1-algb-3": "It was a course with definitions of some algebra topics, but mostly focused on completing exercises that allowed us to understand each topic of the course.",
    "lang-bach-s1-algb-4": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/02-Bachillerato/1/01-Algebra.pdf\" target=\"_blank\">here</a> despite thinking that they are messy notes with my handwriting, which has always been very ugly, I believe they represent a good development of the algebra topics, so they might be useful.",
    "lang-bach-s1-hist": "Modern History",
    "lang-bach-s1-hist-1": "From my perspective, this subject was one of the two most difficult ones this semester. Taught by Professor Ismael García González Cosío, the subject demanded a lot of effort as it covered a lot of content from events prior to the First World War; however, it wasn't a history course much different from memorizing dates and figures from the times we had to study.",
    "lang-bach-s1-hist-2": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/02-Bachillerato/1/02-Historia-Apuntes.pdf\" target=\"_blank\">here</a>, where I tried to make them more carefully as our notes were evaluated. Similarly, the assignments we did in the subject can be found <a href=\"01-Apuntes/02-Bachillerato/1/03-Historia-Tareas.pdf\" target=\"_blank\">here</a> , but I don't think these notes are very valuable unless the information from the notes is useful because, probably, the only thing that can be taken advantage of from these notes is the information itself, as it was likely a subject that required high memorization.",
    "lang-bach-s1-estr": "Cognitive Strategies",
    "lang-bach-s1-estr-1": "I don't even know why they taught us this subject. It wasn't a difficult subject, but it also wasn't a subject I remember learning anything important from.",
    "lang-bach-s1-estr-2": "I remember it was a course to learn how to develop learning strategies, strategies I already had. However, the teacher, Alejandra Eudave Patiño, imposed other rules that personally led me to detest the subject.",
    "lang-bach-s1-estr-3": "From mandatory techniques on how to highlight text to the way of writing itself. I already have my own methods of highlighting or organizing information through concept maps or synoptic charts. It frustrated me that I couldn't even gather information in my own way and that my grade depended on how similar my highlighting style was to the teacher's.",
    "lang-bach-s1-estr-4": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/02-Bachillerato/1/04-EstrategiasCognitivas.pdf\" target=\"_blank\">here</a> which aren't very messy, nor are they very neat, but personally, I don't think there's any useful information to be gained from them because the subject didn't offer anything useful.",
    "lang-bach-s1-tics": "Technologies of Information and Communication",
    "lang-bach-s1-tics-1": "The subject was the computer science course of the semester, where they taught us many things related to computer equipment. We learned the basics of a computer, some Microsoft Office applications, and a bit about the informatics operation of the institution.",
    "lang-bach-s1-tics-2": "Taught by Professor Juan Manuel Ortega, I don't consider it to have been a bad course (although not very remarkable either). It was actually good knowledge that could be obtained from this course.",
    "lang-bach-s1-tics-3": "The subject didn't require taking notes as it was purely practical work on computer equipment, so I don't have many notes, although the subject was interesting. The few notes I developed can be found <a href=\"01-Apuntes/02-Bachillerato/1/05-TICs.pdf\" target=\"_blank\">here</a>.",
    "lang-bach-s1-biol": "Cellular Biology",
    "lang-bach-s1-biol-1": "This, along with the History course, was the most challenging aspect of this first semester for me. Cellular Biology was very difficult, although unlike History, the memorization here didn't feel pointless. We studied cellular structure (which, although there may be few organelles, I found it very cumbersome to learn all this) but we linked this with how each organelle participated in cellular functions when we reached this topic, so it was constantly progressing needing the previous knowledge.",
    "lang-bach-s1-biol-2": "The subject was taught to me by the great teacher Eduardo Alvarado Villalobos, who provided us with a lot of information and very clear explanations about Cellular Biology. His classes were very dynamic, and the way he explained and clarified our doubts was always very helpful for the entire class. I believe he was one of the main pillars for all the colleagues who specialized in natural sciences related to biology.",
    "lang-bach-s1-biol-3": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/02-Bachillerato/1/06-BiologiaCelular.pdf\" target=\"_blank\">here</a> which aren't very messy, nor are they very neat, but I believe they are very useful because of all the information given and structured in this course.",
    "lang-bach-s1-leng": "Language and Communication",
    "lang-bach-s1-leng-1": "This was another terrible subject. Teacher Jacquelina Díaz de León Magallanes is one of the worst teachers I've ever had in my entire life. Her class was non-existent; we never learned anything. She would come to class to tell us extremely irrelevant gossip, and just when we thought her classes were a joke, she would suddenly decide to be serious.",
    "lang-bach-s1-leng-2": "The subject was supposed to cover many aspects of Spanish with readings and certain language topics such as morphology or syntax, but it didn't happen that way. In reality, not much was covered, and the activities were very lacking. Her class was excessively guided by her mood (I don't think it's wrong, but this was excessive).",
    "lang-bach-s1-leng-3": "The notes I developed can be found <a href=\"01-Apuntes/02-Bachillerato/1/07-Lengua.pdf\" target=\"_blank\">here</a>, which are moderately neat, but I don't think they can be of any use. We didn't do anything in the subject.",
    "lang-bach-s1-ingl": "English",
    "lang-bach-s1-ingl-1": "This English subject was entertaining. We learned English from a very academic perspective, but we also practiced by breaking away from the typical structure, engaging in long conversations or debates to solidify our mastery of English through conversation.",
    "lang-bach-s1-ingl-2": "It was a very interesting subject taught by teacher Olga Patricia de Luna Aguilar, with multiple ways of practicing and learning that I believe everyone enjoyed in the end.",
    "lang-bach-s1-ingl-3": "The notes I developed can be consulted <a href=\"01-Apuntes/02-Bachillerato/1/08-Ingles.pdf\" target=\"_blank\">here</a>, which are moderately neat, but I don't think they can be of any use because the course isn't fully explained with the few notes made.",
    "lang-bach-s2": "Second Semester",
    "lang-bach-s2-quote": "Sometimes, the thing you've been looking for your whole life is right there beside you all along - Peter Quill (Guardians of the Galaxy Volume 2)",
    "lang-bach-s2-1": "The second semester I experienced was essentially a very good continuation of the first six months at this educational institution. The friendships I had started the previous semester were being solidified in this semester, and I also had the opportunity to continue meeting more people from the institution, all with whom I spent good times.",
    "lang-bach-s2-2": "The continuation of a good social mood was still on the rise. Academically, I only hoped to improve a little on what I had achieved last semester, but I wasn't ashamed because I considered that I had made a good effort the previous semester.",
    "lang-bach-s2-3": "However, this semester presented us with the possibility of switching to the International Baccalaureate Diploma Programme, a doubt that left many of us in the class wondering if, for the third semester, we would sacrifice the friendships and the class we were in for the academic demand and the new and uncertain challenges of this program.",
    "lang-bach-s2-hist": "Contemporary History",
    "lang-bach-s2-hist-1": "This subject was the continuation of last semester's history course. Taught by Professor Consuelo Medina de la Torre, I don't think it was a bad course, but it suffered from the same issue as last semester's subject: lack of purpose.",
    "lang-bach-s2-hist-2": "The subject was less heavy and perhaps better explained. It wasn't bad, but I never fully engaged in the dynamics of the subject due to its high memorization demands like the subject last semester. However, I didn't find it to be such a bad subject when I took it.",
    "lang-bach-s2-hist-3": "The notes I developed can be consulted <a href=\"01-Apuntes/02-Bachillerato/2/01-Historia-Apuntes.pdf\" target=\"_blank\">here</a>, as well as the assignments I did <a href=\"01-Apuntes/02-Bachillerato/2/02-Historia-Tareas.pdf\" target=\"_blank\">here</a>. They are moderately neat notes, but I don't think they can be of any use since they consist of information from the internet or textbooks that we covered in class.",
    "lang-bach-s2-etim": "Greco-Latin Etymologies",
    "lang-bach-s2-etim-1": "In this subject, we studied the etymological origin of a large part of the vocabulary used in Spanish, starting with roots from Greek and finishing the course with roots from Latin.",
    "lang-bach-s2-etim-2": "The course was taught by Professor Mary Antonia Montes, and I must say it was a good course. I feel like I learned to try to understand more than memorize the etymological roots of words, associating words that have similar prefixes or suffixes (or other structures) and thus associating the meaning of that etymological structure. It was a good course.",
    "lang-bach-s2-etim-3": "The notes I developed can be consulted <a href=\"01-Apuntes/02-Bachillerato/2/03-Etimologias-Apuntes.pdf\" target=\"_blank\">here</a>, as well as the assignments I completed <a href=\"01-Apuntes/02-Bachillerato/2/04-Etimologias-Tareas.pdf\" target=\"_blank\">here</a>. They are moderately neat notes, and with the variety of activities we did, they could be useful.",
    "lang-bach-s2-evol": "Evolution and Biodiversity",
    "lang-bach-s2-evol-1": "Professor Eduardo Alvarado Villalobos repeated as our teacher in this subject, which was a continuation of the Cellular Biology course from the previous semester. Following the same trend as last semester, the professor once again delivered an excellent class. With very clear examples of evolution theories and an extensive program on the biodiversity of living beings, I can still remember names of some domains, kingdoms, and phyla to this day. An excellent teacher who did a great job in teaching us these topics.",
    "lang-bach-s2-evol-2": "The notes I developed can be consulted <a href=\"01-Apuntes/02-Bachillerato/2/05-Evolucion-Apuntes.pdf\" target=\"_blank\">here</a>, as well as the assignments I completed <a href=\"01-Apuntes/02-Bachillerato/2/06-Evolucion-Tareas.pdf\" target=\"_blank\">here</a>. They are notes where I tried to be as neat as possible, and I believe they can be useful.",
    "lang-bach-s2-ingl": "English",
    "lang-bach-s2-ingl-1": "This second English subject seemed a bit inferior to the one from the previous period. It wasn't bad; we continued practicing English through conversations, movies, exercises, and many other activities. However, I just felt that maybe there wasn't a point where we or the teacher took the subject seriously. It's not necessarily a bad thing because we still practiced English, but I think we could have done more activities to learn English.",
    "lang-bach-s2-ingl-2": "The notes I developed can be consulted <a href=\"01-Apuntes/02-Bachillerato/2/07-Ingles-Apuntes.pdf\" target=\"_blank\">here</a>, as well as the assignments I completed <a href=\"01-Apuntes/02-Bachillerato/2/08-Ingles-Tareas.pdf\" target=\"_blank\">here</a>. These notes may not reflect all the work done in class, but some activities may be useful.",
    "lang-bach-s2-tall": "Reading and Writing Workshop",
    "lang-bach-s2-tall-1": "This subject is the opposite of what the previous Language and Communication course was (I think, to an almost excessive extent). The course, taught by Professor Rosa Imelda López Hurtado, was a truly serious course, I believe, very serious. We covered many topics related to Spanish, such as language functions, some literary devices, and other topics that I think were perfectly addressed, as well as reading works like \"The Widower Román\", \"Tomochic\", and \"White Nights\". Without a doubt, in terms of knowledge, it's a subject and a teacher that taught and allowed for very satisfactory learning.",
    "lang-bach-s2-tall-2": "The notes I developed can be consulted <a href=\"01-Apuntes/02-Bachillerato/2/09-TLR-Apuntes.pdf\" target=\"_blank\">here</a>, as well as the assignments I completed <a href=\"01-Apuntes/02-Bachillerato/2/10-TLR-Tareas.pdf\" target=\"_blank\">here</a>. They are notes where I tried to be as neat as possible, and I believe they can be useful.",
    "lang-bach-s2-geom": "Geometry and Trigonometry",
    "lang-bach-s2-geom-1": "This math subject left me a bit dissatisfied. The class was taught by Professor Sergio Noé Hernández de Lira. In short, he's not an excellent teacher. He teaches the basics at a regular level, does his best to clarify doubts, but I think he falls short as a math teacher. Even in some classes, perhaps because he didn't know what to do, he made us watch a movie several times.",
    "lang-bach-s2-geom-2": "The notes I developed can be consulted <a href=\"01-Apuntes/02-Bachillerato/2/11-Geometria-Apuntes.pdf\" target=\"_blank\">here</a>, as well as the assignments I completed <a href=\"01-Apuntes/02-Bachillerato/2/12-Geometria-Tareas.pdf\" target=\"_blank\">here</a>. These notes may not be very useful, but personally, I tried to solve many of my own doubts in the field of geometry and trigonometry to the best of my ability.",
    "lang-bach-s2-msi": "Information Systems Management",
    "lang-bach-s2-msi-1": "Being the second part of the high school computer course, this subject taught us some basics of computer networks. We continued with programs from the Microsoft Office suite and also covered a bit of other useful software. The teacher did a good job in teaching us these topics, but I do think she lacked a bit more empathy with those students who weren't as quick with computers.",
    "lang-bach-s2-msi-2": "The subject didn't require taking notes as it was purely practical work on computer equipment, so I don't have many notes, although the subject was interesting. The few notes I developed can be found <a href=\"01-Apuntes/02-Bachillerato/2/13-MSI.pdf\" target=\"_blank\">here</a>.",
    "lang-bi": "International Baccalaureate",
    "lang-bi-1": "When I attended high school, the affiliated center to the Aguascalientes Autonomous University offered the option to enroll in the <a href=\"https://www.ibo.org/en/\" target=\"_blank\">International Baccalaureate</a> Diploma Program. This program consists of two years of courses, so by the middle of the second semester of high school, you are allowed to apply to this new program or continue in the program you are currently following.",
    "lang-bi-2": "It was my friends who encouraged me to try applying to the International Baccalaureate program, and I was chosen along with them to be part of the program in my generation. After discussing it with my family, it was an option we chose, and looking back, it's one of the best decisions I made. It's one of the best experiences I had, both in terms of education, thanks to the high quality of teachers, and socially. Without drifting away from my close friends from high school, I also met many more people whom I still consider close friends. The entire group of the International Baccalaureate, my \"IB Brothers\" were and continue to be my inspiration to work hard. Moreover, regardless of the educational program I'm talking about, I met incredible individuals, unique friends, people I hold dear and still cherish to this day.",
    "lang-bi-3": "Perhaps in terms of grades, I managed to improve my averages compared to the previous two semesters, but the demands had also increased significantly to levels of work I never imagined reaching. I experienced what I call \"my prime\" during this period, managing to work at high performance and with good efficiency throughout the semesters, even with very low sleep averages. I know that \"my prime\" remained in that stage because I now value sleep a lot, and although I may not return to that level of performance, I much prefer good rest nowadays.",
    "lang-bi-4": "I was part of the International Baccalaureate's May 2018 examination schedule signing up the subjects: \"Spanish A: Literature\" High Level obtaining 5 points, \"English B\" High Level scoring 5 points, \"History of America\" High Level obtaining 4 points, \"Mathematics\" Standard Level reaching 5 points, \"Biology\" Standard Level scoring 4 points and \"Chemistry\" Standard Level scoring 3 points; in addition to score 2 points due to score a B in my Extended Essay focused on Contemporary World Studies and also scoring a B in Theory of Knowledge which gives a total of 28 points achieved in this program.",
    "lang-bi-s3": "Third Semester",
    "lang-bi-s3-quote": "There was an idea called the Avengers initiative... - Nick Fury (The Avengers)",
    "lang-bi-s3-1": "This first semester of the International Baccalaureate was turbulent. It was a new stage. The friends I used to see for seven hours a day were no longer in the same classroom as me, although they were still in the same school. We were no longer in high school for seven hours, but for nine, meaning we went from 7:00 a.m. to 4:00 p.m. on campus in classes. The changes weren't easy, even with my friends whom I entered with, because we entered a new group, with people I didn't know yet and whom I thought would be very tough on us.",
    "lang-bi-s3-2": "However, as the semester progressed, we got to know each other, formed a very nice group, and consolidated the first step of this great stage with a lot of joy and support among us.",
    "lang-bi-s3-chem": "Chemistry 1",
    "lang-bi-s3-chem-1": "The Chemistry path of the Diploma Program was inaugurated by Professor Mónica Rosaura González Palacios, who introduced us to the way we would work in this academic program and guided us this semester with initial topics such as stoichiometry or introduction to the chemistry laboratory.",
    "lang-bi-s3-chem-2": "I must say that I liked her classes, although occasionally I found it somewhat boring to constantly stop with the slides, but I understood it, as we had to cover a lot of theory in two years. Fortunately, we had to do laboratory practices that made me feel like we were putting our knowledge into practice and they were very entertaining.",
    "lang-bi-s3-chem-3": "In this course, I developed my notes, which can be found <a href=\"01-Apuntes/03-BachilleratoInternacional/3/01-Quimica.pdf\" target=\"_blank\">here</a>. Despite considering them messy, I believe they provide a good overview of the topics covered in the subject, so they may be useful.",
    "lang-bi-s3-biol": "Biology 1",
    "lang-bi-s3-biol-1": "Professor Francisco Javier Acosta Collazo was the one who guided us throughout our journey in the International Baccalaureate Biology course. According to the program's teachers, it is largely thanks to him that discussions were held for the Autonomous University of Aguascalientes to open a venue for the International Baccalaureate program on its premises.",
    "lang-bi-s3-biol-2": "Regarding the classes, I wasn't entirely convinced by them. He's not a bad teacher by any means (at least I don't consider him one), but I think he leaves a large part of the learning to the student themselves. Considering that biology subjects in my first year of high school weren't my strength, it was even more challenging here. Despite all the studying I did, I never managed to score an exam in this subject (neither this semester nor in any of the subsequent ones) with a grade higher than 7 out of 10.",
    "lang-bi-s3-biol-3": "I think he was a good teacher, but personally, I felt somewhat alone while taking the course because I have always found this field difficult, and I felt a bit lacking in guidance to better understand these topics that we had already covered in Cellular Biology.",
    "lang-bi-s3-biol-4": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/3/02-Biologia.pdf\" target=\"_blank\">here</a>. Although I believe they are messy, I consider that they provide a good development of the topics covered in the subject, so they may be useful.",
    "lang-bi-s3-tdc": "Theory of Knowledge 1",
    "lang-bi-s3-tdc-1": "Teacher Yéshica Chávez Murillo is undoubtedly one of the leading educators who teach in the Diploma Program. As the teacher who teaches Theory of Knowledge, she taught us many things, including debating, arguing, questioning, formulating questions about reality, and preparing us for the products that must be delivered as part of this subject.",
    "lang-bi-s3-tdc-2": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/3/03-TdC.pdf\" target=\"_blank\">here</a>. Although I believe they are messy, I consider that they provide a good development of the topics covered in the subject, so they may be useful.",
    "lang-bi-s3-ingl": "English 1",
    "lang-bi-s3-ingl-1": "For better guidance in this subject, we had two teachers who would each take half of the group. Professor Isabel Fernández was the one assigned to me, giving me English classes where we learned and practiced, in addition to preparing us for the products required by the Diploma Program. This semester, we started by reading \"The Canterbury Tales\" for essays or audio recording products that would be done later on.",
    "lang-bi-s3-ingl-2": "Personally, I believe the teacher knows perfectly how to guide students to the products required by the International Baccalaureate and prepares us very well. Perhaps I didn't always understand the dynamics of the teacher, and that frustrated me at times, but in the end, it was evident that each dynamic was prepared with a well-thought-out purpose.",
    "lang-bi-s3-ingl-3": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/3/04-Ingles.pdf\" target=\"_blank\">here</a>. Although I believe they are messy, I consider that they provide a good development of the topics covered in the subject, so they may be useful.",
    "lang-bi-s3-lite": "Literature 1",
    "lang-bi-s3-lite-1": "Eduardo López Hernández, nicknamed \"Lobo\" (Wolf), is undoubtedly one of the best teachers of this stage. A reference in the International Baccalaureate, Professor Lobo guided us in literary interpretation from the beginning. None of us knew what it meant to interpret in the way the professor wanted us to. More than once, he became frustrated with our lack of creativity and ingenuity in interpreting texts, especially at the beginning, that is, mostly in this semester. With works like \"Prometheus Bound\", \"The Odyssey\", and some stories by Juan Rulfo, especially \"Anacleto Morones\" along with many other works, this introduction to literature was challenging for all of us. However, throughout the next semesters, we all tried to improve in literary interpretation.",
    "lang-bi-s3-lite-2": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/3/05-Literatura.pdf\" target=\"_blank\">here</a>. Despite believing they are messy, I consider that they offer a good development of the subject matter, so they may be useful.",
    "lang-bi-s3-cas": "Creativity Action Service 1",
    "lang-bi-s3-cas-1": "Professor Teresa de Jesús López Huerta guided us in this subject where they wanted to assimilate us to social service projects in simple terms. The idea of the subject is to build projects with a positive impact on society, and under the supervision of the teacher, projects were sought for each person to join. Along with some friends of mine, we chose a reforestation project in different areas of the municipality of Aguascalientes in this first semester of the Diploma Program, which was not bad at all, having various learnings and very gratifying experiences.",
    "lang-bi-s3-cas-2": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/3/06-CAS.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s3-fisi": "Physics 1",
    "lang-bi-s3-fisi-1": "This Physics subject was interesting, but sadly, it didn't lead to anything further because we couldn't register it as part of the subjects evaluated in the International Baccalaureate, so it lasted for two semesters and disappeared from the program without any future impact.",
    "lang-bi-s3-fisi-2": "Taught by Professor Coral Arreola Sámano, it was a quiet course. We learned the basics of certain physics and mechanics concepts, although at a very slow pace. From this point, we already knew that the subject wouldn't have an impact on the Diploma Program, and I believe that's why not enough effort was put into it.",
    "lang-bi-s3-fisi-3": "I don't consider the teacher in charge of the course to be bad, although some classes were boring, and at certain points, I felt like we weren't making progress on the topics.",
    "lang-bi-s3-fisi-4": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/3/07-Fisica.pdf\" target=\"_blank\">here</a>. Despite believing they are messy, I consider that they offer a good development of the topics covered in the subject, so they may be useful."
}