{
    "lang-sel-label": "Language: ",
    "lang-sel-opt-es": "Spanish",
    "lang-sel-opt-en": "English",
    "lang-port-name": "Joel Alejandro Espinoza Sánchez",
    "lang-port-title": "My Way",
    "lang-intro-title": "My Way",
    "lang-intro-p1": "I developed this website to showcase and comment on the learning I obtained and the products I made during my learning journey, from the notes I managed to salvage from my early education to those products of my most recent or self-taught education, as I present it divided by stages as shown below.",
    "lang-intro-p2": "Furthermore, I share my experiences of what it was like to study in the various institutions I attended, recounting both the positive experiences and the challenges. I provide a lot of study material that I created available to the public with the hope that these products may be useful to someone, either as study support material or for resolving doubts.",
    "lang-intro-p3": "Even though the text on this website is translated into english, the text of my notes in the PDF documents is not, since the PDFs were scanned just as I wrote each of my notes. Therefore, they may not be very useful as content if you wish to consult them in english.",
    "lang-bach": "High School",
    "lang-bach-1": "Even before entering high school, I already envisioned this stage as the time when I wanted my life to take a very drastic turn from the type of life I had in my previous stage, mainly in terms of social aspects.",
    "lang-bach-2": "My intention was never to neglect the (self-thought) great academic work I was doing in my basic education stage; however, I never took the time to build friendships, and I wanted to finally establish solid social relationships. I entered this three-year stage with this focus and goal primarily in mind.",
    "lang-bach-3": "I achieved this while also not neglecting my grades as much (except for the first year) and leaving this stage with memories of people with whom I am glad to maintain the bonds that I began some time ago.",
    "lang-bach-4": "I studied my high school in the central campus of the <a href=\"https://www.uaa.mx/portal/\" target=\"_blank\">Aguascalientes Autonomous University</a> High School Center from July 2015 to June 2018 being, in general, a very enjoyable experience from social aspects to academic terms.",
    "lang-bach-s1": "First Semester",
    "lang-bach-s1-quote": "All we can do is our best, and sometimes the best that we can do is to start over - Peggy Carter (Captain America: The Winter Soldier)",
    "lang-bach-s1-1": "This first semester was a wake-up call in terms of education, feeling that coming from my secondary I wasn't as prepared for the demands in certain subjects. I was very enthusiastic about the algebra course because Professor Eduardo Guerrero Miranda gave us a mathematics primer that sparked my curiosity for math. However, on the other hand, subjects like Biology or History felt overloaded with content that I thought I wouldn't be able to handle, not only in this semester but also in the continuation of these subjects in the next semester.",
    "lang-bach-s1-2": "However, despite things not going as smoothly, academically it wasn't so bad for me, as I managed to pass all the subjects satisfactorily this semester.",
    "lang-bach-s1-algb": "Algebra",
    "lang-bach-s1-algb-1": "We started the semester every day at 7:00 a.m. with the algebra class. Taught by Professor Eduardo Guerrero Miranda, the course was dynamic and sometimes frantic, but in my opinion, it was always interesting, where we learned the basics of algebra, including equations, fractions, factorization, and other topics that, from my perspective, were very well taught by the teacher.",
    "lang-bach-s1-algb-2": "With Professor Eduardo, I will feel eternally grateful for teaching me this course because through it, I understood mathematics after nine years of studying them without much enthusiasm, as I didn't know their use, comprehension, and application until this course. It was thanks to him that I became interested and passionate about them, so much so that even the professor himself noticed, pointing me towards an internal mathematics competition and motivating me to participate in larger competitions such as the mathematics olympiads, which I ended up participating in during the fourth semester of my high school (along with the support of another friend I met later on).",
    "lang-bach-s1-algb-3": "It was a course with definitions of some algebra topics, but mostly focused on completing exercises that allowed us to understand each topic of the course.",
    "lang-bach-s1-algb-4": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/02-Bachillerato/1/01-Algebra.pdf\" target=\"_blank\">here</a> despite thinking that they are messy notes with my handwriting, which has always been very ugly, I believe they represent a good development of the algebra topics, so they might be useful."
}