{
    "lang-title": "My Way",
    "lang-sel-label": "Language: ",
    "lang-sel-opt-es": "Spanish",
    "lang-sel-opt-en": "English",
    "lang-port-name": "Joel Alejandro Espinoza Sánchez",
    "lang-port-title": "My Way",
    "lang-port-quote": "Paving the way for those who come after me and honoring the way of those who precede me",
    "lang-intro-title": "My Way",
    "lang-intro-p1": "I developed this website to showcase and comment on the learning I obtained and the products I made during my learning journey, from the notes I managed to save from my early education to those products of my most recent or self-taught education, as I present it divided by stages as shown below.",
    "lang-intro-p2": "Furthermore, I share my experiences of what it was like to study in the various institutions I attended, recounting both the positive experiences and the challenges. I provide a lot of study material that I created available to the public with the hope that these products may be useful to someone, either as study support material or for resolving doubts.",
    "lang-intro-p3": "Even though the text on this website is translated into English, the text of my notes in the PDF documents is not, since the PDFs were scanned just as I wrote each of my notes. Therefore, they may not be very useful as content if you wish to consult them in English.",
    "lang-bach": "High School",
    "lang-bach-1": "Even before entering high school, I already envisioned this stage as the time when I wanted my life to take a very drastic turn from the type of life I had in my previous stage, mainly in terms of social aspects.",
    "lang-bach-2": "My intention was never to neglect the (self-thought) great academic work I was doing in my basic education stage; however, I never took the time to build friendships, and I wanted to finally establish solid social relationships. I entered this three-year stage with this focus and goal primarily in mind.",
    "lang-bach-3": "I achieved this while also not neglecting my grades as much (except for the first year) and leaving this stage with memories of people with whom I am glad to maintain the bonds that I began some time ago.",
    "lang-bach-4": "I studied my high school in the central campus of the <a href=\"https://www.uaa.mx/portal/\" target=\"_blank\">Aguascalientes Autonomous University</a> High School Center from July 2015 to June 2018 being, in general, a very enjoyable experience from social aspects to academic terms.",
    "lang-bach-s1": "First Semester",
    "lang-bach-s1-quote": "All we can do is our best, and sometimes the best that we can do is to start over - Peggy Carter (Captain America: The Winter Soldier)",
    "lang-bach-s1-1": "This first semester was a wake-up call in terms of education, feeling that coming from my secondary I wasn't as prepared for the demands in certain subjects. I was very enthusiastic about the algebra course because Professor Eduardo Guerrero Miranda gave us a mathematics primer that sparked my curiosity for math. However, on the other hand, subjects like Biology or History felt overloaded with content that I thought I wouldn't be able to handle, not only in this semester but also in the continuation of these subjects in the next semester.",
    "lang-bach-s1-2": "However, despite things not going as smoothly, academically it wasn't so bad for me, as I managed to pass all the subjects satisfactorily this semester.",
    "lang-bach-s1-algb": "Algebra",
    "lang-bach-s1-algb-1": "We started the semester every day at 7:00 a.m. with the algebra class. Taught by Professor Eduardo Guerrero Miranda, the course was dynamic and sometimes frantic, but in my opinion, it was always interesting, where we learned the basics of algebra, including equations, fractions, factorization, and other topics that, from my perspective, were very well taught by the teacher.",
    "lang-bach-s1-algb-2": "With Professor Eduardo, I will feel eternally grateful for teaching me this course because through it, I understood mathematics after nine years of studying them without much enthusiasm, as I didn't know their use, comprehension, and application until this course. It was thanks to him that I became interested and passionate about them, so much so that even the professor himself noticed, pointing me towards an internal mathematics competition and motivating me to participate in larger competitions such as the mathematics olympiads, which I ended up participating in during the fourth semester of my high school (along with the support of another friend I met later on).",
    "lang-bach-s1-algb-3": "It was a course with definitions of some algebra topics, but mostly focused on completing exercises that allowed us to understand each topic of the course.",
    "lang-bach-s1-algb-4": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/02-Bachillerato/1/01-Algebra.pdf\" target=\"_blank\">here</a> despite thinking that they are messy notes with my handwriting, which has always been very ugly, I believe they represent a good development of the algebra topics, so they might be useful.",
    "lang-bach-s1-hist": "Modern History",
    "lang-bach-s1-hist-1": "From my perspective, this subject was one of the two most difficult ones this semester. The subject demanded a lot of effort as it covered a lot of content from events prior to the First World War.",
    "lang-bach-s1-hist-2": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/02-Bachillerato/1/02-Historia-Apuntes.pdf\" target=\"_blank\">here</a>, where I tried to make them more carefully as our notes were evaluated. Similarly, the assignments we did in the subject can be found <a href=\"01-Apuntes/02-Bachillerato/1/03-Historia-Tareas.pdf\" target=\"_blank\">here</a>.",
    "lang-bach-s1-estr": "Cognitive Strategies",
    "lang-bach-s1-estr-1": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/02-Bachillerato/1/04-EstrategiasCognitivas.pdf\" target=\"_blank\">here</a>.",
    "lang-bach-s1-tics": "Technologies of Information and Communication",
    "lang-bach-s1-tics-1": "The subject was the computer science course of the semester, where they taught us many things related to computer equipment. We learned the basics of a computer, some Microsoft Office applications, and a bit about the informatics operation of the institution.",
    "lang-bach-s1-tics-2": "The subject didn't require taking notes as it was purely practical work on computer equipment, so I don't have many notes, although the subject was interesting. The few notes I developed can be found <a href=\"01-Apuntes/02-Bachillerato/1/05-TICs.pdf\" target=\"_blank\">here</a>.",
    "lang-bach-s1-biol": "Cellular Biology",
    "lang-bach-s1-biol-1": "This, along with the History course, was the most challenging aspect of this first semester for me. Cellular Biology was very difficult, the memorization here didn't feel pointless. We studied cellular structure (which, although there may be few organelles, I found it very cumbersome to learn all this) but we linked this with how each organelle participated in cellular functions when we reached this topic, so it was constantly progressing needing the previous knowledge.",
    "lang-bach-s1-biol-2": "The subject was taught to me by the great teacher Eduardo Alvarado Villalobos, who provided us with a lot of information and very clear explanations about Cellular Biology. His classes were very dynamic, and the way he explained and clarified our doubts was always very helpful for the entire class. I believe he was one of the main pillars for all the colleagues who specialized in natural sciences related to biology.",
    "lang-bach-s1-biol-3": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/02-Bachillerato/1/06-BiologiaCelular.pdf\" target=\"_blank\">here</a> which aren't very messy, nor are they very neat, but I believe they are very useful because of all the information given and structured in this course.",
    "lang-bach-s1-leng": "Language and Communication",
    "lang-bach-s1-leng-1": "The notes I developed can be found <a href=\"01-Apuntes/02-Bachillerato/1/07-Lengua.pdf\" target=\"_blank\">here</a>.",
    "lang-bach-s1-ingl": "English",
    "lang-bach-s1-ingl-1": "This English subject was entertaining. We learned English from a very academic perspective, but we also practiced by breaking away from the typical structure, engaging in long conversations or debates to solidify our mastery of English through conversation.",
    "lang-bach-s1-ingl-2": "It was a very interesting subject taught by teacher Olga Patricia de Luna Aguilar, with multiple ways of practicing and learning that I believe everyone enjoyed in the end.",
    "lang-bach-s1-ingl-3": "The notes I developed can be consulted <a href=\"01-Apuntes/02-Bachillerato/1/08-Ingles.pdf\" target=\"_blank\">here</a>, which are moderately neat, but I don't think they can be of any use because the course isn't fully explained with the few notes made.",
    "lang-bach-s2": "Second Semester",
    "lang-bach-s2-quote": "Sometimes, the thing you've been looking for your whole life is right there beside you all along - Peter Quill (Guardians of the Galaxy Volume 2)",
    "lang-bach-s2-1": "The second semester I experienced was essentially a very good continuation of the first six months at this educational institution. The friendships I had started the previous semester were being solidified in this semester, and I also had the opportunity to continue meeting more people from the institution, all with whom I spent good times.",
    "lang-bach-s2-2": "The continuation of a good social mood was still on the rise. Academically, I only hoped to improve a little on what I had achieved last semester, but I wasn't ashamed because I considered that I had made a good effort the previous semester.",
    "lang-bach-s2-3": "However, this semester presented us with the possibility of switching to the International Baccalaureate Diploma Programme, a doubt that left many of us in the class wondering if, for the third semester, we would sacrifice the friendships and the class we were in for the academic demand and the new and uncertain challenges of this program.",
    "lang-bach-s2-hist": "Contemporary History",
    "lang-bach-s2-hist-1": "The notes I developed can be consulted <a href=\"01-Apuntes/02-Bachillerato/2/01-Historia-Apuntes.pdf\" target=\"_blank\">here</a>, as well as the assignments I did <a href=\"01-Apuntes/02-Bachillerato/2/02-Historia-Tareas.pdf\" target=\"_blank\">here</a>.",
    "lang-bach-s2-etim": "Greco-Latin Etymologies",
    "lang-bach-s2-etim-1": "In this subject, we studied the etymological origin of a large part of the vocabulary used in Spanish, starting with roots from Greek and finishing the course with roots from Latin.",
    "lang-bach-s2-etim-2": "The course was taught by Professor Mary Antonia Montes, and I must say it was a good course. I feel like I learned to try to understand more than memorize the etymological roots of words, associating words that have similar prefixes or suffixes (or other structures) and thus associating the meaning of that etymological structure. It was a good course.",
    "lang-bach-s2-etim-3": "The notes I developed can be consulted <a href=\"01-Apuntes/02-Bachillerato/2/03-Etimologias-Apuntes.pdf\" target=\"_blank\">here</a>, as well as the assignments I completed <a href=\"01-Apuntes/02-Bachillerato/2/04-Etimologias-Tareas.pdf\" target=\"_blank\">here</a>. They are moderately neat notes, and with the variety of activities we did, they could be useful.",
    "lang-bach-s2-evol": "Evolution and Biodiversity",
    "lang-bach-s2-evol-1": "Professor Eduardo Alvarado Villalobos repeated as our teacher in this subject, which was a continuation of the Cellular Biology course from the previous semester. Following the same trend as last semester, the professor once again delivered an excellent class. With very clear examples of evolution theories and an extensive program on the biodiversity of living beings, I can still remember names of some domains, kingdoms, and phyla to this day. An excellent teacher who did a great job in teaching us these topics.",
    "lang-bach-s2-evol-2": "The notes I developed can be consulted <a href=\"01-Apuntes/02-Bachillerato/2/05-Evolucion-Apuntes.pdf\" target=\"_blank\">here</a>, as well as the assignments I completed <a href=\"01-Apuntes/02-Bachillerato/2/06-Evolucion-Tareas.pdf\" target=\"_blank\">here</a>. They are notes where I tried to be as neat as possible, and I believe they can be useful.",
    "lang-bach-s2-ingl": "English",
    "lang-bach-s2-ingl-1": "The notes I developed can be consulted <a href=\"01-Apuntes/02-Bachillerato/2/07-Ingles-Apuntes.pdf\" target=\"_blank\">here</a>, as well as the assignments I completed <a href=\"01-Apuntes/02-Bachillerato/2/08-Ingles-Tareas.pdf\" target=\"_blank\">here</a>. These notes may not reflect all the work done in class, but some activities may be useful.",
    "lang-bach-s2-tall": "Reading and Writing Workshop",
    "lang-bach-s2-tall-1": "The course, taught by Professor Rosa Imelda López Hurtado, was a truly serious course, I believe, very serious. We covered many topics related to Spanish, such as language functions, some literary devices, and other topics that I think were perfectly addressed, as well as reading works like \"The Widower Román\", \"Tomochic\", and \"White Nights\". Without a doubt, in terms of knowledge, it's a subject and a teacher that taught and allowed for very satisfactory learning.",
    "lang-bach-s2-tall-2": "The notes I developed can be consulted <a href=\"01-Apuntes/02-Bachillerato/2/09-TLR-Apuntes.pdf\" target=\"_blank\">here</a>, as well as the assignments I completed <a href=\"01-Apuntes/02-Bachillerato/2/10-TLR-Tareas.pdf\" target=\"_blank\">here</a>. They are notes where I tried to be as neat as possible, and I believe they can be useful.",
    "lang-bach-s2-geom": "Geometry and Trigonometry",
    "lang-bach-s2-geom-1": "The notes I developed can be consulted <a href=\"01-Apuntes/02-Bachillerato/2/11-Geometria-Apuntes.pdf\" target=\"_blank\">here</a>, as well as the assignments I completed <a href=\"01-Apuntes/02-Bachillerato/2/12-Geometria-Tareas.pdf\" target=\"_blank\">here</a>.",
    "lang-bach-s2-msi": "Information Systems Management",
    "lang-bach-s2-msi-1": "Being the second part of the high school computer course, this subject taught us some basics of computer networks. We continued with programs from the Microsoft Office suite and also covered a bit of other useful software. The teacher did a good job in teaching us these topics, but I do think she lacked a bit more empathy with those students who weren't as quick with computers.",
    "lang-bach-s2-msi-2": "The subject didn't require taking notes as it was purely practical work on computer equipment, so I don't have many notes, although the subject was interesting. The few notes I developed can be found <a href=\"01-Apuntes/02-Bachillerato/2/13-MSI.pdf\" target=\"_blank\">here</a>.",
    "lang-bi": "International Baccalaureate",
    "lang-bi-1": "When I attended high school, the affiliated center to the Aguascalientes Autonomous University offered the option to enroll in the <a href=\"https://www.ibo.org/en/\" target=\"_blank\">International Baccalaureate</a> Diploma Program. This program consists of two years of courses, so by the middle of the second semester of high school, you are allowed to apply to this new program or continue in the program you are currently following.",
    "lang-bi-2": "It was my friends who encouraged me to try applying to the International Baccalaureate program, and I was chosen along with them to be part of the program in my generation. After discussing it with my family, it was an option we chose, and looking back, it's one of the best decisions I made. It's one of the best experiences I had, both in terms of education, thanks to the high quality of teachers, and socially. Without drifting away from my close friends from high school, I also met many more people whom I still consider close friends. The entire group of the International Baccalaureate, my \"IB Brothers\" were and continue to be my inspiration to work hard. Moreover, regardless of the educational program I'm talking about, I met incredible individuals, unique friends, people I hold dear and still cherish to this day.",
    "lang-bi-3": "Perhaps in terms of grades, I managed to improve my averages compared to the previous two semesters, but the demands had also increased significantly to levels of work I never imagined reaching. I experienced what I call \"my prime\" during this period, managing to work at high performance and with good efficiency throughout the semesters, even with very low sleep averages. I know that \"my prime\" remained in that stage because I now value sleep a lot, and although I may not return to that level of performance, I much prefer good rest nowadays.",
    "lang-bi-4": "I was part of the International Baccalaureate's May 2018 examination schedule signing up the subjects: \"Spanish A: Literature\" High Level obtaining 5 points, \"English B\" High Level scoring 5 points, \"History of America\" High Level obtaining 4 points, \"Mathematics\" Standard Level reaching 5 points, \"Biology\" Standard Level scoring 4 points and \"Chemistry\" Standard Level scoring 3 points; in addition to score 2 points due to score a B in my Extended Essay focused on Contemporary World Studies and also scoring a B in Theory of Knowledge which gives a total of 28 points achieved in this program.",
    "lang-bi-s3": "Third Semester",
    "lang-bi-s3-quote": "There was an idea called the Avengers initiative... - Nick Fury (The Avengers)",
    "lang-bi-s3-1": "This first semester of the International Baccalaureate was turbulent. It was a new stage. The friends I used to see for seven hours a day were no longer in the same classroom as me, although they were still in the same school. We were no longer in high school for seven hours, but for nine, meaning we went from 7:00 a.m. to 4:00 p.m. on campus in classes. The changes weren't easy, even with my friends whom I entered with, because we entered a new group, with people I didn't know yet and whom I thought would be very tough on us.",
    "lang-bi-s3-2": "However, as the semester progressed, we got to know each other, formed a very nice group, and consolidated the first step of this great stage with a lot of joy and support among us.",
    "lang-bi-s3-chem": "Chemistry 1",
    "lang-bi-s3-chem-1": "The Chemistry path of the Diploma Program was inaugurated by Professor Mónica Rosaura González Palacios, who introduced us to the way we would work in this academic program and guided us this semester with initial topics such as stoichiometry or introduction to the chemistry laboratory.",
    "lang-bi-s3-chem-2": "I must say that I liked her classes, although occasionally I found it somewhat boring to constantly stop with the slides, but I understood it, as we had to cover a lot of theory in two years. Fortunately, we had to do laboratory practices that made me feel like we were putting our knowledge into practice and they were very entertaining.",
    "lang-bi-s3-chem-3": "In this course, I developed my notes, which can be found <a href=\"01-Apuntes/03-BachilleratoInternacional/3/01-Quimica.pdf\" target=\"_blank\">here</a>. Despite considering them messy, I believe they provide a good overview of the topics covered in the subject, so they may be useful.",
    "lang-bi-s3-biol": "Biology 1",
    "lang-bi-s3-biol-1": "Professor Francisco Javier Acosta Collazo was the one who guided us throughout our journey in the International Baccalaureate Biology course. According to the program's teachers, it is largely thanks to him that discussions were held for the Autonomous University of Aguascalientes to open a venue for the International Baccalaureate program on its premises.",
    "lang-bi-s3-biol-2": "Regarding the classes, I wasn't entirely convinced by them. He's not a bad teacher by any means (at least I don't consider him one), but I think he leaves a large part of the learning to the student themselves. Considering that biology subjects in my first year of high school weren't my strength, it was even more challenging here. Despite all the studying I did, I never managed to score an exam in this subject (neither this semester nor in any of the subsequent ones) with a grade higher than 7 out of 10.",
    "lang-bi-s3-biol-3": "I think he was a good teacher, but personally, I felt somewhat alone while taking the course because I have always found this field difficult, and I felt a bit lacking in guidance to better understand these topics that we had already covered in Cellular Biology.",
    "lang-bi-s3-biol-4": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/3/02-Biologia.pdf\" target=\"_blank\">here</a>. Although I believe they are messy, I consider that they provide a good development of the topics covered in the subject, so they may be useful.",
    "lang-bi-s3-tdc": "Theory of Knowledge 1",
    "lang-bi-s3-tdc-1": "Teacher Yéshica Chávez Murillo is undoubtedly one of the leading educators who teach in the Diploma Program. As the teacher who teaches Theory of Knowledge, she taught us many things, including debating, arguing, questioning, formulating questions about reality, and preparing us for the products that must be delivered as part of this subject.",
    "lang-bi-s3-tdc-2": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/3/03-TdC.pdf\" target=\"_blank\">here</a>. Although I believe they are messy, I consider that they provide a good development of the topics covered in the subject, so they may be useful.",
    "lang-bi-s3-ingl": "English 1",
    "lang-bi-s3-ingl-1": "For better guidance in this subject, we had two teachers who would each take half of the group. Professor Isabel Fernández was the one assigned to me, giving me English classes where we learned and practiced, in addition to preparing us for the products required by the Diploma Program. This semester, we started by reading \"The Canterbury Tales\" for essays or audio recording products that would be done later on.",
    "lang-bi-s3-ingl-2": "Personally, I believe the teacher knows perfectly how to guide students to the products required by the International Baccalaureate and prepares us very well. Perhaps I didn't always understand the dynamics of the teacher, and that frustrated me at times, but in the end, it was evident that each dynamic was prepared with a well-thought-out purpose.",
    "lang-bi-s3-ingl-3": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/3/04-Ingles.pdf\" target=\"_blank\">here</a>. Although I believe they are messy, I consider that they provide a good development of the topics covered in the subject, so they may be useful.",
    "lang-bi-s3-lite": "Literature 1",
    "lang-bi-s3-lite-1": "Eduardo López Hernández, nicknamed \"Wolf\" (Lobo), is undoubtedly one of the best teachers of this stage. A reference in the International Baccalaureate, Professor Lobo guided us in literary interpretation from the beginning. None of us knew what it meant to interpret in the way the professor wanted us to. More than once, he became frustrated with our lack of creativity and ingenuity in interpreting texts, especially at the beginning, that is, mostly in this semester. With works like \"Prometheus Bound\", \"The Odyssey\", and some stories by Juan Rulfo, especially \"Anacleto Morones\" along with many other works, this introduction to literature was challenging for all of us. However, throughout the next semesters, we all tried to improve in literary interpretation.",
    "lang-bi-s3-lite-2": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/3/05-Literatura.pdf\" target=\"_blank\">here</a>. Despite believing they are messy, I consider that they offer a good development of the subject matter, so they may be useful.",
    "lang-bi-s3-cas": "Creativity Action Service 1",
    "lang-bi-s3-cas-1": "Professor Teresa de Jesús López Huerta guided us in this subject where they wanted to assimilate us to social service projects in simple terms. The idea of the subject is to build projects with a positive impact on society, and under the supervision of the teacher, projects were sought for each person to join. Along with some friends of mine, we chose a reforestation project in different areas of the municipality of Aguascalientes in this first semester of the Diploma Program, which was not bad at all, having various learnings and very gratifying experiences.",
    "lang-bi-s3-cas-2": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/3/06-CAS.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s3-fisi": "Physics 1",
    "lang-bi-s3-fisi-1": "This Physics subject was interesting, but sadly, it didn't lead to anything further because we couldn't register it as part of the subjects evaluated in the International Baccalaureate, so it lasted for two semesters and disappeared from the program without any future impact.",
    "lang-bi-s3-fisi-2": "Taught by Professor Coral Arreola Sámano, it was a quiet course. We learned the basics of certain physics and mechanics concepts, although at a very slow pace. From this point, we already knew that the subject wouldn't have an impact on the Diploma Program, and I believe that's why not enough effort was put into it.",
    "lang-bi-s3-fisi-3": "I don't consider the teacher in charge of the course to be bad, although some classes were boring, and at certain points, I felt like we weren't making progress on the topics.",
    "lang-bi-s3-fisi-4": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/3/07-Fisica.pdf\" target=\"_blank\">here</a>. Despite believing they are messy, I consider that they offer a good development of the topics covered in the subject, so they may be useful.",
    "lang-bi-s3-hist": "History 1",
    "lang-bi-s3-hist-1": "Another great teacher to highlight in my time in the International Baccalaureate is Dr. Miriam Herrera Cruz. In addition to fostering a good teacher-student relationship with all of us, she always taught history in a very engaging way. I never felt that the teacher taught us with the sole objective of memorization, but rather to understand and discuss the facts, and yes, this was very influenced by the goals of the International Baccalaureate, but I also believe that it's commendable to carry it out in the excellent manner that the teacher did.",
    "lang-bi-s3-hist-2": "In this subject, we defined some topics that we would cover from the Diploma Programme, and especially in this semester, we covered the Prescribed Theme we chose from our History program, which was Theme 4: \"Rights and Protests\" covering topics of protests and racial events that occurred in the United States in the 19th and 20th centuries, as well as events related to Nelson Mandela in South Africa.",
    "lang-bi-s3-hist-3": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/3/08-Historia.pdf\" target=\"_blank\">here</a>. I consider them very useful as it was the first history subject to capture my attention to such an extent.",
    "lang-bi-s3-estu": "Mathematical Studies 1",
    "lang-bi-s3-estu-1": "Edgar Ahmed Muñoz Guzmán: The best teacher I've ever had.",
    "lang-bi-s3-estu-2": "Professor Ahmed guided us in the subject of Mathematical Studies excellently. The professor is extremely kind to everyone, mastering topics from various areas such as biology, chemistry, physics, mathematics, and computing. He explains calmly and patiently, encourages respect within the group, and does not tolerate mockery of \"silly questions\" which he answers with a lot of patience and empathy towards the students. Not only is he the best math teacher I've ever had, he's the best teacher overall I've ever had.",
    "lang-bi-s3-estu-3": "Professor Ahmed is undoubtedly the best teacher I've ever had. I won't repeat this in the following courses, but throughout the two years of the International Baccalaureate, he always maintained his great attitude. He was a teacher who, even if we asked him about biology, would respond with such ease that demonstrated his mastery but with certain intriguing aspects that left even students like me (who weren't very interested in that subject) questioning things to research and learn more. He was always open to answering questions, explaining patiently and kindly, and ensuring that his students truly understood those topics they were unsure about. It's thanks to him and Professor Eduardo Guerrero Miranda that I'm so passionate about mathematics topics nowadays.",
    "lang-bi-s3-estu-4": "During this course, we covered initial topics of the program, primarily some basics of mathematics such as numbers and algebra, and applications in finance, such as currency conversions, interests, as well as conic sections in analytical geometry.",
    "lang-bi-s3-estu-5": "In this course, I developed my notes which can be accessed <a href=\"01-Apuntes/03-BachilleratoInternacional/3/09-EM.pdf\" target=\"_blank\">here</a>, and I consider them to be highly valuable and significant.",
    "lang-bi-s4": "Fourth Semester",
    "lang-bi-s4-quote": "We must find a way to look after one another, as if we were one single tribe - T'Challa (Black Panther)",
    "lang-bi-s4-1": "With a semester of experience in these new territories, things were starting to take shape in the International Baccalaureate (IB) Program. It was evident how we were beginning to distance ourselves from the feelings of being in our old high school program and the challenges of the International Baccalaureate were starting to emerge. These challenges could now be faced with greater unity, as the third semester of high school helped us consolidate a very close and well-connected group.",
    "lang-bi-s4-2": "And so we began with the first projects, which also required unity and coordination among the entire group, further strengthening our bond. One such project was the Group 4 Project, or abbreviated as P4. This project involved addressing a problem using the knowledge areas of Group 4 of the International Baccalaureate, which encompass the experimental sciences, including biology, chemistry, and physics.",
    "lang-bi-s4-3": "Thus, we also began to work on significant individual projects, such as the development of the Extended Essay, a mini-thesis of 4,000 words on a specific topic using appropriate scientific methodology. This essay was one of the greatest challenges of the Diploma Programme. All of this was done while studying the topics that would be assessed in the External Assessments, the final exams of the programme, which conclude the International Baccalaureate studies.",
    "lang-bi-s4-biol": "Biology 2",
    "lang-bi-s4-biol-1": "I don't have much to comment on regarding this. The continuity of Professor Francisco Javier Acosta Collazo remained to maintain a certain consistency in the process we were undergoing, and his classes were essentially similar to those of the previous semester.",
    "lang-bi-s4-biol-2": "However, from this semester onwards, I felt more of that loneliness in learning, especially in this subject, because Professor Paquito had become the High School Center dean, which was noticeable in his classes. Nevertheless, the professor continued to support us in practical exercises, the products for the International Baccalaureate, and the P4.",
    "lang-bi-s4-biol-3": "I developed my notes for this course, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/4/01-Biologia.pdf\" target=\"_blank\">here</a>. They are messy and very brief, but they may be somewhat useful.",
    "lang-bi-s4-chem": "Chemistry 2",
    "lang-bi-s4-chem-1": "We had the first change in the teacher lineup for this subject. Professor Mónica did not continue teaching the chemistry class, and instead, we were advised by Professor Pedro Gabriel Láriz Durón. Professor Láriz was a good chemistry teacher with a good rapport with his students and a good way of explaining chemistry topics, among which we covered chemical kinetics, electrochemistry, and an introduction to organic chemistry.",
    "lang-bi-s4-chem-2": "The only thing I would point out is that it didn't adhere much to the Diploma Programme, which meant that we covered topics from Higher Level Chemistry that we weren't supposed to study, and we skipped essential topics from Standard Level Chemistry. It was chaotic when we realized this, and we would feel the consequences in future semesters. However, it's also worth mentioning that here, in the records submitted to the International Baccalaureate Organization as High School and Secondary Center of the U.A.A., we had the option to take Diploma assessments, choosing either Standard Level Chemistry or an Arts subject. This choice would divide the group for the next semester, either continuing with this subject or switching to Arts, depending on individual preference.",
    "lang-bi-s4-chem-3": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/4/02-Quimica.pdf\" target=\"_blank\">here</a>, and I consider them very useful.",
    "lang-bi-s4-tdc": "Theory of Knowledge 2",
    "lang-bi-s4-tdc-1": "The teacher Yéshica Chávez Murillo remained in charge of this subject, maintaining the continuity of the course with the teacher. She began to guide us, making some preparations for what would be the essay and the presentation, which are evaluated as part of Theory of Knowledge, teaching us to evaluate and explore the different areas and forms of knowledge to analyze different real situations depending on the knowledge questions that the International Baccalaureate Organization asks for each assessment.",
    "lang-bi-s4-tdc-2": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/4/03-TdC.pdf\" target=\"_blank\">here</a>, and I consider them very useful.",
    "lang-bi-s4-ingl": "English 2",
    "lang-bi-s4-ingl-1": "In the half where I was assigned for the English subject, we continued with continuity with teacher Isabel Fernández, following the same working method as the previous semester and essentially the same level of satisfaction with her subject as in previous semesters. Certainly, the more we advanced, the more I understood and enjoyed her classes. In this semester, we read 'The Picture of Dorian Gray' by Oscar Wilde to discuss it and review some of the questions addressed in this subject in both Internal and External Assessments.",
    "lang-bi-s4-ingl-2": "Additionally, the subject merged with Physics and CAS to develop this semester's CAS project, which involved explaining renewable energies in English to children to raise awareness about their appropriate use.",
    "lang-bi-s4-ingl-3": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/4/04-Ingles.pdf\" target=\"_blank\">here</a>. These are mostly in-class activities that with less context maybe they won't be so useful.",
    "lang-bi-s4-lite": "Literature 2",
    "lang-bi-s4-lite-1": "Teacher Wolf (Lobo) also continued with us for this new semester. In this new semester, we tried to learn and develop our interpretation skills better as a group. In class, we read stories by Guy de Maupassant, Edgar Allan Poe, Julio Cortázar, among others, as well as foreign literature throughout the semester to analyze their narrative style and the types of issues raised in these works. The works we read of this kind were \"Death in Venice\" by Thomas Mann, \"The Nonexistent Knight\" by Italo Calvino, \"Hamlet\" by William Shakespeare, and \"A Doll's House\" by Henrik Ibsen.",
    "lang-bi-s4-lite-2": "In general, I feel that we improved in text interpretation and continued to learn a lot from Professor Wolf (Lobo), so once again, this subject left us with a wealth of knowledge and a lot of preparation for the Diploma Program.",
    "lang-bi-s4-lite-3": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/4/05-Literatura.pdf\" target=\"_blank\">here</a>, and I consider them very useful.",
    "lang-bi-s4-cas": "Creativity Action Service 2",
    "lang-bi-s4-cas-1": "Teacher Teresa de Jesús López Huerta continued as our instructor in this subject, advising us on the CAS project for this semester. This semester, we decided to undertake a project different from those offered in previous semesters. Combining knowledge from Physics and English classes, we chose to create a project to raise awareness among elementary students at the Villalobos School in Aguascalientes about the use of renewable energies, while also aiming to teach some of these terms in English.",
    "lang-bi-s4-cas-2": "In this course, I didn't create notes specifically for the CAS subject. The material we prepared for the Clean Energizers sessions was included in the notes for English from this same semester.",
    "lang-bi-s4-fisi": "Physics 2",
    "lang-bi-s4-fisi-1": "Teacher Coral Arreola Sámano repeated as the instructor for this subject, which would also mark the end of the Physics course, as it wouldn't be included in the subjects registered for the Diploma, and therefore, it was discarded for future semesters.",
    "lang-bi-s4-fisi-2": "As for the subject content, we covered some topics on energy, delving into the subject of temperature and heat. However, most of the class time was used for the Group 4 project (P4) or for the CAS project planning. Sometimes, we planned CAS session activities that we would later deliver, or in the different teams of the P4 (where I was part of the Physics team), we devised the project we would undertake (that we as proud mexicans, decided to use prickly pear cactus for biogas production) and the diverse activities that the P4 teams would do.",
    "lang-bi-s4-fisi-3": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/4/06-Fisica.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s4-mono": "Extended Essay 1",
    "lang-bi-s4-mono-1": "This semester, we began the development of the Extended Essay. Guided by Teacher Leticia Vázquez Méndez, she provided excellent support throughout the entire process of the Extended Essay. Particularly in this semester, she introduced us to what it means to conduct an extended essay, showing us examples of previous extended essays, explaining the evaluation criteria according to the International Baccalaureate standards, and starting the process of finding an advisor for the Extended Essay.",
    "lang-bi-s4-mono-2": "In my case, I had started with ideas of doing a Mathematics and Computer Science or Mathematics and Music Extended Essay. I looked for some professors with knowledge in these areas and began to define the direction of my Extended Essay. However, seeing the extensive lack of knowledge I had in computer science, I ended up discarding the idea. With the support of Ladislao Rafael Juárez Rodríguez and Professor Guillermo Cebreros Lira, we began to define a topic for the Extended Essay that would involve the themes of Mathematics and Music for the end of this semester.",
    "lang-bi-s4-mono-3": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/4/07-Monografia.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s4-hist": "History 2",
    "lang-bi-s4-hist-1": "At the beginning of this semester, the continuity of Professor Miriam Herrera Cruz was maintained. However, midway through the semester, she had to withdraw to support the History Department of the Aguascalientes Autonomous University. As a result, she couldn't continue teaching our class, and halfway through the semester, Professor Diana Altagracia Muñoz Cruz took over this class.",
    "lang-bi-s4-hist-2": "This course continued with the topics from the prescribed theme that we covered last semester, in addition to starting with World History Topics. We chose topics 10: \"Authoritarian States (20th century)\" and 11: \"Causes and Consequences of 20th Century Wars\". However, we did feel a bit of sadness and less contact with Professor Altagracia. At least I felt that to some extent, we were returning to the type of history teaching that focuses on memorization.",
    "lang-bi-s4-hist-3": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/4/08-Historia.pdf\" target=\"_blank\">here</a> which I consider them very useful.",
    "lang-bi-s4-estu": "Mathematical Studies 2",
    "lang-bi-s4-estu-1": "Edgar Ahmed Muñoz Guzmán: The best teacher I've ever had.",
    "lang-bi-s4-estu-2": "Professor Ahmed maintained the excellent quality of the course that he had already provided us with last semester in this new semester, making it another great mathematics course that I was able to attend. During this course, we covered topics such as propositional logic, statistics, probability, and a bit of combinatorics.",
    "lang-bi-s4-estu-3": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/4/09-EM.pdf\" target=\"_blank\">here</a> which I consider them very useful and hold dear to my heart.",
    "lang-bi-s4-omm": "Mexican Mathematics Olympiad",
    "lang-bi-s4-omm-1": "Throughout this semester, the call for participating in the Mexican Mathematics Olympiad came out. Professor Eduardo Guerrero Miranda, who taught me Algebra in the first semester of this stage, had already advised me to participate. When the call came out, one of my International Baccalaureate classmates, Horacio Fernando Sáenz Díaz, was very excited to participate and even invited us to join the Olympiad.",
    "lang-bi-s4-omm-2": "We passed the initial exam held in February 2017, and from there, we had to attend courses to prepare ourselves with more advanced mathematics topics. Among these were geometry, where we studied properties of cyclic quadrilaterals, number theory and divisibility, which extensively covered modular arithmetic, algebra, and how to solve problems without finding the value of an unknown in an equation, among other very dense topics.",
    "lang-bi-s4-omm-3": "Additionally, Horacio and I managed to progress in another exam held around May to a final phase with few participants, to define in August 2017 the team that would advance to the regional and then to the national level. Sadly, I didn't manage to progress beyond this stage. However, fortunately, Horacio did qualify for the regional.",
    "lang-bi-s4-omm-4": "This stage of my life also left me with many friendships from the Olympiad, people who know a lot about these topics. Gustavo Meza, Tzoali Valdivia and Elías Loyola Campos were the ones who primarily led us throughout the preparation, and friends like Pedro, Lissette, Ricky and Juanito, whom I have held in high esteem since I met them.",
    "lang-bi-s4-omm-5": "During my time in the 31st Mexican Mathematics Olympiad, I developed notes on the new topics that were taught to us, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/4/10-OMM.pdf\" target=\"_blank\">here</a> and which I hold dear.",
    "lang-bi-s5": "Fifth Semester",
    "lang-bi-s5-quote": "So no matter how many hits I take, I always find the way to come back - Peter Parker (Spider-Man: Into The Spider-Verse)",
    "lang-bi-s5-1": "We entered the final year of high school, the penultimate semester of the International Baccalaureate, and things were drawing to a close. The external assessments were already looming, and the products to be delivered for the internal assessments were also drawing nearer.",
    "lang-bi-s5-2": "Intensive studying increased significantly this semester. The time to continue studying, practically conducting research for each subject, working on the Monograph, preparing for university, and tackling the other internal assessment projects we had ahead of us posed a considerable challenge given the limited time we had. However, we tried to support each other, and personally, with the highest performance of my life but with sleep hours dropping like a roller coaster at full throttle, many of the assignments were completed this semester.",
    "lang-bi-s5-3": "On top of everything, some of the classmates who were considering using the Diploma had the limitation that Mathematical Studies didn't meet the minimum requirements for certain university applications. Therefore, it was necessary to upgrade the assessment to Mathematics at the Standard Level, and for this, it required people willing to take on the challenge. I accepted to join this group and by the end of the semester, I enrolled as part of the applicants for Mathematics Standard Level.",
    "lang-bi-s5-biol": "Biology 3",
    "lang-bi-s5-biol-1": "Professor Francisco Javier Acosta Collazo's continuity remained to maintain some consistency in the process we were undergoing, and his classes were essentially similar to those of the previous semester.",
    "lang-bi-s5-biol-2": "In this semester, we began individual research projects, which are evaluated as part of the International Baccalaureate internal assessments. I started developing my research based on statistical evidence regarding the impact of eucalyptus and mesquite on soil. The culmination would come in the following semester.",
    "lang-bi-s5-biol-3": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/5/01-Biologia.pdf\" target=\"_blank\">here</a>. I think these are very messy and few notes but maybe with some utility.",
    "lang-bi-s5-chem": "Chemistry 3",
    "lang-bi-s5-chem-1": "I was among those who, when given the option to present the Diploma with Chemistry or with Arts, chose the former subject. There was another change of teacher in this subject, and this time, Professor Guilda Guzmán Colis joined as a new teacher in the Diploma Program. Because of this, many of us thought that she might not be familiar with how the program works, wouldn't assist us as much, or the end of this subject in the International Baccalaureate could be more challenging.",
    "lang-bi-s5-chem-2": "However, despite many complications we faced, such as the lack of laboratory practices from the previous semester and the constant confusion from the previous semester where irrelevant topics were covered while important ones were overlooked, the teacher did an excellent job in providing a review of previous learning and organizing the topics that we should indeed be familiar with. Additionally, she caught up on the laboratory practices this semester, guided us in the initial stages of the individual research, and continued with the topics at hand, now addressing the elective subjects. We began this semester with the Materials elective.",
    "lang-bi-s5-chem-3": "During this course, I developed my notes, which can be accessed <a href=\"01-Apuntes/03-BachilleratoInternacional/5/02-Quimica.pdf\" target=\"_blank\">here</a>. These are notes that I consider to be potentially useful.",
    "lang-bi-s5-ingl": "English 3",
    "lang-bi-s5-ingl-1": "We maintained continuity with Professor Isabel Fernández, keeping the same working method as the previous semester and essentially the same working dynamics as in previous semesters. During this semester, we read \"Animal Farm\" by George Orwell to prepare for some of the questions addressed in this subject, both in the Internal and External Assessments.",
    "lang-bi-s5-ingl-2": "During this course, I developed my notes, which can be accessed <a href=\"01-Apuntes/03-BachilleratoInternacional/5/03-Ingles.pdf\" target=\"_blank\">here</a>. They mainly consist of in-class activities, so without much context, they may not be as useful.",
    "lang-bi-s5-tdc": "Theory of Knowledge 3",
    "lang-bi-s5-tdc-1": "Professor Yéshica Chávez Murillo remained in charge of this subject, maintaining continuity with the course. Sadly, it would be the last time she would hold this position due to certain differences that led to her departure at the end of this semester. The teacher guided us through the final drafting of our Theory of Knowledge essays, where we debated a knowledge question with certain real-life situations to reach a conclusion. Among the questions we could choose from, I decided to work with the following statement:",
    "lang-bi-s5-tdc-2": "<i>\"While the fields of study in different academic disciplines may share common elements, adopting interdisciplinary approaches to knowledge production only leads to confusion\". Discuss this statement.</i>",
    "lang-bi-s5-tdc-3": "The culmination of this product would come in the next semester.",
    "lang-bi-s5-tdc-4": "During this course, I developed my notes, which can be accessed <a href=\"01-Apuntes/03-BachilleratoInternacional/5/04-TdC.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s5-lite": "Literature 3",
    "lang-bi-s5-lite-1": "Professor Wolf (Lobo) continued leading the literature class with the same high quality, and this is where I believe the group, in general, had gained more mastery in interpretation, which was mostly to the professor's liking. Thus, the dynamics began to streamline in the literature class.",
    "lang-bi-s5-lite-2": "For the assessments, we also had to analyze literature that was closer to our culture, so if we had already read texts written in another language, it was time to analyze texts written in Spanish. The most important pillars of reading for this semester, which would count towards the assessments, were \"Pedro Páramo\" by Juan Rulfo, \"Chronicle of a Death Foretold\" by Gabriel García Márquez, and \"Aura\" by Carlos Fuentes. Additionally, we read much more literature to continue practicing interpretation in the same way we began reading poems, which would be a significant core of the subject in the following semester.",
    "lang-bi-s5-lite-3": "The literature essay is another product that must be completed for the internal assessments of the Diploma Program, which I focused on the figure of the protagonist and the reflection it portrays in the meta-text presented in the work \"The Nonexistent Knight\" by Italo Calvino.",
    "lang-bi-s5-lite-4": "During this course, I developed my notes, which can be accessed <a href=\"01-Apuntes/03-BachilleratoInternacional/5/05-Literatura.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s5-cas": "Creativity Action Service 3",
    "lang-bi-s5-cas-1": "Professor Teresa de Jesús López Huerta continued to guide us in this subject where we resumed the projects from the third semester. Once again, along with some friends of mine, we chose a Reforestation project in different areas of the Aguascalientes municipality, which turned out quite well, providing varied learnings and very rewarding experiences.",
    "lang-bi-s5-cas-2": "During this course, I developed my notes, which can be accessed <a href=\"01-Apuntes/03-BachilleratoInternacional/5/06-CAS.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s5-mono": "Extended Essay 2",
    "lang-bi-s5-mono-1": "The intense semester of the Monograph had arrived, and it was time to develop the project as best as possible. After vacation discussions with Professor Guillermo Cebreros Lira, we began to narrow down a research topic where we could mathematically explain two musical scales, which ultimately turned into performing a mathematical conversion from one musical scale to another and explaining this conversion. The process was very long and burdensome, all supervised by Professor Leticia Vázquez Méndez, who remained as the teacher in charge of overseeing this major project.",
    "lang-bi-s5-mono-2": "At the end of the semester, we had managed to develop a solid draft that would require some fine-tuning to be completed in the next semester. If all went well, we planned to submit it well in advance to move on to the other pending projects of the International Baccalaureate.",
    "lang-bi-s5-mono-3": "During this course, I developed very few notes, but they can be found <a href=\"01-Apuntes/03-BachilleratoInternacional/5/07-Monografia.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s5-estu": "Mathematical Studies 3",
    "lang-bi-s5-estu-1": "Edgar Ahmed Muñoz Guzmán: The best teacher I've ever had.",
    "lang-bi-s5-estu-2": "Professor Ahmed maintained the excellent quality of the course that he had already provided us with last semester, making it another great mathematics course that I was able to attend. During this course, we studied probability distributions and delved into differential calculus primarily. Additionally, the professor began to discuss with us the idea of starting to develop our mathematics research.",
    "lang-bi-s5-estu-3": "We also discussed with the professor the possibility of switching from Mathematical Studies to Mathematics Standard Level, which was a complicated debate due to the preparation it required, the necessity of doing so, the availability of the professor, and many other issues that we discussed with him.",
    "lang-bi-s5-estu-4": "During this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/5/08-EM.pdf\" target=\"_blank\">here</a>. I consider them to be very useful and hold them dear.",
    "lang-bi-s5-hist": "History 3",
    "lang-bi-s5-hist-1": "Being Professor Diana Altagracia Muñoz Cruz's first complete course, many of the feelings from the previous semester were reinforced here. We truly felt a bit isolated when it came to preparing for this subject in the final assessments. Transitioning from perhaps being one of the \"easier\" subjects among the registered subjects (which is why strategically this subject is chosen as higher level from generation to generation), it became, at least personally, another subject that required a heavy burden to carry to a successful outcome, minimizing damage as much as possible.",
    "lang-bi-s5-hist-2": "In the subject, we finished covering the topics of world history and began with the Higher Level option, in which we chose \"History of America\" reviewing some of the most important wars in South America, certain conflicts in Mexico with relevance such as the Mexican Revolution, and even some manifestations of the 20th century that happened in the United States. We also started the individual history research where I decided to investigate the economic importance of the J.M. Romo company in Aguascalientes; a project that would be restructured and completed in the following semester.",
    "lang-bi-s5-hist-3": "During this course, I developed very few notes, but they can be accessed <a href=\"01-Apuntes/03-BachilleratoInternacional/5/09-Historia.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s6": "Sixth Semester",
    "lang-bi-s6-quote": "Part of the journey is the end - Tony Stark (Avengers: Endgame)",
    "lang-bi-s6-1": "Every story must have an ending. Here, even though this semester also encompasses the climax of the International Baccalaureate, the completion of projects, and the presentation of external assessments (which is essentially the most tense moment of the Diploma Programme), it also meant bidding farewell to a great stage.",
    "lang-bi-s6-2": "Firstly, academically speaking, this semester marked \"my prime\" meaning my peak, my best performance in every sense. It was during this semester that I averaged the fewest hours of sleep. I remember that from January until around April, many nights consisted of going to bed around 3:00 in the morning and getting up at 5:30 for classes to continue reviewing and preparing for the imminent final assessments. However, I didn't feel as tired; perhaps it was the pressure of everything that needed to be done that didn't allow me to feel sleepy.",
    "lang-bi-s6-3": "Many things continued to happen in this semester (honestly, I don't even know with what energy) among many innovations and projects we had never done before, as well as starting to think about our university future. All my friends sought to fly. Many did fly out of state. I had several opportunities to leave, mainly with friends, to study for a degree in Guanajuato, Guadalajara, Ciudad de México, Querétaro and Puebla. Ultimately, I stayed in Aguascalientes, but the end of an era was approaching.",
    "lang-bi-s6-4": "This semester also marks the farewell to an environment where everything fit harmoniously. The friendships I had made, the interaction and friendship among everyone, and it was clear that everything that was built in the first year of high school was coming to an end. Watching my friends choose their careers, complete the International Baccalaureate, reaching the last day of classes we had in April, saying goodbye...",
    "lang-bi-s6-biol": "Biology 4",
    "lang-bi-s6-biol-1": "The continuity of Professor Francisco Javier Acosta Collazo remained to maintain a certain consistency in the process we were undergoing, and his classes were essentially similar to those of the previous semester.",
    "lang-bi-s6-biol-2": "This semester, we began to prepare intensively for the external assessments and completed the individual research, which in the end was indeed based on statistical evidence regarding the impact of eucalyptus and mesquite on soil. I read some sites like <a href=\"https://ibsurvival.com/topic/15431-publishing-your-extended-essay/\" target=\"_blank\">IB Survival</a> to find out if I could attach my biology research here and if there were no issues with the International Baccalaureate Organization, even though I am already graduated and have my score. Since I don't know, I haven't attached it here yet.",
    "lang-bi-s6-biol-3": "However, with these products, Professor Paquito decided to open a digital publishing house through the Aguascalientes Autonomous University called <a href=\"https://revistas.uaa.mx/index.php/bi\" target=\"_blank\">BInvestigation (BInvestigación)</a> which we inaugurated by publishing articles of the research we had conducted for the International Baccalaureate. The first issue, featuring our articles, was published a year after we graduated, in March 2019. Among those I proposed is my biology research, which can be consulted <a href=\"https://revistas.uaa.mx/index.php/bi/issue/view/221\" target=\"_blank\">here</a> which is entitled: <a href=\"https://revistas.uaa.mx/index.php/bi/article/view/1814/1729\" target=\"_blank\"><i>\"Difference in soil moisture between Eucalyptus globulus and Prosopis glandulosa in different areas of Aguascalientes\"</i></a>",
    "lang-bi-s6-biol-4": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/6/01-Biologia.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s6-chem": "Chemistry 4",
    "lang-bi-s6-chem-1": "Teacher Guilda Guzmán Colis closed this International Baccalaureate process with us, also advising us during this last semester alongside maintaining the high quality of classes and learning. Here, we reviewed all the knowledge, in addition to exploring another elective, 'Medicinal Chemistry,' which concluded our preparation for the Diploma exams.",
    "lang-bi-s6-chem-2": "This semester, we began preparing for the external assessments and conducted individual research, which involved experimentally performing the test of an electrochemical cell to demonstrate the activity of the two chemical half-equations involved in the demonstration. I read some sites like <a href=\"https://ibsurvival.com/topic/15431-publishing-your-extended-essay/\" target=\"_blank\">IB Survival</a> to find out if I could attach my chemistry research here and if there were no issues with the International Baccalaureate Organization, even though I am already graduated and have my score. Since I don't know, I haven't attached it here yet.",
    "lang-bi-s6-chem-3": "Among the articles I proposed for publication in the digital editorial <a href=\"https://revistas.uaa.mx/index.php/bi\" target=\"_blank\">BInvestigation (BInvestigación)</a> my chemistry research was among those submitted for publication but ultimately wasn't selected. However, the draft is available for consultation <a href=\"01-Apuntes/03-BachilleratoInternacional/6/13-ArticuloCientificoQuimica.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s6-chem-4": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/6/02-Quimica.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s6-ingl": "English 4",
    "lang-bi-s6-ingl-1": "We maintained continuity with Teacher Isabel Fernández, continuing the same work format as last semester and essentially the same work dynamic as in previous semesters. This semester, we read stories by Isaac Asimov to prepare for some of the questions addressed primarily in the External Assessments.",
    "lang-bi-s6-ingl-2": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/6/03-Ingles.pdf\" target=\"_blank\">here</a>. They mostly consist of in-class activities and may not be as useful without much context.",
    "lang-bi-s6-mono": "Extended Essay 3",
    "lang-bi-s6-mono-1": "We concluded the Extended Essay process with support from Teacher Leticia Vázquez Méndez and personally, guided by Professor Guillermo Cebreros Lira, to draft and finalize it. We carried out a Extended Essay on Contemporary World Studies, involving the areas of Mathematics and Music, by conducting a mathematical conversion of one musical scale to another and explaining this conversion. The process was lengthy and challenging, but we managed to finish it by mid-February so that we could all present our Extended Essays to the class and invited family members.",
    "lang-bi-s6-mono-2": "At the end of the semester, we had managed to develop a solid draft that would require some fine-tuning to be carried out in the next semester. If everything went well, we planned to submit it well in advance to accommodate other pending projects in the International Baccalaureate program.",
    "lang-bi-s6-mono-3": "I read some sites like <a href=\"https://ibsurvival.com/topic/15431-publishing-your-extended-essay/\" target=\"_blank\">IB Survival</a> to find out if I could attach my extended essay here and if there were no issues with the International Baccalaureate Organization, even though I am already graduated and have my score. Since I don't know, I haven't attached it here yet.",
    "lang-bi-s6-mono-4": "In this course, I developed very few notes, but they can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/6/04-Monografia.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s6-tdc": "Theory of Knowledge 4",
    "lang-bi-s6-tdc-1": "After the issues we faced last semester, spirits were low, but the show had to go on. Professor Rodrigo Antonio Ramírez Roa stepped in to help us finish the subject, although in sessions outside the classroom, Teacher Yéshica Chávez Murillo continued to support and provide feedback to ensure the completion of the essay, which was successfully finished on time by mid this course.",
    "lang-bi-s6-tdc-2": "In this course, I made very few notes, but they can be accessed <a href=\"01-Apuntes/03-BachilleratoInternacional/6/05-TdC.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s6-lite": "Literature 4",
    "lang-bi-s6-lite-1": "Professor Wolf (Lobo) concluded this process maintaining the same high quality in his classes, providing a great finale to the sessions we had in this two-year period in the program.",
    "lang-bi-s6-lite-2": "Additionally, for assessments, we had to analyze poetry, so this semester was mainly dedicated to interpreting poems by Alfonsina Storni, Mario Benedetti, and Octavio Paz. With the literature essay completed, this was one of the most solid subjects in terms of preparation for the assessments.",
    "lang-bi-s6-lite-3": "In this course, I developed my notes which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/6/06-Literatura.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s6-cas": "Creativity Action Service 4",
    "lang-bi-s6-cas-1": "We concluded the process with Professor Teresa de Jesús López Huerta, where projects from previous semesters were revisited, but now with the limitation for some of not being able to choose the same project three times. That meant I couldn't choose Reforestation again. So, along with some friends, I embarked on a project to help an association that cared for children and adults with cancer, which was a very beautiful experience.",
    "lang-bi-s6-cas-2": "In this course, I made very few notes, but they can be accessed <a href=\"01-Apuntes/03-BachilleratoInternacional/6/07-CAS.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s6-estu": "Mathematical Studies 4",
    "lang-bi-s6-estu-1": "Edgar Ahmed Muñoz Guzmán: The best teacher I've ever had.",
    "lang-bi-s6-estu-2": "Professor Ahmed concluded the mathematics program process maintaining excellent quality until the end. It's worth noting that I still attended this course, but it was focused on the assessments for the subject 'Mathematical Studies.' In another section, I highlight the preparation for Mathematics Standard Level. In this class, we reviewed topics from previous semesters, and with some free time, Professor Ahmed provided us with additional math topic guides for university entrance exams, which was very helpful.",
    "lang-bi-s6-estu-3": "Even though the teacher didn't have time to teach us Mathematics Standard Level, for those of us who switched subjects, he still assisted us in our mathematical research, provided guidance for exams, and sought out material for us to learn in order to perform better in the final assessments. He also personally supported me in my mathematics research, which involved exploring combinatorics to model the problem: What would be the most secure password for a cell phone, considering the pattern, PIN, and text password?",
    "lang-bi-s6-estu-4": "I read some sites like <a href=\"https://ibsurvival.com/topic/15431-publishing-your-extended-essay/\" target=\"_blank\">IB Survival</a> to find out if I could attach my mathematics research here and if there were no issues with the International Baccalaureate Organization, even though I am already graduated and have my score. Since I don't know, I haven't attached it here yet. However, I am attaching some drafts of the combinatorial proposal for the three problems, as the pattern was the most complicated to model in terms of combinatorics, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/6/11-MateNM-IA.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s6-estu-5": "Among the articles I proposed for publication in the digital editorial <a href=\"https://revistas.uaa.mx/index.php/bi\" target=\"_blank\">BInvestigation (BInvestigación)</a> my mathematics research was among those submitted for publication but ultimately wasn't selected. However, the draft is available for consultation <a href=\"01-Apuntes/03-BachilleratoInternacional/6/14-ArticuloCientificoMatematicas.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s6-estu-6": "In this course, I developed my notes, which can be consulted <a href=\"01-Apuntes/03-BachilleratoInternacional/6/08-EM.pdf\" target=\"_blank\">here</a>. I consider them highly useful and hold them dear to my heart.",
    "lang-bi-s6-hist": "History 4",
    "lang-bi-s6-hist-1": "We concluded the history preparation with Teacher Diana Altagracia Muñoz Cruz, reviewing everything we had studied with the sentiments of previous semesters.",
    "lang-bi-s6-hist-2": "This semester, the history research concluded, shifting to a guided investigation on reviewing the economic importance of the company \"Maquinaria Triunfo\" in Aguascalientes.",
    "lang-bi-s6-hist-3": "I read some sites like <a href=\"https://ibsurvival.com/topic/15431-publishing-your-extended-essay/\" target=\"_blank\">IB Survival</a> to find out if I could attach my history research here and if there were no issues with the International Baccalaureate Organization, even though I am already graduated and have my score. Since I don't know, I haven't attached it here yet.",
    "lang-bi-s6-hist-4": "In this course, I made very few notes, but they can be accessed <a href=\"01-Apuntes/03-BachilleratoInternacional/6/09-Historia.pdf\" target=\"_blank\">here</a>.",
    "lang-bi-s6-mate": "Mathematics Standard Level",
    "lang-bi-s6-mate-1": "As I mentioned in the Mathematics Studies section of this semester, Professor Ahmed didn't have time to prepare us for this change in exams. Therefore, he could assist us in research and provide individual guidance, but the bulk of the material had to be reviewed individually by us.",
    "lang-bi-s6-mate-2": "It is how I have done the creation I am most proud of: <a href=\"01-Apuntes/03-BachilleratoInternacional/6/10-MateNM.pdf\" target=\"_blank\">my Mathematics Standard Level notes</a>. The entire International Baccalaureate stands out for being a highly self-taught and individualized learning experience. However, there was no other subject in which we had to be at this level of research and self-learning as in mathematics, less than five months before presenting the final assessments of the Diploma Programme.",
    "lang-bi-s6-mate-3": "I started studying for this new modality of mathematics since we finished fifth-semester vacations. With the help of the International Baccalaureate Mathematics Standard Level book, I divided the topics and organized them into a schedule that seemed almost impossible for me to fulfill, with six units to cover, in addition to conducting research and reviewing for both this subject and others.",
    "lang-bi-s6-mate-4": "It is mainly thanks to this subject, the reason for my sleepless nights this season, as I barely used my daytime to address all the pending tasks for other subjects. It was only by midnight that I could finally clear my schedule to progress with this subject. I consider it a success to see the level of self-learning ability I gained through this experience, the way I discovered how I learn, and learning so many things. It is always special to revisit my notes from this preparation.",
    "lang-bi-s6-fisi": "Physics: UAA Admission",
    "lang-bi-s6-fisi-1": "To study for my bachelor's degree, I applied for the Engineering in Intelligent Computing program at the Aguascalientes Autonomous University, which would assess advanced knowledge of mathematics and physics in its admission exam.",
    "lang-bi-s6-fisi-2": "The admission exam, which included these more specialized subjects, was scheduled for Saturday, May 19, 2018, while the external assessments ended on Thursday, May 17. Since April, I had also been focused on reviewing Physics, especially (as my strategy was to assume that what I knew from Mathematics Standard Level was sufficient). If I started doing the calculations, we had only completed two courses of physics, and surely there were people who had dedicated at least 150 hours to learning physics solely in the classroom, not counting study outside of class.",
    "lang-bi-s6-fisi-3": "So, I was studying on my own, perhaps in a somewhat disorganized manner. It wasn't until I saw Professor Ahmed again, who, noticing my nervousness, I shared my concern about not feeling prepared for this admission exam. Besides being the best teacher I've ever had, I owe my admission to the career infinitely to Professor Ahmed because he supported me with a study guide and review exercises that he typically prepares as guidance for these exams.",
    "lang-bi-s6-fisi-4": "I couldn't dedicate much time to reviewing with this material while we were still in external assessments because the exams were very exhausting. It wasn't until Thursday, May 17, when I saw the vast majority of my friends celebrating, feeling that 'weight off their shoulders,' going out to celebrate that all the effort had ended, that I had to go home, continue reviewing, use everything I had available from Thursday, everything I had available from Friday, and even the hours before the exam to review by elaborating on <a href=\"01-Apuntes/03-BachilleratoInternacional/6/15-Fisica-Admision-UAA.pdf\" target=\"_blank\">my study notes for the physics admission exam</a> with which, I studied diligently for the exam, and finally, after finishing that exam, I collapsed, experiencing my best rest in a long time. Finally, I had been able to witness the dawn of a universe at peace.",
    "lang-lic": "Bachelor's degree",
    "lang-lic-1": "Summarizing five years of studies and experiences in these paragraphs is challenging. Emotionally, I started the stage poorly, carrying many things that weighed me down at the beginning, but gradually this situation improved. In terms of motivation, I started with a lot of enthusiasm, but halfway through the degree, I lost my enthusiasm for the career due to, in my opinion, the change in the class dynamics after the major event that occurred during this stage, which was the COVID-19 pandemic.",
    "lang-lic-2": "However, the learning I gained from certain subjects was significant. There are many experiences from here that I will cherish with pleasure, and undoubtedly, the friends I made during this stage I hold dear with great affection. They helped me undergo one of the most important character developments of my life, and they are individuals I hope to take with me for many more future experiences.",
    "lang-lic-3": "I studied the Engineering in Intelligent Computing in the <a href=\"https://www.uaa.mx/portal/\" target=\"_blank\">Aguascalientes Autonomous University</a> from July 2018 to June 2023 with a probable high performance and accompanied with experiences like multiple participations in ICPC events. I have a code repository that I developed during my bachelor's degree that can be consulted <a href=\"https://github.com/Joul24py/UAA-ICI\" target=\"_blank\">here</a>.",
    "lang-lic-cp": "Preparatory Courses",
    "lang-lic-cp-quote": "A long time ago in a galaxy far away... - Star Wars",
    "lang-lic-cp-1": "This is the beginning of a new era, a new stage, a new saga. The story is very different from the previous stage. Starting this phase was challenging for me, and the first semesters were proof of that, especially socially speaking. However, I entered the program very motivated to give my 100% and to strive as much as possible to continue growing and learning. Thus, I began the program with a lot of energy, giving my all, exerting maximum effort in this long sprint of five years...",
    "lang-lic-cp-mate": "Mathematics Preparatory",
    "lang-lic-cp-mate-1": "To get us up to speed in the two most important areas of the program, we were given some preparatory courses. The first one was in mathematics, taught by the Professor Juan Manuel Pérez Rosales, also known as Juan Pérez. He is a professor who clearly knows a great deal about mathematics; the way he explains mathematical concepts is incredible. The preparatory course was quite impactful for me. He explained the construction of mathematics starting from numbers and primitive operations, 0 and 1, addition and multiplication. From there, he built everything we now know about mathematics. It was a good course to give us a quick overview of the mathematics we needed to know and what we would encounter in subsequent semesters.",
    "lang-lic-cp-mate-2": "My notes for this preparatory course can be consulted <a href=\"01-Apuntes/04-Licenciatura/00/01-Matematicas.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-cp-prog": "Programming Preparatory",
    "lang-lic-cp-prog-1": "Similarly, we were also sought to get up to speed in programming since many of us had never programmed before, myself included. The preparatory course was taught to half of the group by Professor Alejandro Padilla Díaz and to the other half by Professor Miguel Ángel Meza de Luna. I was in the second group with Professor Miguel Ángel Meza de Luna.",
    "lang-lic-cp-prog-2": "The preparatory course taught by Professor Miguel Ángel Meza de Luna seemed excellent to me. I found it provided the best foundations using pseudocode with PseInt to learn the basic structures of programming. With that, I felt like I could build my minimum foundations to navigate through the rest of the program, and that's pretty much how it turned out. In addition to that, the professor's attitude was very helpful due to his proactivity. His course seemed excellent to me as an introduction from the programming perspective.",
    "lang-lic-cp-prog-3": "My notes from this preparatory course can be found <a href=\"01-Apuntes/04-Licenciatura/00/02-Programacion.pdf\" target=\"_blank\">here</a>. Similarly, the exercises we did in class can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/01-PC-P-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-cp-prac": "Pair Practices",
    "lang-lic-cp-prac-1": "Pair practices were another component of the preparatory courses, taught by some of our more advanced classmates, but they were already introducing us to a programming language. The syntax was confusing to me, I didn't understand the problems, and my brain got tangled with the explanations. Many liked them, but I didn't; I felt very small and dumb. I preferred it more when the guys organized Smash or Rocket League matches, but in terms of the teaching in this preparatory course, I felt lost.",
    "lang-lic-cp-prac-2": "For that reason, I didn't take any notes during this preparatory course.",
    "lang-lic-s1": "First Semester",
    "lang-lic-s1-quote": "The young are often underestimated - Star Wars: The Clone Wars (Season 5 Episode 7: A test of strength)",
    "lang-lic-s1-1": "With a lot of determination, as is typical of newcomers, we entered the first semester of the program. With a few acquaintances I had made during the preparatory courses, we were trying to stick together to succeed throughout the program, harboring great ambitions both inside and outside the classroom. There was a lot of eagerness in classes, and much effort was put into extracurricular projects, such as convincing some friends to join me in registering for competitive programming events like the <a href=\"https://icpc.global/\" target=\"_blank\">ICPC: International Collegiate Programming Contest</a>, or software development competitions, aiming to learn as much as possible and grow to the best of our abilities.",
    "lang-lic-s1-2": "In this semester, I also continued to expand gradually the circle of friends I would have in the bachelor's degree.",
    "lang-lic-s1-cd": "Differential Calculus",
    "lang-lic-s1-cd-1": "Taught by Professor Irma Acero Díaz, I believe it was an average course. She is a teacher who does her job well, trying to teach as best as possible, despite certain issues in the classroom, which I think could have made her subject more challenging for us.",
    "lang-lic-s1-cd-2": "The notes I took for this subject can be found <a href=\"01-Apuntes/04-Licenciatura/01/01-CD.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s1-as": "Advanced Algebra",
    "lang-lic-s1-as-1": "We saw Professor Juan Manuel Pérez Rosales again in this subject, and it was definitely another intense journey through the world of algebra. Honestly, keeping up with him was challenging, but I liked his subject. I learned a lot, enjoyed it, and felt like I made good use of his knowledge.",
    "lang-lic-s1-as-2": "The notes I took for this subject can be found <a href=\"01-Apuntes/04-Licenciatura/01/02-AS.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s1-lc1": "Computing Languages I",
    "lang-lic-s1-lc1-1": "To take this subject, the group was divided into two; half would be instructed by Professor Alejandro Padilla Díaz and the other half by Professor Rosalinda Avendaño López.",
    "lang-lic-s1-lc1-2": "Professor Rosalinda Avendaño López was the one who taught me this subject, and I have to say that she is, for me, one of the top five teachers who taught me during my time in the program. I gained valuable insights from her course, where we solidified the knowledge seen in the programming preparatory course by exploring all these structures and applying them in the C programming language.",
    "lang-lic-s1-lc1-3": "The notes I developed for her subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/01/03-LC1.pdf\" target=\"_blank\">here</a>. Similarly, the programs and exercises we did in class can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/02-S1-LC1-ClassExercises\" target=\"_blank\">here</a>, as well as the final project for her subject, which is available <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/03-S1-LC1-FinalProject\" target=\"_blank\">here</a>.",
    "lang-lic-s1-fec": "Fundamentals of Computational Structures",
    "lang-lic-s1-fec-1": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/01/04-FEC.pdf\" target=\"_blank\">here</a>. Similarly, the programs and exercises we did in class can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/04-S1-FEC-GraphExercise\" target=\"_blank\">here</a>, as well as the final project for his subject, which is available <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/05-S1-FEC-FinalProject\" target=\"_blank\">here</a>.",
    "lang-lic-s1-cb": "Basic Accounting",
    "lang-lic-s1-cb-1": "The professor who taught us this subject was Professor Cuauhtémoc Torres Cruz, and he really taught us a lot about accounting knowledge, the preparation of financial statements, balance sheets, calculation of certain taxes like VAT, or income statements.",
    "lang-lic-s1-cb-2": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/01/05-CB.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s1-auto": "Self-study",
    "lang-lic-s1-auto-1": "Among all the energy that I and my friends brought with us in the early semesters, aiming to channel all our efforts, we sought to study some subjects on our own, either to reinforce our knowledge or to arrive prepared for future subjects.",
    "lang-lic-s1-auto-2": "In September 2018, I started taking notes on differential calculus based on a book from Editorial Patria, which I completed shortly before the end of the semester. These notes served as a review for the exams of the corresponding subject of the semester. These notes can be consulted <a href=\"01-Apuntes/04-Licenciatura/01/06-CalculoDiferencial.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s1-auto-3": "In September 2018, I started taking notes on advanced algebra based on a book from Editorial Limusa. Although I did not complete these notes, they served as a review for me. These notes can be consulted <a href=\"01-Apuntes/04-Licenciatura/01/07-AlgebraSuperior.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s1-auto-4": "In October 2018, I started taking notes on accounting based on a book from Editorial Patria. However, I did not complete these notes. These notes can be consulted <a href=\"01-Apuntes/04-Licenciatura/01/08-ContabilidadBasica.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s1-auto-5": "In November 2018, I started taking notes on integral calculus based on a book from Editorial Patria. I completed these notes in February 2019, practically at the beginning of the integral calculus course in the program. As a result, I arrived very well-prepared for that course. These notes can be consulted <a href=\"01-Apuntes/04-Licenciatura/01/09-CalculoIntegral.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s1-auto-6": "In December 2018, I started taking notes on linear algebra based on a book from McGraw Hill. However, I did not complete these notes as I focused on finishing those for integral calculus. I planned to \"resume them later\". These notes can be consulted <a href=\"01-Apuntes/04-Licenciatura/01/10-AlgebraLineal.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s1-auto-7": "In December 2018, I started taking notes on statistics and probability based on a book from Pearson. However, I did not complete these notes as I focused on finishing those for integral calculus. I planned to \"resume them later\" These notes can be consulted <a href=\"01-Apuntes/04-Licenciatura/01/11-EstadisticaYProbabilidad.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s2": "Second Semester",
    "lang-lic-s2-quote": "A great student is what the teacher hopes to be - Star Wars: The Clone Wars (Season 3 Episode 22: Wookie hunt)",
    "lang-lic-s2-1": "During this semester, my social group expanded a bit more. Additionally, I started helping some people who found certain subjects difficult, and we began to meet up to explain these topics to them and help them perform well on exams. This way, we formed a support group to ensure success in our academic adventures.",
    "lang-lic-s2-2": "Some plans had been put on hold, such as the <a href=\"https://icpc.global/\" target=\"_blank\">ICPC</a>, which would be resumed in this semester with a renewed and reconfigured team, so the plans were still on track.",
    "lang-lic-s2-ci": "Integral Calculus",
    "lang-lic-s2-ci-1": "As students of Professor Jaime Trujillo Domínguez, we had the integral calculus class, which I enjoyed a lot because of the rigor with which he presented the problems and expected us to solve them. I am aware that I was the only odd one who liked this, as everyone else found it annoying, but I felt it was important to question ourselves in the way we did, as many things arose in integral calculus, as was the case in this course. For me, this course alone was enough to consider the professor one of the best in the program in my opinion.",
    "lang-lic-s2-ci-2": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/02/01-CI-Apuntes.pdf\" target=\"_blank\">here</a>. Additionally, the professor requested that we keep the homework exercises separate in a different notebook, which can be found <a href=\"01-Apuntes/04-Licenciatura/02/02-CI-Ejercicios.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s2-lc2": "Computing Languages II",
    "lang-lic-s2-lc2-1": "For this subject, we were divided into two groups; one group would be taught by Professor Francisco Javier Luna Rosas and the other by Professor Rosalinda Avendaño López. I was in the group that would be guided by Professor Rosalinda Avendaño López. Again, I believe that the professor did a great job explaining object-oriented programming and its applications in C#.",
    "lang-lic-s2-lc2-2": "The notes I developed for her subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/02/03-LC2.pdf\" target=\"_blank\">here</a>. Similarly, the programs and exercises we did in class can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/06-S2-LC2-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s2-ec": "Computational Structures",
    "lang-lic-s2-ec-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/02/04-EC.pdf\" target=\"_blank\">here</a>. Likewise, the programs and exercises we did in class can be consulted <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/07-S2-EC-ClassExercises\" target=\"_blank\">here</a> as well as the final project of your subject, which can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/08-S2-EC-FinalProject\" target=\"_blank\">here</a>.",
    "lang-lic-s2-eg": "General Economy",
    "lang-lic-s2-eg-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/02/05-EG.pdf\" target=\"_blank\">here</a>. Likewise, we developed a program in class to graph the equations of supply and demand that can be consulted <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/09-S2-EG-FirstUnitProject\" target=\"_blank\">here</a>.",
    "lang-lic-s2-ld": "Digital Logic",
    "lang-lic-s2-ld-1": "Taught by teacher Arturo González León, it was a very peculiar subject. This subject was the last class of the day and the teacher managed to convey all the knowledge he wanted for a class session in twenty minutes. Surprisingly, he managed to give a good class with a twenty-minute session a day. In his subject we saw from the basics how to differentiate analog and digital systems to the preliminaries of automata. It was an unusual class but a very good class.",
    "lang-lic-s2-ld-2": "he notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/02/06-LD.pdf\" target=\"_blank\">here as a messy presentation</a> as well as they can be consulted <a href=\"01-Apuntes/04-Licenciatura/02/07-LD-Formal.pdf\" target=\"_blank\">here as a clean presentation</a>, since we made very nice diagrams that I think with cleaner notes they stood out and I understood my notes better.",
    "lang-lic-s3": "Third Semester",
    "lang-lic-s3-quote": "Teaching is a privilege and it's part of a Jedi's responsibility to help train the next generation - Obi-Wan Kenobi (Star Wars: The Clone Wars)",
    "lang-lic-s3-1": "In the third semester, the support group reached its maximum, having several classmates who also carried out support tasks in different subjects. Socially speaking, I finally managed to recover from the bad start I had in this stage and this was where my social group of the race increased the most.",
    "lang-lic-s3-2": "I personally think this was the hardest semester or probably the second hardest ever. The study here was heavy, the subjects too, and covering all of this really was a very complicated load, but with the support study groups that we had formed we had support in up to three of the six subjects this semester, I was mainly focused on advising for linear algebra, but I was ready to help in any of the six subjects from this semester.",
    "lang-lic-s3-eca": "Advanced Computational Structures",
    "lang-lic-s3-eca-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/03/01-ECA.pdf\" target=\"_blank\">here</a>. Likewise, the programs and exercises we did in class can be consulted <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/10-S3-ECA-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s3-lc3": "Computing Languages III",
    "lang-lic-s3-lc3-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/03/02-LC3.pdf\" target=\"_blank\">here</a>. Likewise, the programs and exercises we did in class can be consulted <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/11-S3-LC3-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s3-rb": "Basic Writing",
    "lang-lic-s3-rb-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/03/03-RB.pdf\" target=\"_blank\">here</a>. She also asked us to develop a glossary which can be consulted <a href=\"01-Apuntes/04-Licenciatura/03/04-RB-Glosario.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s3-ia": "Artificial Intelligence",
    "lang-lic-s3-ia-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/03/05-IA.pdf\" target=\"_blank\">here</a>. Likewise, the programs and exercises we did in class can be consulted <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/12-S3-IA-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s3-al": "Linear Algebra",
    "lang-lic-s3-al-1": "It is thanks to this subject that Professor Jaime Trujillo Domínguez emerged as one of the best professors who have taught me and I believe that he is, for me, among the two best professors who taught me during my degree.",
    "lang-lic-s3-al-2": "From the moment we started, the teacher told us that we had to work hard because we weren't going to finish the program because it was so demanding. Thus, the teacher sent us the theory to read and write it out at home so that in class we would only do exercises. This made the learning somewhat self-taught and since I would really like to have many subjects, especially the most theoretical ones, which is read at home, resolve doubts in class. So personally I really liked this subject. It was very, very heavy, but the teacher showed a broad mastery of linear algebra topics in addition, what he told us was evident about having prepared the class so much since the holidays prior to these classes. Even he helped us a lot by giving us a lot of extra-class advice at other times, even in untimely weeks.",
    "lang-lic-s3-al-3": "Between the two courses that the professor taught, I think my favorite was this one. The fact of reading the theory at home to go to class to do exercises was something proposed by the teacher trying to comply with the subject program and in my opinion, this should be done by all subjects with his theory. I know that many classmates disliked this, however in this way I felt how we were taking advantage of time at home and time in class. We didn't waste a second. This fact really seemed to me to be one of the most successful of the five years of my career.",
    "lang-lic-s3-al-4": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/03/06-AL-Apuntes.pdf\" target=\"_blank\">here</a>. Additionally, the professor requested that we keep the homework exercises separate in a different notebook, which can be found <a href=\"01-Apuntes/04-Licenciatura/03/07-AL-Ejercicios.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s3-edp": "Descriptive Statistics and Probability",
    "lang-lic-s3-edp-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/03/08-EDP.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s4": "Fourth Semester",
    "lang-lic-s4-quote": "Great leaders inspire greatness in others - Star Wars: The Clone Wars (Season 1 Episode 1: Ambush)",
    "lang-lic-s4-1": "The good pace began to falter this semester. This semester is the one we took in the first half of 2020, that is, it is in this semester where we are going to virtual classes due to the COVID-19 pandemic. We had in-person classes from the beginning of the semester in January until the well-remembered by myself Friday, March 13, 2020.",
    "lang-lic-s4-2": "Nobody knew what to do about it, the university took a few weeks to think so we were not doing anything at the school level until the last days of April, when activities were resumed with the different considerations of each teacher, some through Microsoft Teams, others through Google Meet, others through Zoom and others through different platforms. This delay caused us to finish the semester almost in July.",
    "lang-lic-s4-3": "The end of the semester left a bad taste in my mouth in terms of performance as well as on a social level, things were beginning to get complicated starting this semester. I felt that I was no longer achieving results with the same ease as in the first semesters and when I talked about it with those close to me, they began to take me to points at university that I had not thought about, because throughout my university stay I achieved good results but without fighting mainly. for them, but mainly for knowledge and letting the results in terms of numbers come as a secondary objective and it was at the end of this semester when this close environment led me to give more importance to grades than to knowledge...",
    "lang-lic-s4-m": "Mechanics",
    "lang-lic-s4-m-1": "Instructed by teacher Mariana Alfaro Gómez, I think we had a good Mechanics course. We reviewed the course topics in a pleasant way, the teacher explained well and we were making adequate progress in the subject until the pandemic hit.",
    "lang-lic-s4-m-2": "Surprisingly, the teacher was one of those who, I think, best adapted to finishing the semester properly. She left us exercises and we could optionally join Microsoft Teams sessions in case we had questions. At this point, the university had not yet introduced many restrictions due to mandatory classes, attendance taking or other measures, since they were the first three months of the pandemic, so I think this also helped to have this pleasant end to the semester and that it had an unexpected dynamic but in the face of bad weather there was a good adaptation.",
    "lang-lic-s4-m-3": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/04/01-M.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s4-lc4": "Computing Languages IV",
    "lang-lic-s4-lc4-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/04/02-LC4.pdf\" target=\"_blank\">here</a>. Likewise, the programs and exercises we did in class can be consulted <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/13-S4-LC4-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s4-pc": "Scientific Programming",
    "lang-lic-s4-pc-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/04/03-PC.pdf\" target=\"_blank\">here</a>. Likewise, the programs and exercises we did in class can be consulted <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/14-S4-PC-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s4-tipd": "Smart Techniques for Development Processes",
    "lang-lic-s4-tipd-1": "Repeating as our teacher, teacher Rosalinda Avendaño López taught us again in this subject, which deals with the main aspects of software engineering. Project planning and everything that this entails.",
    "lang-lic-s4-tipd-2": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/04/04-TIPD.pdf\" target=\"_blank\">here</a>. Likewise, the programs and exercises we did in class can be consulted <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/15-S4-TIPD-FinalProject\" target=\"_blank\">here</a>.",
    "lang-lic-s4-oc": "Computational Organization",
    "lang-lic-s4-oc-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/04/05-OC.pdf\" target=\"_blank\">here as a messy presentation</a> as well as they can be consulted <a href=\"01-Apuntes/04-Licenciatura/04/06-OC-Formal.pdf\" target=\"_blank\">here as a clean presentation</a>, since we made very nice diagrams that I think with cleaner notes they stood out and I understood my notes better. Likewise, the programs and exercises we did in class can be consulted <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/16-S4-OC-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s4-ad": "Analysis and Design",
    "lang-lic-s4-ad-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/04/07-AD.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s4-auto": "Self-study",
    "lang-lic-s4-auto-1": "Trying to arrive with good preparation for some upcoming subjects which I knew I was going to need to put a lot of effort into, I decided to study some of these areas on my own.",
    "lang-lic-s4-auto-2": "In January 2020 I started some mechanics notes based on a book from Editorial Pearson, which I did not finish. These notes can be consulted <a href=\"01-Apuntes/04-Licenciatura/04/08-Mecanica.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s4-auto-3": "In January 2020 I started some notes on numerical methods based on a book from Editorial McGraw Hill, which I did not finish. These notes can be consulted <a href=\"01-Apuntes/04-Licenciatura/04/09-MetodosNumericos.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s4-auto-4": "In March 2020 I started some calculus notes (a book that included knowledge of differential, integral and vector) based on a book from Editorial Pearson to prepare for the Differential Equations subject for the coming semester, however I did not complete the notes. These notes can be consulted <a href=\"01-Apuntes/04-Licenciatura/04/10-Calculo.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s5": "Fifth Semester",
    "lang-lic-s5-quote": "Goodbye old friend. May the force be with you - Obi-Wan Kenobi (Star Wars Episode III: Revenge of the Sith)",
    "lang-lic-s5-1": "After finishing last semester with some discontent, I hoped to take a better step for this semester, however, I did not take the analysis and everything that this entailed in the best way. At first I thought it was my fault for feeling like I had learned little last semester when it was a situation out of my control.",
    "lang-lic-s5-2": "Furthermore, between last semester and this one, my close environment introduced me to ideas about giving a lot of importance to grades even above learning. I don't really know why I managed to fall into those mental games to the point of starting to stop my activities such as my self-study or exercising and playing sports (besides the fact that I couldn't because we were in a pandemic. The entire semester was spent in virtual classes).",
    "lang-lic-s5-3": "I think the seeds of bad decisions may have been planted last semester, but the turn really started this semester, losing me from who I truly was...",
    "lang-lic-s5-bd": "Databases",
    "lang-lic-s5-bd-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/05/01-BD.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s5-oi": "Intelligent Optimization",
    "lang-lic-s5-oi-1": "Doctor Aurora Torres Soto can position herself as, I believe, the best teacher of the course. From my opinion, she has a great way of explaining things to the students so that we, who are unaware of the topics, understand things. From my perspective, the classes always had a good pace, with a good combination of theory along with practical exercises and tasks that are done by hand as well as programming tasks. Honor to whom honor is due.",
    "lang-lic-s5-oi-2": "In the class, the Doctor taught us about some knowledge of multivariable calculus to have a basis for optimization, in addition to knowing some basic metaheuristics. The most important ones that we saw in class were the Simple Genetic Algorithm, Simulated Annealing and Ant Colony Optimization. It was a shame that the only class she taught me was in virtual mode, but even so, the Doctor gave a very good lecture on the knowledge of this subject.",
    "lang-lic-s5-oi-3": "I highlight Doctor Aurora's patience in the way she answered questions, her creativity in using different examples to explain highly complex theory, I think. She was one of the teachers of the course who had the most accessibility in the face of the differences of certain members of the group, allowing learning to be broad and clear for everyone. Her exercises, her exams and her project all challenged us in different ways, from those practical exercises by hand as well as the exercises that required programming in C++. The Doctor also introduced us to the concept of Benchmarks for testing our code, which the use of the TSPLIB was even part of the final project.",
    "lang-lic-s5-oi-4": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/05/02-OI.pdf\" target=\"_blank\">here</a>. Likewise, the programs and exercises we did in class can be consulted <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/17-S5-OI-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s5-a1": "Automatons I",
    "lang-lic-s5-a1-1": "Another very good class this semester was this one, taught by Professor Israel de la Parra González. Sadly the teacher did not have enough time for some consultations with us, however the explanations of the classes were very good, the combination of theory and exercises was good and addressing everything was very well balanced. I truly believe that the teacher also had a positive impact on our classroom.",
    "lang-lic-s5-a1-2": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/05/03-A1.pdf\" target=\"_blank\">here</a>. Likewise, the programs and exercises we did in class can be consulted <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/18-S5-A1-FinalProject\" target=\"_blank\">here</a>.",
    "lang-lic-s5-ed": "Differential Equations",
    "lang-lic-s5-ed-1": "Professor Jaime Salvador Medina González was a good teacher. I think in general I felt that many classmates liked their classes more than I did. The teacher has a very good attitude towards the students when teaching. He tries to fit in with the mood of the room and his class is very memorable because of this. I think they were good classes, very good classes, but perhaps I expected a little more depth in topics of this subject. Likewise, the teacher gave a good course for us, with a good pace, good exercises, enjoyable and entertaining.",
    "lang-lic-s5-ed-2": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/05/04-ED.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s5-aidh": "Intelligent Architecture for Hybrid Development",
    "lang-lic-s5-aidh-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/05/05-AIDH.pdf\" target=\"_blank\">here</a>. Likewise, the programs and exercises we did in class can be consulted <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/19-S5-AIDH-FinalProject\" target=\"_blank\">here</a>.",
    "lang-lic-s5-li": "Intelligent Languages",
    "lang-lic-s5-li-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/05/06-LI.pdf\" target=\"_blank\">here</a>. Likewise, the programs and exercises we did in class can be consulted <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/20-S5-LI-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s6": "Sixth Semester",
    "lang-lic-s6-quote": "Evil is not born, it is taught - Star Wars: The Clone Wars (Season 3 Episode 13: Monster)",
    "lang-lic-s6-1": "This semester was when I started to dislike university. It was here where I felt like I was wasting my time more than actually spending it doing useful things. Things got very very bad from here.",
    "lang-lic-s6-2": "Previously (at least in my case) I felt that there were some subjects that I disliked per semester, but in this semester the roles were reversed, with the subjects that I liked being now the difficult ones to find on our way through the degree.",
    "lang-lic-s6-3": "From here on, the desire for the degree decreased greatly. Being the second semester completely virtual, the university was not yet very rigorous with attendance or classes, so my routine consisted of trying to exercise before some classes, take some that were taking place and then from 9:00 no class until 11:00. It was a pretty bad semester and it began to chain a streak of semesters that ended up killing my enjoyment of the degree.",
    "lang-lic-s6-iso": "Introduction to Operative Systems",
    "lang-lic-s6-iso-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/06/01-ISO.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s6-tcc": "Theory of Computational Complexity",
    "lang-lic-s6-tcc-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/06/02-TCC.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s6-io": "Operations Research",
    "lang-lic-s6-io-1": "This subject is strange. We never met Professor Jesús Ovalle Palacios, neither his voice nor his face. His classes were not by videoconference but rather he uploaded a file to the academic space that contained the theory of operations research topics, such as optimization, the simplex method and other topics, plus the exercises that would count as the day's attendance.",
    "lang-lic-s6-io-2": "It was strange not feeling the presence of a teacher but I definitely preferred this to the base class we had where we dedicated our time reading slides or something similar. We could read the slides whenever we wanted and the daily exercise at any time before the day was over.",
    "lang-lic-s6-io-3": "Despite not knowing the professor and never dealing directly with him, he did a better job than many professors whose class was based on reading slides.",
    "lang-lic-s6-io-4": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/06/03-IO.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s6-ai": "Intelligent Learning",
    "lang-lic-s6-ai-1": "From these subjects, Professor Francisco Javier Luna Rosas improves a lot as a teacher, where it is evident that he prefers to teach these topics on artificial intelligence than those at the beginning of the degree.",
    "lang-lic-s6-ai-2": "His knowledge is extensive in these topics and the activities he leaves are interesting and varied.",
    "lang-lic-s6-ai-3": "In the subject, we covered the types of learning used in machine learning: supervised, unsupervised, and reinforcement learning. The ways in which we reviewed the topics were effective.",
    "lang-lic-s6-ai-4": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/06/04-AI.pdf\" target=\"_blank\">here</a>. Likewise, the programs and exercises we did in class can be consulted <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/21-S6-AI-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s6-ep": "Professional Ethics",
    "lang-lic-s6-ep-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/06/05-EP.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s6-de": "Entrepeneurs Development",
    "lang-lic-s6-de-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/06/06-DE.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s7": "Seventh Semester",
    "lang-lic-s7-quote": "Fear leads to anger, anger leads to hate, hate leads to suffering - Master Yoda (Star Wars Episode I: The Phantom Menace)",
    "lang-lic-s7-1": "This semester was synonymous with hitting rock bottom. This time, without anyone telling me, the same thoughts that occurred from the fourth to the fifth semester crossed my mind again. So I approached this semester attempting to give absolutely everything to prove to myself that I could indeed perform well (sadly, more focused on grades).",
    "lang-lic-s7-2": "Due to this demand, it was a semester where I would sit behind the computer (because it was a fully virtual semester again, except for like three occasions where they tried to switch to a hybrid model but it wasn't successful) from 7:00 in the morning until 2:00 in the afternoon without stopping, then I would stay to do homework and study until 4:00 in the afternoon, where I only took breaks to eat and then return at 5:00 to do the same thing again, usually staying until midnight or sometimes even later.",
    "lang-lic-s7-3": "It was a semester that came to resemble the performance of my final stage in the International Baccalaureate, but with a horrendous feeling that we were wasting all our time doing nothing. In fact, thanks to that feeling, which reached its peak in this semester, from then until the end, all I wanted was to leave the program. I was already in the seventh semester, almost ready to throw in the towel and drop out, but when I went to bed, the feeling was so strong that every day I woke up feeling like it was another wasted day, with a sense of emptiness because I hadn't learned anything that day. I didn't want anything else from the program, just to finish. And although people around me encouraged me with \"it's almost over\", \"just a little more\", \"only three more semesters\", my immediate environment didn't understand that this semester felt endless to me.",
    "lang-lic-s7-4": "It was a very tough semester, very bad, and probably the lowest point I've experienced in my university life, and possibly even in my entire life.",
    "lang-lic-s7-5": "As a small note amidst all the depression of the semester, during the previous semester, that is, in the sixth semester, I had come across the application \"Notion\". I was experimenting with using it to take my notes, but it wasn't formal yet. However, with zero desire to write anything down in these kind of classes, I preferred to switch my notes to a digital format. So, for the remainder of the program, my notes were made on this platform.",
    "lang-lic-s7-r1": "Networks I",
    "lang-lic-s7-r1-1": "The notes I developed for your subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/07/01-R1.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s7-a2": "Automatons II",
    "lang-lic-s7-a2-1": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/07/02-A2.pdf\" target=\"_blank\">here</a>. Similarly, the programs and exercises we did in class can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/22-S7-A2-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s7-m1": "Metaheuristics I",
    "lang-lic-s7-m1-1": "Given by Professor Francisco Javier Luna Rosas, it's my favorite class taught by him, and it's here where I truly see the potential that can be drawn from the professor, being mentored on many topics and approaching him to learn more and more about these subjects.",
    "lang-lic-s7-m1-2": "In his class, we combined the optimization techniques seen in Intelligent Optimization in the fifth semester with the learning models seen in Intelligent Learning in the sixth semester to distribute workload among computer systems processing sentiment analysis of tweets extracted from Twitter about a sensitive topic. It was an interesting and unique project.",
    "lang-lic-s7-m1-3": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/07/03-M1.pdf\" target=\"_blank\">here</a>. Similarly, the programs and exercises we did in class can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/23-S7-M1-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s7-dmd": "Digital Media Development",
    "lang-lic-s7-dmd-1": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/07/04-DMD.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s7-le": "Assembly Language",
    "lang-lic-s7-le-1": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/07/05-LE.pdf\" target=\"_blank\">here</a>. Similarly, the programs and exercises we did in class can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/24-S7-LE-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s7-pi": "Image Processing",
    "lang-lic-s7-pi-1": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/07/06-PI.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s7-esi": "Intelligent Software Evolution",
    "lang-lic-s7-esi-1": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/07/07-ESI.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s8": "Eighth Semester",
    "lang-lic-s8-quote": "Never give up hope, no matter how dark things seem - Star Wars: The Clone Wars (Season 5 Episode 20: The wrong jedi)",
    "lang-lic-s8-1": "Speaking from personal feelings, this semester was horrible because it was \"the kickback\" from the excessive demands of the previous semester. In the previous semester, I didn't achieve the grades I expected, I overexerted myself by sleeping very little and having very little time for myself, and I even lost myself in a world of dedicating all my time to the semester (like the lost souls in Pixar's Soul who go from being in \"the zone\" to becoming lost souls), to the point that it was the first semester where, upon finishing, I didn't even want to look at my computer again.",
    "lang-lic-s8-2": "With this mindset, I entered the eighth semester, something that I found extremely daunting to face seven hours of class when I didn't even want to be in front of my computer for an hour. I was very burned out, I felt burned out, and I truly felt that even this had stopped being enjoyable for me.",
    "lang-lic-s8-3": "However, this semester I was given the opportunity to do my professional internship at a company called HermesCorp, and I still think that the opportunity was wonderful. I still hold the guys from the company in high regard to this day; they taught me a lot every day, and I still think that, considering there are so many people with more experience than me in this area and in these technologies, being given the opportunity to train in Backend technologies was extremely special for me. I was embarrassed to have to struggle with my burnout while working with the guys at Hermes, especially in this semester where it was already difficult for me to stay in front of the computer during classes and then finish to continue programming. I mean, I loved finally programming, feeling that we were doing it with a purpose, and that it was a challenge doing the things we were doing in the professional internships, but my burnout persisted, so it was difficult for me to work even though I enjoyed doing what we were doing in the internships.",
    "lang-lic-s8-4": "The above began to shed a ray of light for the upcoming semesters because they taught me many things both technically and in other more general aspects of life, which started to give me a glimmer of hope to get out of this rough patch caused by the last semesters I was taking at university. But regarding classes, they remained just as before even though we were already adopting a hybrid model.",
    "lang-lic-s8-asp": "Software and Projects Management",
    "lang-lic-s8-asp-1": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/08/01-ASP.pdf\" target=\"_blank\">here</a>. Similarly, the programs and exercises we did in class can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/25-S8-ASP-FinalProject\" target=\"_blank\">here</a>.",
    "lang-lic-s8-mddm": "Development Methodology for Mobile Devices",
    "lang-lic-s8-mddm-1": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/08/02-MDDM.pdf\" target=\"_blank\">here</a>. Similarly, the programs and exercises we did in class can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/26-S8-MDDM-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s8-sep": "Probabilistic Expert Systems",
    "lang-lic-s8-sep-1": "The class was taught by Dr. Eunice Esther Ponce de Leon Senti. It was an interesting subject where we studied expert systems theory along with their respective statistical theory.",
    "lang-lic-s8-sep-2": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/08/03-SEP.pdf\" target=\"_blank\">here</a>. Similarly, the programs and exercises we did in class can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/27-S8-SEP-FinalProject\" target=\"_blank\">here</a>.",
    "lang-lic-s8-g": "Graphing",
    "lang-lic-s8-g-1": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/08/04-G.pdf\" target=\"_blank\">here</a>. Similarly, the programs and exercises we did in class can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/28-S8-G-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s8-r2": "Networks II",
    "lang-lic-s8-r2-1": "Guillermo Domínguez Aguilar is not only a great teacher but also a highly skilled professional in networking with extremely broad knowledge in Linux systems and computer networks. He has so many qualifications and continues to train and update himself that it was an honor to be his student.",
    "lang-lic-s8-r2-2": "Professor Guido shared very useful insights such as tips for better cabling, designing a better network cabling system in a building, and connecting buildings, giving examples of how it was implemented in the university, among many other tips and experiences. This was very inspiring because we could see his experience in the field and how he shared it with us.",
    "lang-lic-s8-r2-3": "Once again, it wasn't a bad class, but I know it could have been much better if we hadn't started with virtual classes and if the professor hadn't experienced an issue with a cluster he had at the university, which we were supposed to use for the final project and many activities throughout the semester. These activities involved moving large amounts of storage, powerful processing, and lots and lots of RAM, which clearly our small computers couldn't handle. As a result, the scale of the activities was reduced to something we could manage.",
    "lang-lic-s8-r2-4": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/08/05-R2.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s8-m2": "Metaheuristics II",
    "lang-lic-s8-m2-1": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/08/06-M2.pdf\" target=\"_blank\">here</a>. Similarly, the programs and exercises we did in class can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/29-S8-M2-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s8-di": "Legal Informatics",
    "lang-lic-s8-di-1": "The notes I developed for his subject can be consulted <a href=\"01-Apuntes/04-Licenciatura/08/07-DI.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s9": "Ninth Semester",
    "lang-lic-s9-quote": "The challenge of hope is to overcome corruption - Star Wars: The Clone Wars (Season 3 Episode 5: Corruption)",
    "lang-lic-s9-1": "We returned to in-person classes after almost two years of the pandemic. The light at the end of the tunnel was becoming brighter and brighter. Thanks to my professional internships, I was feeling better, but my burnout persisted. Regardless of how this semester went, my main achievement was to try to eliminate my burnout as much as possible to start the coming year with renewed energy.",
    "lang-lic-s9-2": "In this semester, we already had the thesis looming over us, another graduation requirement. Fortunately, I was quite advanced because I started it last semester, in May 2022, and I had familiarized myself with it all by September 2022, in this semester. There was still a lot of reading and writing to do for the experimentation. I could see myself finishing the thesis this semester.",
    "lang-lic-s9-3": "In this semester, I realized all the mistakes I had made since 2020 up to this point. I wanted to correct my life and began to do so, trying to get out of the rut no matter what it took. First, I let go of the goal of achieving certain outcomes, forgiving many things from my past, and reconfiguring many aspects of my life so that returning to the right path in the next semester and starting from 2023 would become a reality. But before that, I had to go through a semester where I maintained hope that it would be a good one by convincing myself that \"it was no longer virtual\" and thus things (and classes) would improve. To my surprise, it looked like the quality and dynamics of the program since the pandemic had become a permanent reality...",
    "lang-lic-s9-sw": "Web Services",
    "lang-lic-s9-sw-1": "The notes I developed can be consulted <a href=\"01-Apuntes/04-Licenciatura/09/01-SW.pdf\" target=\"_blank\">here</a>, which are digital. My repository for the project we developed in his course can be found <a href=\"https://github.com/Joul24py/AppCitas\" target=\"_blank\">here</a>.",
    "lang-lic-s9-md": "Data Mining",
    "lang-lic-s9-md-1": "The notes I developed can be consulted <a href=\"01-Apuntes/04-Licenciatura/09/02-MD.pdf\" target=\"_blank\">here</a>. Similarly, the programs and exercises we did in class can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/31-S9-MD-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s9-pa": "Algorithm Parallelization",
    "lang-lic-s9-pa-1": "The notes I developed can be consulted <a href=\"01-Apuntes/04-Licenciatura/09/03-PA.pdf\" target=\"_blank\">here</a>. Similarly, the programs and exercises we did in class can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/32-S9-PA-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s9-tsi": "Theory of Interactive Systems",
    "lang-lic-s9-tsi-1": "The notes I developed can be consulted <a href=\"01-Apuntes/04-Licenciatura/09/04-TSI.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-s9-sis": "Systems Security and Integrity",
    "lang-lic-s9-sis-1": "Arturo Ocampo Silva. I owe a lot to this professor. I consider him an excellent teacher, and without a doubt, it was him who could turn our frowns from the rest of the day into a very cheerful attitude in his class.",
    "lang-lic-s9-sis-2": "First, the professor came in with a tremendously positive and cheerful attitude, addressing the whole group at times and individuals at others. His knowledge in the field is quite good, and all of this conveyed the teacher's joy. Additionally, with this attitude, the group quickly gained confidence with the professor to the point where several times we would vent to him about how frustrated we felt because the other subjects were not what we expected. He listened and supported us, saying that he was glad his class lifted our spirits after enduring the rest of the day.",
    "lang-lic-s9-sis-3": "The professor also used slides in his class, but he knew that the slides were not the main focus of the class, only a support. We did so many practical things in regular classes because on Fridays, it was all about putting into practice what we learned by using a modem provided by the professor and connecting to it to play around with the connected computers.",
    "lang-lic-s9-sis-4": "The professor taught us for life, for practical application. He told us when we might need knowledge of one topic or another, about updated resources, and speaking of this, he did update his slides, knowing that not doing so would show how the knowledge becomes obsolete. Moreover, the fact that he updated them showed his commitment to teaching us.",
    "lang-lic-s9-sis-5": "The professor's exams were quite something. I never managed to get a grade higher than a 7 on any of his exams, but after overcoming my fixation on grades, I didn't even care about this. His exams achieved what few exams had done since the pandemic hit, which was to challenge the student. If we were already doing practical activities in class, the professor would twist them slightly to make them a bit more complex but enough to demonstrate if we had indeed learned; memorization was not enough, we had to understand what we were doing, sometimes how to correctly compromise the professor's computer, or analyze network traffic with the proper reasoning to draw conclusions. These exams were not \"memorize the ton of theory I vomited at you in the last five weeks of class to come and answer my questions from memory\", but they really posed a challenge for the student.",
    "lang-lic-s9-sis-6": "I cannot be more grateful to the professor because I really thought that studying no longer interested me. However, it was due to the very poor quality of the classes to which we sadly became accustomed. Seeing that there was still a subject that captured my attention, that made me dedicate hours in the afternoon, that I paid attention to in class, that I enjoyed doing its assignments, and feeling challenged in an exam despite getting a 6 out of 10 is something that I am very grateful to the professor for. He taught us for life, he was our reason to attend classes and I noticed this because the rest of the subjects had, at best, a 20% attendance rate, but in this class, the professor achieved a 90% attendance rate without forcing attendance checks or anything.",
    "lang-lic-s9-sis-7": "The notes I developed can be consulted <a href=\"01-Apuntes/04-Licenciatura/09/05-SIS.pdf\" target=\"_blank\">here</a>. Similarly, the programs and exercises we did in class can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/33-S9-SIS-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s9-si1": "Research Seminar I",
    "lang-lic-s9-si1-1": "The notes I developed can be consulted <a href=\"01-Apuntes/04-Licenciatura/09/06-SI1.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s10": "Tenth Semester",
    "lang-lic-s10-quote": "This is a new day, a new beginning - Ahsoka Tano",
    "lang-lic-s10-1": "Finally, the last chapter had arrived. Five years were about to come to an end. The tenth semester was ahead of us with very mixed feelings.",
    "lang-lic-s10-2": "On one hand, I felt sadness as the end of the college journey approached because I had experienced the separation from my group of friends before, at the end of another stage of my education. It's sad; you don't hang out with your crew as you used to, everyone takes different paths, and I knew that my relationship with my friends as I knew it was coming to an end. With all the time we spent together, it was ending, and soon we would fly off in different directions.",
    "lang-lic-s10-3": "On the other hand, I couldn't wait for this semester to end either. There were only three courses, but I didn't want any of them to be a subject that I disliked. Was I expecting too much from the degree? Knowing how this semester was unfolding, I didn't even care that the end of the degree was approaching and that it would mean becoming unemployed. All I wanted was for the classes to end and stop feeling the way I was feeling in the past few semesters.",
    "lang-lic-s10-4": "With these feelings, and having managed to turn many of the bad events into positive outcomes in the previous semester (largely because, at this point, the song <a href=\"https://www.youtube.com/watch?v=oiDfdL5XhfY\" target=\"_blank\">Recovery by The Fold</a> had become the anthem of my life), I was preparing myself to continue fighting to recover and keep moving forward from the setbacks. I knew the work wasn't finished yet, and that I hadn't yet reached my desired path. This mindset drove me to strive every day to finish my degree at a good pace. Personally, I believe that the \"comeback\" phase ended on the day I defended my thesis. May 18th, 2023 was the victory celebration day, where the months of recovery had paid off, and where, for me, the five years of my degree had come to an end. Where a new day would finally rise, a new beginning.",
    "lang-lic-s10-op1": "Professional Option I: Angular SPA Development",
    "lang-lic-s10-op1-1": "The notes I developed can be consulted <a href=\"01-Apuntes/04-Licenciatura/10/01-OP1.pdf\" target=\"_blank\">here</a>, which are digital. My project repository, developed in his subject, can be found <a href=\"https://github.com/Joul24py/AppCitas-Front\" target=\"_blank\">here</a>.",
    "lang-lic-s10-op2": "Professional Option II: Machine Learning and Deep Learning",
    "lang-lic-s10-op2-1": "The subject was taught by Professor Francisco Javier Luna Rosas. After having him as a teacher since the second semester, I believe this was the second subject where I really appreciated his guidance and the first where I understood perfectly what he wanted to teach us.",
    "lang-lic-s10-op2-2": "This time, what he taught us was very good; without a doubt, it was the subject I attended university for this semester. His guidance seemed very good to me, and his knowledge in the field is extensive and noticeable. Personally, I think he's an incredible guide.",
    "lang-lic-s10-op2-3": "My notes for the subject can be found <a href=\"01-Apuntes/04-Licenciatura/10/02-OP2.pdf\" target=\"_blank\">here</a>, which I made in digital format, and they may not be very useful because of how little I wrote. However, during the semester, we developed many programs, all highly focused on different types of neural networks. My implementations can be found <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/35-S10-OP2-ClassExercises\" target=\"_blank\">here</a>.",
    "lang-lic-s10-si2": "Research Seminar II",
    "lang-lic-s10-si2-1": "My notes for the subject can be found <a href=\"01-Apuntes/04-Licenciatura/10/03-SI2.pdf\" target=\"_blank\">here</a>.",
    "lang-lic-thesis": "Thesis",
    "lang-lic-thesis-quote": "Our greatest glory is not in never falling, but in rising everytime we fall - Kobe Bryant",
    "lang-lic-thesis-1": "The culmination of my life's work. The thesis of my degree. Truly, this project lost interest for me as I progressed further in my studies. However, extracurricular events made me think that if I were to do something, I had to do it as I did at the beginning: with passion. Before I was corrupted by results and grades, when I did things for the sake of learning, for what the experience meant to me, and not for the outcome. As one of my greatest idols once said: <i>\"Those times when you're very tired, you don't want to push yourself, but you still do. That's really the dream. It's not the destination, it's the journey\"</i>.",
    "lang-lic-thesis-2": "That's why I decided that this project would return to being what it was before my corruption. A project that I poured all my heart and soul into, not for the results or grades, but for the eagerness to learn more about this field, to explore, to be curious while developing the document and all the procedures. Therefore, despite the unfortunate end of my degree, I greatly value this project. It's the project that, in my opinion, marks the turnaround from the rough patch I've been going through in recent years, during which I was searching for myself.",
    "lang-lic-thesis-3": "Clearly, I didn't develop this work alone. I am infinitely grateful to my thesis advisors, Dr. Aurora Torres Soto and Dr. María Dolores Torres Soto, who supported me at every step from formulating the idea to defending the thesis. Alexis Edmundo Gallegos Acosta, at the time a doctoral student, was working on his thesis with the same device and guided me with very useful tips to understand the functioning of the headband initially. The professors of the subject, Alejandro Padilla Díaz and Francisco Javier Álvarez Rodríguez, were also significant support every time I approached them and supervised my progress in this project. Clearly, I also thank all the people who were test subjects for their support in the project.",
    "lang-lic-thesis-4": "The working repository of my thesis, where the entire final product itself can be found, can be accessed <a href=\"https://github.com/Joul24py/UAA-ICI-Thesis\" target=\"_blank\">here</a>.",
    "lang-lic-thesis-5": "Now, about the project...",
    "lang-lic-thesis-6": "<b>COMPARATIVE ANALYSIS OF ALGORITHMS IN THE CLASSIFICATION OF MOVEMENT INTENTION THROUGH A BRAIN-COMPUTER INTERFACE</b>",
    "lang-lic-thesis-7": "<b>Abstract</b>",
    "lang-lic-thesis-8": "Brain-computer interfaces enable a new direct communication channel between brain and machine. In order to interpret thoughts as movement intentions, tools such as electroencephalograms (EEGs) are used to collect brain activity. The interpretation of this data requires computationally effective artificial intelligence algorithms.",
    "lang-lic-thesis-9": "The objective of this research is to compare support vector machine, random forest, and naive Bayes models to identify the model that efficiently classifies data obtained from an Emotiv Epoc+ headset regarding movement intention. These models were evaluated based on the raw datasets (as received from the experimentation) and the datasets after applying normalization and transformation. In general, the efficiency of support vector machine and naive Bayes does not exceed precision percentages of 50%, while random forest significantly improves with each evolution of the data, achieving efficiency values above 80%. This investigation provides a detailed description of the procedure performed to achieve these results.",
    "lang-lic-thesis-10": "<b>Key words:</b>",
    "lang-lic-thesis-11": "Brain - computer interface",
    "lang-lic-thesis-12": "Movement intention",
    "lang-lic-thesis-13": "Machine Learning",
    "lang-lic-thesis-14": "Support Vector Machine",
    "lang-lic-thesis-15": "Naive Bayes",
    "lang-lic-thesis-16": "Random Forest",
    "lang-lic-thesis-17": "<b>Problem statement</b>",
    "lang-lic-thesis-18": "The problem of this research lies in the use of computer equipment, especially the difficulties faced by individuals with disabilities in controlling these computational devices. However, BCIs facilitate their use (Marte, 2019).",
    "lang-lic-thesis-19": "The issue is that implementing a BCI also involves the use of artificial intelligence. Additionally, this field of machine learning has developed numerous algorithms. In this research, we ask which model is the best among support vector machine, naive Bayes, and random forest.",
    "lang-lic-thesis-20": "<b>Justification</b>",
    "lang-lic-thesis-21": "From a social perspective, we have a justification where it is known that 16% of the population has a significant disability (WHO, 2023), and the National Institutes of Health (2019) states that BCIs enable improved functioning. Thus, the idea of enhancing computer interaction through a BCI is established. Therefore, this research justifies its execution due to the inclusion of computer usage by individuals with significant disabilities.",
    "lang-lic-thesis-22": "From a computational perspective, the question revolves around: Which algorithm performs better classification? Comparing SVM, Random Forest, and Naive Bayes for the classification of movement intention to operate a computer.",
    "lang-lic-thesis-23": "<b>Objectives</b>",
    "lang-lic-thesis-24": "The general objective of this research is the following:",
    "lang-lic-thesis-25": "<i>Compare support vector machine, random forest, and naive Bayes to identify the model that classifies data obtained from an Emotiv Epoc+ headset on movement intention with greater efficiency.</i>",
    "lang-lic-thesis-26": "Specific objectives were established to help achieve the general objective:",
    "lang-lic-thesis-27": "Establish an efficient connection between the Emotiv Epoc+ device and a computer system that allows extracting user's neuronal activity data.",
    "lang-lic-thesis-28": "Adapt the necessary tools, such as the Python program developed by CymatiCorp: CyKit, the OpenViBE program, and the Emotiv software, to ensure correct reception of data from the device acting as an EEG.",
    "lang-lic-thesis-29": "Perform preprocessing of the obtained data to improve the performance of the machine learning models.",
    "lang-lic-thesis-30": "Implement the support vector machine, random forest, and naive Bayes algorithms to conduct learning tests on the brain activity data.",
    "lang-lic-thesis-31": "Analyze which of the aforementioned models classifies the brain activity of the test subject in movement intention with greater efficiency.",
    "lang-lic-thesis-32": "<b>Theoretical background</b>",
    "lang-lic-thesis-33": "The theoretical background addresses topics from the following fields:",
    "lang-lic-thesis-34": "Introduction to neuroanatomy",
    "lang-lic-thesis-35": "Electroencephalography and brain studies",
    "lang-lic-thesis-36": "Computational fundamentals, artificial intelligence, and machine learning",
    "lang-lic-thesis-37": "The mental processes of this research: Imagined speech, concept evocation, and movement intention",
    "lang-lic-thesis-38": "<b>Methodology</b>",
    "lang-lic-thesis-39": "In terms of material, the following aspects were required:",
    "lang-lic-thesis-40": "Windows 11 computer",
    "lang-lic-thesis-41": "Python 3.10",
    "lang-lic-thesis-42": "Emotiv version 1809 for Windows",
    "lang-lic-thesis-43": "CyKit version 3.0",
    "lang-lic-thesis-44": "OpenViBE version 2.7.2 for 64-bit",
    "lang-lic-thesis-45": "Emotiv Epoc+",
    "lang-lic-thesis-46": "In addition, some volunteers were needed for the field experimentation. There were a total of 27 test subjects, with 21 of them being between the ages of 18 and 30. Six of them were 30 years or older. Furthermore, it is emphasized that out of the 27 subjects, 11 were female and 16 were male.",
    "lang-lic-thesis-47": "The steps proposed were the following:",
    "lang-lic-thesis-48": "Familiarization with the headset",
    "lang-lic-thesis-49": "Design of the capture protocol",
    "lang-lic-thesis-50": "Individual data capture",
    "lang-lic-thesis-51": "Data preprocessing",
    "lang-lic-thesis-52": "SVM, Random Forest and Naive Bayes evaluation",
    "lang-lic-thesis-53": "Algorithm comparison",
    "lang-lic-thesis-54": "Analysis and interpretation of results",
    "lang-lic-thesis-55": "Conclusions",
    "lang-lic-thesis-56": "<b>Development</b>",
    "lang-lic-thesis-57": "The working repository of my thesis, where the entire final product itself can be found, and where further development and other topics are explored more in depth, can be accessed <a href=\"https://github.com/Joul24py/UAA-ICI-Thesis\" target=\"_blank\">here</a>.",
    "lang-lic-thesis-58": "<b>Audiovisual evidences</b>",
    "lang-lic-thesis-59": "<b>Conclusions</b>",
    "lang-lic-thesis-60": "In conclusion, it is noteworthy that the objectives were successfully achieved, observing that random forest is the algorithm with the best performance in this specific problem.",
    "lang-lic-thesis-61": "Furthermore, there is much future work that can be done, such as exploring more algorithms, seeking additional data processing techniques, conducting real-time evaluations of this experiment, or continuing the implementation using random forest in a BCI.",
    "lang-lic-thesis-62": "It is worth mentioning that some of the successes of the research were the good familiarization with the headset, the social willingness to participate in the test (thanks to all the volunteers for participating <3), and the chosen data preprocessing.",
    "lang-lic-thesis-63": "As areas for improvement, further experimentation could be conducted to better define the mental task and to standardize the testing environment."
}