{
    "lang-title": "Mi Camino",
    "lang-sel-label": "Idioma: ",
    "lang-sel-opt-es": "Español",
    "lang-sel-opt-en": "Inglés",
    "lang-port-name": "Joel Alejandro Espinoza Sánchez",
    "lang-port-title": "Mi Camino",
    "lang-port-quote": "Allanando el camino a los que vienen y homenajeando el camino de los que me preceden",
    "lang-intro-title": "Mi Camino",
    "lang-intro-p1": "Desarrollé este sitio web para mostrar y opinar respecto al aprendizaje que obtuve y los productos que hice durante mi aprendizaje, desde los apuntes que logré rescatar desde mi educación temprana hasta aquellos productos de mi educación más reciente o autodidacta como lo presento dividido por etapas como se observa a continuación.",
    "lang-intro-p2": "Además cuento mis experiencias de cómo fue estudiar en las distintas instituciones por las que pasé, contando tanto las buenas experiencias como las complicadas. Dejo mucho material de estudio que realicé a disposición pública con la esperanza de que a alguien le sirvan estos productos, ya sea como material de apoyo de estudio o como resolución de dudas.",
    "lang-intro-p3": "",
    "lang-bach": "Bachillerato",
    "lang-bach-1": "Desde antes de entrar al bachillerato yo ya visualizaba esta etapa como la etapa en la que yo quería que mi vida tomara un giro muy drástico al tipo de vida que tenía en mi etapa previa, principalmente en la cuestión social.",
    "lang-bach-2": "Mi intención nunca fue descuidar el (autoevaluado) gran trabajo académico que estaba realizando en mi etapa de educación básica, sin embargo nunca me di el tiempo de construir amistades y quería conseguir finalmente relaciones sociales sólidas y entré a esta etapa de tres años con este enfoque y con esta meta principalmente.",
    "lang-bach-3": "Esto lo conseguí además de no descuidar tanto mis calificaciones (a excepción del primer año) y llevándome de esta etapa recuerdos con personas con quienes me alegra mantener los vínculos que tiempo atrás comencé.",
    "lang-bach-4": "Estudié el bachillerato en el plantel central del Centro de Educación Media de la <a href=\"https://www.uaa.mx/portal/\" target=\"_blank\">Universidad Autónoma de Aguascalientes</a> desde julio del 2015 hasta junio del 2018 siendo, en general, una experiencia muy muy disfrutable desde el término social hasta términos académicos.",
    "lang-bach-s1": "Primer Semestre",
    "lang-bach-s1-quote": "Todo lo que podemos hacer es dar lo mejor de nosotros y, a veces, lo mejor que podemos hacer es empezar de nuevo - Peggy Carter (Capitán América y el Soldado del Invierno)",
    "lang-bach-s1-1": "Este primer semestre fue un golpe de realidad a nivel educativo, sintiendo que viniendo de la secundaria no estaba tan preparado para la exigencia que había en ciertas materias. Yo iba muy animado a la materia de álgebra pues el Profesor Eduardo Guerrero Miranda nos dio un propedéutico de matemáticas que me hicieron despertar la curiosidad por las matemáticas, pero por otro lado, materias como Biología o Historia las sentía muy cargadas de contenido que yo pensaba que no daría el ancho ni en este semestre ni en la continuación de estas materias en el semestre siguiente.",
    "lang-bach-s1-2": "Sin embargo, aunque las cosas no salieron tan bien, académicamente no me fue tan mal, pasando el semestre satisfactoriamente en todas las materias.",
    "lang-bach-s1-algb": "Álgebra",
    "lang-bach-s1-algb-1": "El semestre lo empezábamos diariamente a las 7:00 de la mañana con la materia de álgebra. Impartido por el Profesor Eduardo Guerrero Miranda, el curso fue dinámico y a veces frenético, pero en mi opinión siempre fue interesante, donde aprendimos las bases del álgebra, con ecuaciones, fracciones, factorización y demás temas que, desde mi opinión, estuvieron muy bien enseñados por el docente.",
    "lang-bach-s1-algb-2": "Con el profesor Eduardo me sentiré eternamente agradecido por impartirme este curso, pues con este curso entendí las matemáticas tras nueve años de llevarlas estudiando sin tenerles tanto gusto, pues no conocía su uso, comprensión y aplicación como lo hice hasta este curso. Fue gracias a él que les agarré interés y pasión, tanto que hasta el mismo profesor lo notó apuntándome para un concurso interno de matemáticas y que me motivó a participar en otras competiciones más grandes como las olimpiadas de matemáticas, a las que acabaría participando en el cuarto semestre de mi bachillerato (además del apoyo de otro amigo que conocí más adelante).",
    "lang-bach-s1-algb-3": "Fue un curso con definiciones de algunos temas de álgebra pero más que nada la realización de ejercicios que nos permitieran comprender cada tema del curso.",
    "lang-bach-s1-algb-4": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/1/01-Algebra.pdf\" target=\"_blank\">aquí</a> pese a que creo que son apuntes sucios con mi letra a puño que siempre ha sido muy fea pero considero que fue un buen desarrollo de los temas de la materia de álgebra por lo que pueden ser útiles.",
    "lang-bach-s1-hist": "Historia Moderna",
    "lang-bach-s1-hist-1": "Desde mi opinión, esta materia era una de las dos más difíciles de este semestre. La materia exigía de mucho esfuerzo pues se veía mucho contenido de sucesos previos al Primer Conflicto Armado Mundial.",
    "lang-bach-s1-hist-2": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/1/02-Historia-Apuntes.pdf\" target=\"_blank\">aquí</a> donde traté de realizarlos con más cuidado pues nos evaluaban los apuntes, igualmente las tareas que hicimos en la materia pueden consultarse <a href=\"01-Apuntes/02-Bachillerato/1/03-Historia-Tareas.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bach-s1-estr": "Estrategias Cognitivas",
    "lang-bach-s1-estr-1": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/1/04-EstrategiasCognitivas.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bach-s1-tics": "Tecnologías de la Información y la Comunicación",
    "lang-bach-s1-tics-1": "La materia era la materia de computación del semestre, donde nos enseñaron muchas cosas relacionadas al equipo de cómputo. Nos enseñaron lo básico de una computadora, algunas aplicaciones de Microsoft Office y un poco del funcionamiento informático de la institución.",
    "lang-bach-s1-tics-2": "La materia no requirió de realizar apuntes pues fue puramente realización práctica en equipos de cómputo, por lo que no tengo tantos apuntes, aunque la materia fue interesante. Lo poco que desarrollé de apuntes se puede consultar <a href=\"01-Apuntes/02-Bachillerato/1/05-TICs.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bach-s1-biol": "Biología Celular",
    "lang-bach-s1-biol-1": "Esta es, junto con la materia de Historia, lo más difícil que afronté en este primer semestre. La materia de biología celular fue muy difícil para mí; aquí la memorización no se sentía en vano. Veíamos la estructura celular (que aunque pueden considerarse como pocos organelos, a mí se me hacía muy pesado aprender todo esto) pero esto lo ligábamos con cómo cada organelo participaba en funciones celulares cuando llegábamos a este tema, de modo que era constantemente avanzar necesitando el conocimiento anterior.",
    "lang-bach-s1-biol-2": "La materia me fue impartida por el gran docente Eduardo Alvarado Villalobos, quien se encargó de brindarnos muchísima información y muy clara acerca de la biología celular. Sus clases eran muy dinámicas, la forma de explicar y de aclararnos las dudas siempre fue de mucha ayuda para todo el salón y creo que fue uno de los pilares principales para todos los colegas que se especializaron en las ciencias naturales relacionadas a la biología.",
    "lang-bach-s1-biol-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/1/06-BiologiaCelular.pdf\" target=\"_blank\">aquí</a> los cuales no son apuntes muy sucios, tampoco muy limpios pero creo que son muy útiles por toda la información dada y estructurada en este curso.",
    "lang-bach-s1-leng": "Lengua y Comunicación",
    "lang-bach-s1-leng-1": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/1/07-Lengua.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bach-s1-ingl": "Inglés",
    "lang-bach-s1-ingl-1": "Esta materia de inglés estuvo entretenida. Aprendíamos inglés desde un punto de vista muy académico pero también lo practicábamos saliéndonos del esquema teniendo conversaciones largas o debates para solidificar nuestro dominio del inglés conversando.",
    "lang-bach-s1-ingl-2": "Fue una materia muy interesante la impartida por la docente Olga Patricia de Luna Aguilar, con múltiples formas de practicar y de aprender que creo que al final todos disfrutamos.",
    "lang-bach-s1-ingl-3": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/1/08-Ingles.pdf\" target=\"_blank\">aquí</a> los cuales son apuntes medianamente limpios pero no creo que se les pueda sacar ningún provecho debido a que el curso no se explica completamente con los pocos apuntes hecho.",
    "lang-bach-s2": "Segundo Semestre",
    "lang-bach-s2-quote": "A veces, aquello que has estado buscando toda tu vida, está ahí, junto a ti todo el tiempo - Peter Quill (Guardianes de la Galaxia Volumen 2)",
    "lang-bach-s2-1": "El segundo semestre que viví fue básicamente una muy buena continuación de los primeros seis meses en este plantel educativo. Las amistades que había iniciado el semestre anterior las estaba solidificando en este semestre además de darme la oportunidad de seguir conociendo más personas del plantel, todas con quienes pasaba buenos ratos.",
    "lang-bach-s2-2": "La continuación de un buen momento anímico socialmente seguía a la alza. Académicamente sólo esperaba poder mejorar un poco lo que había alcanzado el semestre pasado, pero no me avergonzaba, pues consideraba que había hecho un buen esfuerzo el semestre pasado.",
    "lang-bach-s2-3": "Sin embargo, en este semestre se nos presentó la posibilidad de poder cambiarnos al Programa del Diploma del Bachillerato Internacional, duda que nos dejaba a muchos del salón pensando si para tercer semestre sacrificaríamos las amistades y el salón en el que estábamos por la exigencia académica y los nuevos e inciertos desafíos de este programa.",
    "lang-bach-s2-hist": "Historia Contemporánea",
    "lang-bach-s2-hist-1": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/2/01-Historia-Apuntes.pdf\" target=\"_blank\">aquí</a> así como las tareas que hice <a href=\"01-Apuntes/02-Bachillerato/2/02-Historia-Tareas.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bach-s2-etim": "Etimologías Grecolatinas",
    "lang-bach-s2-etim-1": "En esta materia estuvimos estudiando el origen etimológico de gran parte del vocabulario que usamos en el español, empezando por las raíces provenientes del griego y finalizando el curso con las raíces provenientes del latín.",
    "lang-bach-s2-etim-2": "El curso lo impartió la maestra Mary Antonia Montes y he de decir que fue un buen curso. Siento qu aprendí a tratar de comprender más que memorizar las raíces etimológicas de las palabras, asociando palabras que tienen prefijos o sufijos (u otras estructuras) similares y así asociando el significado de dicha estructura etimológica. Fue un buen curso.",
    "lang-bach-s2-etim-3": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/2/03-Etimologias-Apuntes.pdf\" target=\"_blank\">aquí</a> así como las tareas que hice <a href=\"01-Apuntes/02-Bachillerato/2/04-Etimologias-Tareas.pdf\" target=\"_blank\">aquí</a> los cuales son apuntes medianamente limpios  y con la diversidad de actividades que hicimos, pueden ser útiles.",
    "lang-bach-s2-evol": "Evolución y Biodiversidad",
    "lang-bach-s2-evol-1": "El profesor Eduardo Alvarado Villalobos repitió como nuestro docente en esta materia que sería la continuación a la materia de Biología Celular del semestre anterior. Siguiendo la misma tendencia que el semestre pasado, el profesor volvió a darnos una clase excelente. Con ejemplos muy claros de los temas de las teorías de la evolución y un muy extenso programa de la biodiversidad de los seres vivos que hasta hoy en día puedo recordar nombres de algunos dominios, reinos y phyllums. Un docente excelente que hizo un gran trabajo en enseñarnos estos temas.",
    "lang-bach-s2-evol-2": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/2/05-Evolucion-Apuntes.pdf\" target=\"_blank\">aquí</a> así como las tareas que hice <a href=\"01-Apuntes/02-Bachillerato/2/06-Evolucion-Tareas.pdf\" target=\"_blank\">aquí</a> los cuales son apuntes en donde traté de ser lo más limpio posible y creo que estos mismos pueden ser útiles.",
    "lang-bach-s2-ingl": "Inglés",
    "lang-bach-s2-ingl-1": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/2/07-Ingles-Apuntes.pdf\" target=\"_blank\">aquí</a> así como las tareas que hice <a href=\"01-Apuntes/02-Bachillerato/2/08-Ingles-Tareas.pdf\" target=\"_blank\">aquí</a> los cuales son apuntes que quizá no reflejen todo el trabajo de la clase, pero algunas actividades pueden ser de utilidad.",
    "lang-bach-s2-tall": "Taller de Lectura y Redacción",
    "lang-bach-s2-tall-1": "El curso, impartido por la docente Rosa Imelda López Hurtado, fue un curso realmente tomado en serio, creo que muy en serio. Vimos muchos temas relacionados al español, como las funciones de la lengua, algunos recursos literarios y otros tópicos que creo que se abordaron perfectamente además de leer obras como \"El Viudo Román\", \"Tomochic\" y \"Noches Blancas\"; sin duda que, en cuanto a conocimiento, es una materia y una docente que enseñaron y se pudo aprender muy satisfactoriamente.",
    "lang-bach-s2-tall-2": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/2/09-TLR-Apuntes.pdf\" target=\"_blank\">aquí</a> así como las tareas que hice <a href=\"01-Apuntes/02-Bachillerato/2/10-TLR-Tareas.pdf\" target=\"_blank\">aquí</a> los cuales son apuntes en donde traté de ser lo más limpio posible y creo que estos mismos pueden ser útiles.",
    "lang-bach-s2-geom": "Geometría y Trigonometría",
    "lang-bach-s2-geom-1": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/2/11-Geometria-Apuntes.pdf\" target=\"_blank\">aquí</a> así como las tareas que hice <a href=\"01-Apuntes/02-Bachillerato/2/12-Geometria-Tareas.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bach-s2-msi": "Manejo de Sistemas de la Información",
    "lang-bach-s2-msi-1": "Siendo la parte dos de la materia de computación de la prepa, esta materia nos enseñó algunas bases de redes de computadoras, coninuamos con programas de la suite de Microsoft Office y vimos un poco de otros programas útiles. La docente hizo un buen trabajo en enseñarnos estos temas pero sí considero que le hizo falta un poco más de empatía con aquellos alumnos que no eran tan rápidos con la computadora.",
    "lang-bach-s2-msi-2": "La materia no requirió de realizar apuntes pues fue puramente realización práctica en equipos de cómputo, por lo que no tengo tantos apuntes, aunque la materia fue interesante. Lo poco que desarrollé de apuntes se puede consultar <a href=\"01-Apuntes/02-Bachillerato/2/13-MSI.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi": "Bachillerato Internacional",
    "lang-bi-1": "Cuando cursé la preparatoria, el centro afiliado a la Universidad Autónoma de Aguascalientes tenía la opción de cursar el Programa del Diploma del <a href=\"https://www.ibo.org/es/\" target=\"_blank\">Bachillerato Internacional</a>. Este programa consta de dos años de cursos por lo que a mediados de segundo semestre de la preparatoria te permiten aplicar a este nuevo programa o continuar en el programa que se está llevando.",
    "lang-bi-2": "Fueron mis amigos quienes me animaron a hacer un intento por aplicar al Bachillerato Internacional y fui elegido junto con ellos para ser parte del programa de mi generación. Después de hablarlo con mi familia fue una opción que tomamos y que ahora, viendo al pasado, es una de las mejores decisiones que tomé. Es una de las mejores experiencias que viví tanto a nivel de educación gracias a la gran calidad de docentes, como a nivel social. Sin alejarme de mis grandes amigos de la preparatoria, además conocí muchas más personas que aún considero amigos cercanos, pues todo el grupo del Bachillerato Internacional, mis \"IB Brothers\" fueron y siguen siendo mi inspiración para trabajar duro. Además que, independientemente del programa educativo del que esté hablando, conocí personas increíbles, amigos únicos, gente que estimo y quiero mucho todavía hoy en día.",
    "lang-bi-3": "Tal vez en cuanto a calificaciones logré mejorar mis promedios con respecto a los anteriores dos semestres, pero igualmente la exigencia había incrementado muchísimo a niveles de trabajo a los que nunca me imaginé llegar, teniendo lo que yo denonimo como \"mi prime\" en esta etapa, logrando trabajar en alto rendimiento y con buena eficiencia durante los semestres aún con promedios de sueño muy muy bajos. Sé que \"mi prime\" quedó en esa etapa porque actualmente valoro mucho dormir y aunque no vuelva a estar a ese nivel de rendimiento, prefiero mucho mejor el buen descanso hoy en día.",
    "lang-bi-4": "Fui parte de la convocatoria Mayo 2018 del Bachillerato Internacional registrando las materias \"Español A: Literatura\" de Nivel Superior obteniendo 5 puntos, \"Inglés B\" de Nivel Superior logrando 5 puntos, \"Historia de América\" de Nivel Superior obteniendo 4 puntos, \"Matemáticas\" de Nivel Medio logrando 5 puntos, \"Biología\" de Nivel Medio obteniendo 4 puntos y \"Química\" de Nivel Medio logrando 3 puntos; además de obtener 2 puntos tras obtener una B en mi Monografía de Estudios del Mundo Contemporáneo y una B en mi calificación de Teoría del Conocimiento lo que da un total de 28 puntos conseguidos en este programa educativo.",
    "lang-bi-s3": "Tercer Semestre",
    "lang-bi-s3-quote": "Surgió una idea llamada la inicativa Vengadores... - Nick Fury (The Avengers)",
    "lang-bi-s3-1": "Este primer semestre de Bachillerato Internacional fue turbulento. Fue una nueva etapa. Los amigos que veía siete horas diarias ya no estaban en mi mismo salón, aunque sí en mismo plantel. Ya no estábamos en la prepa por siete horas, sino por nueve, es decir, pasábamos de 7:00 a.m. a 4:00 p.m. en el plantel en clases. Los cambios no fueron fáciles incluso teniendo a mis amigos con quienes entré, pues entrábamos en un nuevo grupo, con personas que aún no conocía y que pensaba que serían muy duros con nosotros.",
    "lang-bi-s3-2": "Sin embargo avanzó el semestre, nos conocimos entre todos, formamos un muy bonito grupo y consolidamos el primer paso de esta gran etapa con mucha alegría y apoyo entre nosotros.",
    "lang-bi-s3-chem": "Química 1",
    "lang-bi-s3-chem-1": "El camino de Química del Programa del Diploma lo inauguró la profesora Mónica Rosaura González Palacios quien nos dio la introducción a la forma en la que se trabajaría en este programa académico y nos guió en este semestre con temas iniciales como la estequiometría o la introducción al laboratorio de química.",
    "lang-bi-s3-chem-2": "He de decir que me agradaban sus clases aunque de vez en cuando me parecía algo aburrido el deternernos constantemente con las diapositivas, pero lo entendía, pues en los dos años había que cubrir muchísima teoría. Afortunadamente teníamos que hacer las prácticas de laboratorio que me hacían sentir que poníamos en práctica los conocimientos y que eran muy entretenidas.",
    "lang-bi-s3-chem-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/3/01-Quimica.pdf\" target=\"_blank\">aquí</a> pese a que creo que son apuntes sucios, considero que fue un buen desarrollo de los temas de la materia por lo que pueden ser útiles.",
    "lang-bi-s3-biol": "Biología 1",
    "lang-bi-s3-biol-1": "El profesor Francisco Javier Acosta Collazo fue quien nos guió en todo nuestro trayecto por la materia de Biología de Bachillerato Internacional. Según cuentan los docentes del programa, es en gran medida gracias a él que se tuvieron las pláticas para que la Universidad Autónoma de Aguascalientes abriera una sede del Bachillerato Internacional en sus instalaciones.",
    "lang-bi-s3-biol-2": "Respecto a las clases, sus clases no me convencían mucho. No es mal profesor ni mucho menos (al menos yo no lo considero un mal profesor) pero creo que sí deja al alumno hacer gran parte del aprendizaje por sí mismo y teniendo en cuenta que las materias de biología en mi primer año de la preparatoria no fueron mi fuerte, aquí me costó todavía más. Pese a todo el estudio que hacía, nunca logré sacar un examen de esta materia (ni en este semestre ni en ninguno de los posteriores) con una calificación superior al 7 sobre 10.",
    "lang-bi-s3-biol-3": "Creo que fue un buen docente pero especialmente yo me sentí algo solo cursando la materia pues siempre se me ha hecho difícil este campo y me sentía con un poco de falta de asesoría para entender mejor estos temas que ya habíamos visto en Biología Celular.",
    "lang-bi-s3-biol-4": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/3/02-Biologia.pdf\" target=\"_blank\">aquí</a> pese a que creo que son apuntes sucios, considero que fue un buen desarrollo de los temas de la materia por lo que pueden ser útiles.",
    "lang-bi-s3-tdc": "Teoría del Conocimiento 1",
    "lang-bi-s3-tdc-1": "La docente Yéshica Chávez Murillo es sin duda uno de los docentes referentes que imparten clases en el Programa del Diploma. Siendo la docente que imparte la materia de Teoría del Conocimiento, nos enseñó muchas cosas, entre las cuestiones de debatir, argumentar, cuestionarnos, formularnos preguntas sobre la realidad y prepararnos para los productos que hay que entregar como parte de esta materia.",
    "lang-bi-s3-tdc-2": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/3/03-TdC.pdf\" target=\"_blank\">aquí</a> pese a que creo que son apuntes sucios, considero que fue un buen desarrollo de los temas de la materia por lo que pueden ser útiles.",
    "lang-bi-s3-ingl": "Inglés 1",
    "lang-bi-s3-ingl-1": "Para una mejor guía en esta materia tuvimos dos docentes que tomarían mitad del grupo cada quien. La profesora Isabel Fernández fue con quien se me asignó dándome las clases de inglés donde aprendíamos y practicábamos además de prepararnos para los productos que el Programa del Diploma nos exigía, empezando por leer en este semestre la obra \"The Canterbury Tales\" para ensayos u productos de grabación de audio que se harían posteriormente.",
    "lang-bi-s3-ingl-2": "Personalmente creo que la maestra conoce perfectamente cómo guiar a los alumnos a los productos que pide el Bachillerato Internacional y nos prepara muy bien. Quizá no siempre entendía las dinámicas de la maestra y eso me frustraba en ocasiones, pero al final se observaba que cada dinámica la preparaba con un propósito bien pensado.",
    "lang-bi-s3-ingl-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/3/04-Ingles.pdf\" target=\"_blank\">aquí</a> pese a que creo que son apuntes sucios, considero que fue un buen desarrollo de los temas de la materia por lo que pueden ser útiles.",
    "lang-bi-s3-lite": "Literatura 1",
    "lang-bi-s3-lite-1": "Eduardo López Hernández, apodado como \"Lobo\" es sin duda uno de los mejores docentes de esta etapa. Referente del Bachillerato Internacional, el profesor Lobo nos guió en la interpretación literaria desde el principio. Nadie de nosotros sabía lo que era interpretar de la forma en la que el profesor quería que lo hiciéramos. Más de una vez llegó a desesperarse por nuestra falta de creatividad e ingenio al interpretar textos y más al principio, es decir, sobre todo en este semestre. Con obras como \"Prometeo Encadenado\", \"La Odisea\" y algunos cuentos de Juan Rulfo especialmente \"Anacleto Morones\" junto con muchas otras obras. Este inicio en la literatura nos costó a todos pero a lo largo de los próximos semestres intentamos todos mejorar en la interpretación literaria.",
    "lang-bi-s3-lite-2": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/3/05-Literatura.pdf\" target=\"_blank\">aquí</a> pese a que creo que son apuntes sucios, considero que fue un buen desarrollo de los temas de la materia por lo que pueden ser útiles.",
    "lang-bi-s3-cas": "Creatividad, Acción y Servicio 1",
    "lang-bi-s3-cas-1": "La profesora Teresa de Jesús López Huerta nos guió en esta materia donde nos querían asimilar a proyectos de servicio social en términos simples. La idea de la materia es construir proyectos con impacto positivo en la sociedad y bajo la supervisión de la profesora, se buscaron proyectos a los que cada quien entró. Junto con algunos amigos míos, nosotros elegimos en este primer semestre del Programa del Diploma un proyecto de Reforestación en distintas zonas del municipio de Aguascalientes que no estuvo nada mal, teniendo aprendizajes variados y experiencias muy gratificantes.",
    "lang-bi-s3-cas-2": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/3/06-CAS.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s3-fisi": "Física 1",
    "lang-bi-s3-fisi-1": "Esta materia de Física era interesante pero tristemente no llevó a nada más pues no pudimos inscribirla como parte de las materias evaluadas en el Bachillerato Internacional de modo que duró dos semestres y desapareció del programa sin mayor impacto futuro.",
    "lang-bi-s3-fisi-2": "Impartida por la profesora Coral Arreola Sámano, fue un curso tranquilo. Aprendimos las bases de ciertos conceptos de la física y la mecánica aunque con un ritmo muy lento. Ya desde este punto sabíamos que la materia no tendría un impacto en el Programa del Diploma y creo que por ello no se le pusieron las suficientes ganas.",
    "lang-bi-s3-fisi-3": "No considero como mala profesora a la docente encargada del curso, aunque algunas clases sí eran aburridas y en ciertos puntos sentía que no avanzábamos en los temas.",
    "lang-bi-s3-fisi-4": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/3/07-Fisica.pdf\" target=\"_blank\">aquí</a> pese a que creo que son apuntes sucios, considero que fue un buen desarrollo de los temas de la materia por lo que pueden ser útiles.",
    "lang-bi-s3-hist": "Historia 1",
    "lang-bi-s3-hist-1": "Otra gran docente a destacar en mi paso por el Bachillerato Internacional es a la Doctora Miriam Herrera Cruz. Además de dedicarse a entablar una buena relación maestro - alumno con todos nosotros, siempre nos enseñó la historia de una forma muy divertida. Nunca sentí que la profesora nos enseñara con el objetivo único de memorizar, sino comprender y discutir los hechos y sí, esto muy influenciado por los objetivos del Bachillerato Internacional pero creo que también tiene su mérito el llevarlo a cabo de la gran forma en la que lo ejecutó la maestra.",
    "lang-bi-s3-hist-2": "En esta materia definimos algunos temas que veríamos del Programa del Diploma y especialmente en este semestre cubrimos el que fue el Tema Prescrito que elegimos de nuestro programa de Historia que fue el número 4: \"Derechos y Protestas\" cubriendo temas de las protestas y sucesos raciales que ocurrieron en Estados Unidos en el Siglo XIX y el Siglo XX y los sucesos relacionados con Nelson Mandela en Sudáfrica.",
    "lang-bi-s3-hist-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/3/08-Historia.pdf\" target=\"_blank\">aquí</a> los cuales considero de gran utilidad al ser la primera materia de historia en llamarme tanto la atención.",
    "lang-bi-s3-estu": "Estudios Matemáticos 1",
    "lang-bi-s3-estu-1": "Edgar Ahmed Muñoz Guzmán: El mejor profesor que me ha impartido clases.",
    "lang-bi-s3-estu-2": "El Profesor Ahmed nos guió en la materia de Estudios Matemáticos de una forma excelente. El profesor es súper amable con todos, domina temas de distintas áreas de la biología, la química, la física, las matemáticas y la computación. Explica con mucha calma y paciencia, fomenta el respeto del grupo y no tolera las burlas hacia las \"preguntas tontas\" las cuales resuelve con mucha paciencia y empatía a los alumnos. No sólo es el mejor profesor de matemáticas que me ha impartido clases, es el mejor profesor que me ha impartido clases.",
    "lang-bi-s3-estu-3": "El profesor Ahmed es indudablemente, el mejor profesor que me ha impartido clases. No repetiré esto en los siguientes cursos, pero durante los dos años del Bachillerato Internacional mantuvo siempre su gran actitud, fue un profesor que, incluso si le preguntábamos de biología, nos respondía con una soltura que demostraba su dominio pero con ciertas cosas intrigantes que hasta alumnos como yo (que no nos llamaba mucho esa materia) nos dejaba cuestionándonos cosas para investigar y aprender más. Siempre estuvo abierto a resolver dudas, explicar atentamente, amablemente y asegurarse que sus alumnos realmente comprendieran aquellos temas con los que llegaban con dudas. Es gracias a él y al Profesor Eduardo Guerrero Miranda que hoy en día me apasionan tanto los temas de matemáticas.",
    "lang-bi-s3-estu-4": "Durante este curso vimos temas iniciales del programa, principalmente algunas bases de matemáticas como los números y el álgebra y aplicaciones en las finanzas, como las conversiones de divisas, intereses, así como también vimos las figuras cónicas de la geometría analítica.",
    "lang-bi-s3-estu-5": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/3/09-EM.pdf\" target=\"_blank\">aquí</a> los cuales considero de gran utilidad y a los que les guardo especial cariño.",
    "lang-bi-s4": "Cuarto Semestre",
    "lang-bi-s4-quote": "Debemos encontrar la manera de cuidarnos unos a otros, como si fuéramos una sola tribu - T'Challa (Black Panther)",
    "lang-bi-s4-1": "Ya con un semestre de experiencia en estos nuevos terrenos, las cosas comenzaban a tomar más forma en el Programa del Diploma. Se notaba cómo empezábamos a alejarnos de las sensaciones de estar en nuestro antiguo programa de la preparatoria y comenzaban a surgir los retos del Bachillerato Internacional. Estos retos ya los podíamos afrontar con mayor unión pues el tercer semestre de la prepa nos ayudó a consolidar un grupo muy unido y bien conectado entre todos.",
    "lang-bi-s4-2": "Fue así que comenzamos con los primeros proyectos que, además requerían de una unión y coordinación entre todo el grupo lo cual también ayudó a unir todavía más al grupo como fue el Proyecto del Grupo 4 o abreviado, el P4. Este proyecto consistía en abordar un problema usando áreas del conocimiento del grupo cuatro del Bachillerato Internacional el cual es el de las ciencias experimentales por lo que usaríamos las áreas de la biología, la química y la física.",
    "lang-bi-s4-3": "Así también empezábamos a realizar productos individuales importantes, como el desarrollo de la Monografía, una mini tesina de 4,000 palabras sobre un tema en específico con la metodología científica apropiada la cual suponía uno de los retos más grandes del Programa del Diploma. Todo esto aún estudiando los temas que se nos evaluarían en las Evaluaciones Externas, los exámenes finales del programa con los que se concluyen los estudios del Bachillerato Internacional.",
    "lang-bi-s4-biol": "Biología 2",
    "lang-bi-s4-biol-1": "No tengo mucho que comentar al respecto. La continuidad del profesor Francisco Javier Acosta Collazo se mantuvo para mantener cierta constancia en el proceso que estábamos llevando y sus clases eran en esencia similares a las del semestre pasado.",
    "lang-bi-s4-biol-2": "Eso sí, a partir de este semestre sentí más esa soledad de aprendizaje de esta materia especialmente pues el profesor Paquito se había vuelto decano del Centro de Educación Media, lo cual se notó en sus clases. Sin embargo, el profesor nos seguía apoyando en las prácticas, los productos para el Bachillerato Internacional y el P4.",
    "lang-bi-s4-biol-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/4/01-Biologia.pdf\" target=\"_blank\">aquí</a>. Son apuntes sucios y muy breves pero quizá con cierta utilidad.",
    "lang-bi-s4-chem": "Química 2",
    "lang-bi-s4-chem-1": "Tuvimos el primer cambio en la alineación de profesores en esta materia. La maestra Mónica no continuó impartiendo la clase de química y en su lugar nos asesoró el profesor Pedro Gabriel Láriz Durón. El profesor Láriz fue un buen maestro de química con buen tacto por sus alumnos y buena forma de explicar los temas de química entre los cuales vimos cinética química, electroquímica y la introducción a la química orgánica.",
    "lang-bi-s4-chem-2": "Lo único que yo señalaría es que no se apegaba mucho al Programa del Diploma, lo cual hacía que viéramos temas de Química Nivel Superior que no nos tocaba estudiar y omitíamos temas imprescindibles de Química Nivel Medio, de modo que fue un caos cuando nos dimos cuenta y en futuros semestres lo resentiríamos. Sin embargo también hay que aclarar que aquí, en el registrado ante la Organización del Bachillerato Internacional como Centro de Bachillerato y Secundaria de la U.A.A. teníamos la opción de presentar evaluaciones por el Diploma eligiendo ya sea Química Nivel Medio o una materia de Artes lo cual separaría al grupo para el próximo semestre en dar continuidad en esta materia o cambiarla por Artes según fuera la elección individual.",
    "lang-bi-s4-chem-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/4/02-Quimica.pdf\" target=\"_blank\">aquí</a> los cuales considero de gran utilidad.",
    "lang-bi-s4-tdc": "Teoría del Conocimiento 2",
    "lang-bi-s4-tdc-1": "La maestra Yéshica Chávez Murillo se mantuvo al frente de esta materia manteniendo la continuidad de la materia con la docente. La maestra nos empezó a guiar realizando algunos preparativos para lo que sería el ensayo y la exposición que se evalúan como parte de Teoría del Conocimiento, enseñándonos a evaluar y explorar las distintas áreas y formas del conocimiento para analizar distintas situaciones reales dependiendo de las preguntas de conocimiento que la Organización del Bachillerato Internacional realice para cada convocatoria.",
    "lang-bi-s4-tdc-2": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/4/03-TdC.pdf\" target=\"_blank\">aquí</a> los cuales considero de gran utilidad.",
    "lang-bi-s4-ingl": "Inglés 2",
    "lang-bi-s4-ingl-1": "En la mitad en la que se me asignó para la materia de inglés mantuvimos la continuidad con la maestra Isabel Fernández siguiendo la misma forma de trabajo del semestre pasado y en esencia el mismo nivel y satisfacción por su materia como en anteriores semestres. Ciertamente entre más avanzábamos, más entendía y disfrutaba de sus clases. En este semestre leímos \"The Picture of Dorian Gray\" por Oscar Wilde para discutirlo y revisar algunas de las preguntas que se abordan en esta materia tanto en las Evaluaciones Internas como en las Evaluaciones Externas.",
    "lang-bi-s4-ingl-2": "Además la materia hizo una fusión junto con Física y CAS para desarrollar el proyecto de CAS de este semestre como una explicación de energías renovables en inglés a niños para concientizar en usarlas adecuadamente.",
    "lang-bi-s4-ingl-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/4/04-Ingles.pdf\" target=\"_blank\">aquí</a>. Son apuntes con mayormente actividades hechas en clase que con poco contexto quizá no sean de tanta utilidad.",
    "lang-bi-s4-lite": "Literatura 2",
    "lang-bi-s4-lite-1": "El profesor Lobo también mantuvo la continuidad con nosotros para este nuevo semestre. En este nuevo semestre tratamos de aprender y desarrollar mejor la capacidad de interpretación en general como grupo. En clase leímos cuentos de Guy de Maupassant, Edgar Allan Poe, Julio Cortázar, entre otros así como fuimos leyendo a lo largo del semestre obras que se catalogaban como literatura extranjera para analizar su estilo narrativo y los tipos de problemáticas que se planteaban en estas obras. Las obras que leímos de este tipo fueron \"La Muerte en Venecia\" de Thomas Mann, \"El Caballero Inexistente\" de Italo Calvino, \"Hamlet\" por William Shakespeare y \"Casa de Muñecas\" de Henrik Ibsen.",
    "lang-bi-s4-lite-2": "En general siento yo que mejoramos en la interpretación de textos y seguimos aprendiendo muchísimo del profesor Lobo por lo que nuevamente esta materia nos dejó muchísimos muchísimos conocimientos y mucha preparación para el Programa del Diploma.",
    "lang-bi-s4-lite-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/4/05-Literatura.pdf\" target=\"_blank\">aquí</a> los cuales considero de gran utilidad.",
    "lang-bi-s4-cas": "Creatividad, Acción y Servicio 2",
    "lang-bi-s4-cas-1": "La maestra Teresa de Jesús López Huerta continuó como nuestra docente en esta materia asesorándonos para el proyecto de CAS de este semestre. En este semestre decidimos hacer un proyecto diferente a lo ofertado en otros semestres. Combinando conocimientos de las materias de Física e Inglés decidimos hacer un proyecto para concientizar a alumnos de primaria del Colegio Villalobos de Aguascalientes sobre el uso de energías renovables al mismo tiempo en donde tratábamos de enseñar algunos de estos términos en inglés.",
    "lang-bi-s4-cas-2": "En este curso no desarrollé apuntes como tal de la materia de CAS. El material que preparamos para las sesiones de Clean Energizers las adjunté en los apuntes de Inglés de este mismo semestre.",
    "lang-bi-s4-fisi": "Física 2",
    "lang-bi-s4-fisi-1": "La maestra Coral Arreola Sámano repitió como docente de esta materia así como sería el cierre de la materia de Física, pues como no tendría salida alguna como parte de las materias registradas para el Diploma, se descartó para futuros semestres.",
    "lang-bi-s4-fisi-2": "Como contenido de la materia vimos algunos temas sobre energía entrando al tema de temperatura y calor. Sin embargo, mayormente, su clase era utilizada para el P4 o para el proyecto de CAS donde planeábamos a veces las actividades de las sesiones de CAS que daríamos posteriormente o también en los distintos equipos del P4 (en donde yo me encontraba en el equipo de Física) planteábamos el proyecto que haríamos (que como buenos mexicanos decidimos usar nopal para la producción de biogas) y las distintas actividades que harían los equipos del P4.",
    "lang-bi-s4-fisi-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/4/06-Fisica.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s4-mono": "Monografía 1",
    "lang-bi-s4-mono-1": "En este semestre comenzamos con el desarrollo de la Monografía. Guiados por la maestra Leticia Vázquez Méndez, nos dio una excelente tutoría a lo largo de todo el proceso de la Monografía. En este semestre especialmente nos dio la introducción a lo que es realizar una monografía, mostrándonos ejemplos de monografías anteriores, dándonos las pautas de los criterios de evaluación según inscribamos la Monografía ante el Bachillerato Internacional y empezando en este semestre a buscar un asesor para la Monografía.",
    "lang-bi-s4-mono-2": "En mi caso había empezado con ideas de realizar una Monografía de Matemáticas e Informática o de Matemáticas y Música. Busqué algunos profesores con conocimiento en estas áreas y empezaba a definir el rumbo de mi Monografía pero viendo el desconocimiento tan amplio que tenía yo de la informática, terminé descartando la idea y apoyado por Ladislao Rafael \"El Güero\" Juárez Rodríguez y el profesor Guillermo Cebreros Lira, comenzamos a definir un tema para la Monografía que involucraran los temas de Matemáticas y Música para el término de este semestre.",
    "lang-bi-s4-mono-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/4/07-Monografia.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s4-hist": "Historia 2",
    "lang-bi-s4-hist-1": "Empezando este semestre la continuidad de la maestra Miriam Herrera Cruz se mantenía, sin embargo, a mediados del semestre la maestra tuvo que retirarse para apoyar el Departamento de Historia de la Universidad Autónoma de Aguascalientes por lo que no pudo continuar dándonos clase y a la mitad del semestre nos pasó a dar esta clase la maestra Diana Altagracia Muñoz Cruz.",
    "lang-bi-s4-hist-2": "Este curso mantuvo los temas del tema prescrito que abordamos el semestre pasado además de comenzar con los Temas de Historia Munidal, los cuales elegimos los temas 10: \"Estados Autoritarios (s. XX)\" y 11: \"Causas y consecuencias de las guerras del Siglo XX\" aunque sí sentimos un poco de tristeza y de menor contacto con la maestra Altagracia. Al menos yo sentía que en cierta medida volvíamos a los tipos de enseñanza de historia de memorizar.",
    "lang-bi-s4-hist-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/4/08-Historia.pdf\" target=\"_blank\">aquí</a> los cuales considero de gran utilidad.",
    "lang-bi-s4-estu": "Estudios Matemáticos 2",
    "lang-bi-s4-estu-1": "Edgar Ahmed Muñoz Guzmán: El mejor profesor que me ha impartido clases.",
    "lang-bi-s4-estu-2": "El Profesor Ahmed mantuvo la excelente calidad de curso que ya nos había brindado el semestre pasado en este nuevo semestre siendo otro gran curso de matemáticas en el que pude estar. Durante este curso vimos temas de lógica proposicional, estadística, probabilidad y un poco de combinatoria.",
    "lang-bi-s4-estu-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/4/09-EM.pdf\" target=\"_blank\">aquí</a> los cuales considero de gran utilidad y a los que les guardo especial cariño.",
    "lang-bi-s4-omm": "Olimpiada Mexicana de Matemáticas",
    "lang-bi-s4-omm-1": "A lo largo de este semestre salió la convocatoria para poder participar en la Olimpiada Mexicana de Matemáticas. El Profesor Eduardo Guerrero Miranda, quien me dio Álgebra en el primer semestre de esta etapa ya me había aconsejado previamente en participar y cuando salió la convocatoria, uno de mis compañeros de Bachillerato Internacional, Horacio Fernando Sáenz Díaz estaba muy emocionado por participar e incluso nos invitó a participar en la olimpiada.",
    "lang-bi-s4-omm-2": "Pasamos el examen inicial hecho en febrero del 2017 y a partir de ahí había que asistir a unos cursos para prepararnos con temas más fuertes de matemáticas, entre los cuales estaba geometría donde se veían propiedades de los cuadriláteros cíclicos, teoría de números y divisibilidad que abarcaba ampliamente la aritmética modular, álgebra y cómo resolver problemas sin encontrar el valor de una incógnita en una ecuación, entre otros temas muy densos.",
    "lang-bi-s4-omm-3": "Además Horacio y yo logramos avanzar en otro examen hecho alrededor de mayo a una fase definitiva de pocos participantes para definir en agosto del 2017 el equipo que avanzaría al regional y luego al nacional. Tristemente yo no logré avanzar más allá después de esta etapa, sin embargo y afortunadamente, Horacio sí logró calificar para el regional.",
    "lang-bi-s4-omm-4": "Esta etapa de mi vida me dejó igualmente muchas amistades de la olimpiada, gente que sabe muchísimo de estos temas. Gustavo Meza, Tzoali Valdivia y Elías Loyola Campos quienes eran los que principalmente nos dirigieron en toda la preparación y amigos como Pedro, Lissette, Ricky y Juanito a quienes les tengo alta estima desde que los conocí.",
    "lang-bi-s4-omm-5": "Durante mi estancia en la 31° Olimpiada Mexicana de Matemáticas desarrollé apuntes de los nuevos temas que nos fueron enseñando los cuales se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/4/10-OMM.pdf\" target=\"_blank\">aquí</a> y a los que les guardo especial cariño.",
    "lang-bi-s5": "Quinto Semestre",
    "lang-bi-s5-quote": "Sin importar cuántas veces me golpeen, yo siempre encuentro la forma de levantarme - Peter Parker (Spider-Man: Into The Spider-Verse)",
    "lang-bi-s5-1": "Entramos al último año de la preparatoria, el penúltimo semestre del Bachillerato Internacional y las cosas se acercaban a su fin. Las evaluaciones externas ya se sentían cerca y los productos a entregar de las evaluaciones internas también se acercaban cada vez más.",
    "lang-bi-s5-2": "El estudio intensivo se incrementó mucho en este semestre, los tiempos para seguir estudiando, hacer prácticamente una investigación por materia, la Monografía, preparar el futuro universitario y los otros proyectos de evaluaciones internas que teníamos frente a nosotros eran mucho desafío para los pocos días que teníamos. Sin embargo, tratamos de apoyarnos entre todos y personalmente, con el rendimiento más alto de mi vida pero con las horas de sueño bajando cual montaña rusa en pleno arranque, muchos de los productos lograron salir en este semestre.",
    "lang-bi-s5-3": "Por si esto no fuera poco, algunos de los compañeros que pensaban usar el Diploma, tenían la limitante de que Estudios Matemáticos no entraba en los requisitos mínimos de aplicaciones en ciertas universidades, por lo que era necesario subir la evaluación a Matemáticas de Nivel Medio y para ello se necesitarían personas que aceptaran entrar en el desafío. Acepté entrar en este grupo y a finales de semestre inscribirme como parte de los aplicantes a Matemáticas Nivel Medio.",
    "lang-bi-s5-biol": "Biología 3",
    "lang-bi-s5-biol-1": "La continuidad del profesor Francisco Javier Acosta Collazo se mantuvo para mantener cierta constancia en el proceso que estábamos llevando y sus clases eran en esencia similares a las del semestre pasado.",
    "lang-bi-s5-biol-2": "En este semestre comenzamos las investigaciones individuales, que se evalúan como parte de las evaluaciones internas del Bachillerato Internacional donde comencé a desarrollar mi investigación basada en pruebas estadísticas sobre el impacto en el suelo del eucalipto y el mezquite. La culminación llegaría hasta el siguiente semestre.",
    "lang-bi-s5-biol-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/5/01-Biologia.pdf\" target=\"_blank\">aquí</a>. Son apuntes sucios y muy breves pero quizá con cierta utilidad.",
    "lang-bi-s5-chem": "Química 3",
    "lang-bi-s5-chem-1": "Fui de las personas que ante la opción de elegir presentar el Diploma con Química o con Artes, elegí la primera materia. Hubo nuevamente un cambio de docente en esta materia y esta vez, llegando la docente Guilda Guzmán Colis quien se incorporaba como nueva maestra al Programa del Diploma. Por esto muchos pensábamos que probablemente no conocería cómo se trabaja, no nos ayudaría tanto o podría ser más complicado el final de esta materia en el Bachillerato Internacional.",
    "lang-bi-s5-chem-2": "Sin embargo, ante muchas complicaciones que acarreábamos, la falta de prácticas de laboratorio hechas el semestre pasado y la constante confusión del previo semestre donde se veían temas que no correspondían y temas que sí eran importantes no revisábamos, la maestra hizo un excelente trabajo para cubrir un repaso de los aprendizajes previos y poner en orden los temas que sí deberíamos conocer, además de remontar las prácticas en este semestre, asesorarnos con el principio de la investigación individual y continuar con los temas que tocaban, ahora abordando las optativas empezando en este semestre con la optativa de Materiales.",
    "lang-bi-s5-chem-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/5/02-Quimica.pdf\" target=\"_blank\">aquí</a>. Son apuntes que considero puede tener cierta utilidad.",
    "lang-bi-s5-ingl": "Inglés 3",
    "lang-bi-s5-ingl-1": "Mantuvimos la continuidad con la maestra Isabel Fernández permaneciendo la misma forma de trabajo del semestre pasado y en esencia la misma dinámica de trabajo como en anteriores semestres. En este semestre leímos \"Animal Farm\" de George Orwell para prepararnos para algunas de las preguntas que se abordan en esta materia tanto en las Evaluaciones Internas como en las Evaluaciones Externas.",
    "lang-bi-s5-ingl-2": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/5/03-Ingles.pdf\" target=\"_blank\">aquí</a>. Son apuntes con mayormente actividades hechas en clase que con poco contexto quizá no sean de tanta utilidad.",
    "lang-bi-s5-tdc": "Teoría del Conocimiento 3",
    "lang-bi-s5-tdc-1": "La maestra Yéshica Chávez Murillo se mantuvo al frente de esta materia manteniendo la continuidad de la materia con la docente. Tristemente sería la última vez que tendría el cargo de esta materia debido a ciertas diferencias que la llevaron a salir al final de este semestre. La maestra nos guió a lo largo de la redacción definitiva de nuestros ensayos de Teoría del Conocimiento donde se debatía una pregunta de conocimiento con ciertas situaciones reales para llegar a una conclusión. Dentro de las preguntas que podíamos elegir, yo elegí trabajar con la siguiente afirmación:",
    "lang-bi-s5-tdc-2": "<i>\"Si bien los campos de estudio de las distintas disciplinas académicas pueden tener elementos en común, adoptar enfoques interdisciplinarios para la producción de conocimiento solo lleva a crear confusión\". Discuta esta afirmación.</i>",
    "lang-bi-s5-tdc-3": "La culminación de este producto llegaría hasta el próximo semestre.",
    "lang-bi-s5-tdc-4": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/5/04-TdC.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s5-lite": "Literatura 3",
    "lang-bi-s5-lite-1": "El profesor Lobo continuó al mando de la literatura que se nos impartía manteniendo la misma gran calidad en sus clases y aquí es donde yo creo que en general el grupo ya poseía más dominio en la interpretación que era mayormente del gusto del profesor, de modo que la dinámica comenzaba a agilizarse en la clase de literatura.",
    "lang-bi-s5-lite-2": "Para las evaluaciones también teníamos que analizar literatura con mayor cercanía a nuestra cultura, de modo que si ya se habían leído textos escritos en otro idioma, era momento de analizar textos escritos en el español. Los pilares más importantes de la lectura de este semestre que contarían para las evaluaciones serían \"Pedro Páramo\" de Juan Rulfo, \"Crónica de una Muerte Anunciada\" de Gabriel García Márquez y \"Aura\" de Carlos Fuentes, pero además leímos mucha más literatura para seguir practicando la interpretación de la misma forma en la que comenzamos a leer poemas, núcleo importante de lo que sería esta materia en el siguiente semestre.",
    "lang-bi-s5-lite-3": "El ensayo de literatura es otro producto que debe hacerse para las evaluaciones internas del Programa del Diploma, el cual yo lo hice centrándome en la figura de la protagonista y el reflejo que plasma en el metatexto que se presenta en la obra \"El Caballero Inexistente\" de Italo Calvino.",
    "lang-bi-s5-lite-4": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/5/05-Literatura.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s5-cas": "Creatividad, Acción y Servicio 3",
    "lang-bi-s5-cas-1": "La profesora Teresa de Jesús López Huerta continuó guiándonos en esta materia donde se retomaron los proyectos del tercer semestre. Nuevamente y junto con algunos amigos míos, volvimos a elegir un proyecto de Reforestación en distintas zonas del municipio de Aguascalientes que no estuvo nada mal, teniendo aprendizajes variados y experiencias muy gratificantes.",
    "lang-bi-s5-cas-2": "En este curso desarrollé muy pocos apuntes pero se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/5/06-CAS.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s5-mono": "Monografía 2",
    "lang-bi-s5-mono-1": "El semestre potente de la Monografía había llegado y aquí había que desarrollar lo mejor posible el proyecto. Después de las discusiones vacacionales con el Profesor Guillermo Cebreros Lira, comenzábamos a acotar una investigación donde se pudiera explicar matemáticamente dos escalas musicales, lo que al final se terminó convirtiendo en realizar alguna conversión matemática de una escala musical a otra y explicar esta conversión. El proceso fue muy largo y pesado y todo supervisado por la profesor Leticia Vázquez Méndez quien repetía como maestra encargada de supervisar este gran proyecto.",
    "lang-bi-s5-mono-2": "Al final del semestre se había conseguido tener un anteproyecto sólido que requeriría de ciertas afinaciones por realizarse en el próximo semestre y si todo salía bien, enviarla con buen tiempo para moverse a los demás proyectos pendientes del Bachillerato Internacional.",
    "lang-bi-s5-mono-3": "En este curso desarrollé muy pocos apuntes pero se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/5/07-Monografia.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s5-estu": "Estudios Matemáticos 3",
    "lang-bi-s5-estu-1": "Edgar Ahmed Muñoz Guzmán: El mejor profesor que me ha impartido clases.",
    "lang-bi-s5-estu-2": "El Profesor Ahmed mantuvo la excelente calidad de curso que ya nos había brindado el semestre pasado en este nuevo semestre siendo otro gran curso de matemáticas en el que pude estar. Durante este curso vimos distribuciones de probabilidad y entramos en el cálculo diferencial principalmente, así como el profesor nos empezó a comentar sobre empezar a desarrollar nuestra investigación de matemáticas.",
    "lang-bi-s5-estu-3": "Con el profesor también hablamos sobre la posibilidad de cambiar Estudios Matemáticos por Matemáticas Nivel Medio, siendo un debate complicado por la preparación que requería, la necesidad de hacerlo, la disponibilidad del profesor y muchos otros temas que estuvimos platicando con él.",
    "lang-bi-s5-estu-4": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/5/08-EM.pdf\" target=\"_blank\">aquí</a> los cuales considero de gran utilidad y a los que les guardo especial cariño.",
    "lang-bi-s5-hist": "Historia 3",
    "lang-bi-s5-hist-1": "Siendo el primer curso completo de la maestra Diana Altagracia Muñoz Cruz, muchas de las sensaciones del semestre anterior se reforzaban aquí. Realmente nos sentíamos un poco solos para presentar esta materia en la evaluaciones finales pasando de quizá ser una de las materias más \"sencillas\" dentro de las materias que se inscriben (por eso estratégicamente esta materia se elige generación tras generación como nivel superior) se convirtió en, al menos personalmente, otra de las materias que había que cargar muy fuertemente para llevar a buen puerto disminuyendo daños lo máximo posible.",
    "lang-bi-s5-hist-2": "En la materia terminamos de abordar los temas de historia mundial y comenzamos con la opción de Nivel Superior, en la cual elegimos la opción \"Historia de América\" revisando algunas de las guerras en sudamérica más importantes, ciertos conflictos en México con relevancia como la Revolución Mexicana, e incluso algunas manifestaciones del siglo XX que sucedieron en Estados Unidos. También comenzamos con la investigación individual de historia donde decidí investigar la importancia económica en Aguascalientes de la empresa J.M. Romo; producto que sería restructurado y finalizado en el siguiente semestre.",
    "lang-bi-s5-hist-3": "En este curso desarrollé muy pocos apuntes pero se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/5/09-Historia.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s6": "Sexto Semestre",
    "lang-bi-s6-quote": "Parte del viaje es el final - Tony Stark (Avengers: Endgame)",
    "lang-bi-s6-1": "Toda historia debe tener un final. Aquí, pese a que este semestre también engloba el clímax del Bachillerato Internacional, la finalización de los proyectos y la presentación de las evaluaciones externas (que es básicamente el momento más tenso del Programa del Diploma) también significaba el adiós a una gran etapa.",
    "lang-bi-s6-2": "Primero, académicamente hablando, este semestre guarda \"mi prime\", es decir, mi techo, mi mejor momento de rendimiento en todo sentido. Fue en este semestre donde menos horas de sueño llegué a promediar. Recuerdo que comenzó enero y hasta alrededor de abril sentía que muchas noches consistían en irme a dormir a las 3:00 de la mañana para levantarme a las 5:30 a clases a seguir repasando preparándonos para las ya muy cercanas evaluaciones finales. Sin embargo no me sentía tan cansado, quizá era la presión de todo lo que había que hacer que no me permitía a mí mismo tener sueño.",
    "lang-bi-s6-3": "Muchas cosas se siguieron haciendo en este semestre (la verdad no sé ni con qué energía) entre muchas innovaciones y proyectos que nunca habíamos hecho, así como empezar a pensar en nuestro futuro universitario. Todos mis amigos buscaron volar. Muchos sí volaron fuera del estado. Tuve varias oportunidades para irme principalmente con amigos a estudiar la licenciatura a Guanajuato, Guadalajara, Ciudad de México, Querétaro y Puebla. Finalmente me quedé en Aguascalientes pero el final de una era estaba llegando.",
    "lang-bi-s6-4": "Este semestre también supone la despedida de un entorno en el que todo encajaba armoniosamente. Los amigos que había hecho, la interacción y la amistad entre todos y era claro que desde lo que se construyó en el primer año de preparatoria, todo esto estaba terminando. Ver a mis amigos elegir sus carreras, terminar el Bachillerato Internacional, llegar al último día de clases que tuvimos en abril, despedirnos...",
    "lang-bi-s6-biol": "Biología 4",
    "lang-bi-s6-biol-1": "La continuidad del profesor Francisco Javier Acosta Collazo se mantuvo para mantener cierta constancia en el proceso que estábamos llevando y sus clases eran en esencia similares a las del semestre pasado.",
    "lang-bi-s6-biol-2": "En este semestre comenzamos a prepararnos arduamente para las evaluaciones externas y terminamos la investigación individual la cual al final sí estuvo basada en pruebas estadísticas sobre el impacto en el suelo del eucalipto y el mezquite. Leí algunos sitios como <a href=\"https://ibsurvival.com/topic/15431-publishing-your-extended-essay/\" target=\"_blank\">IB Survival</a> para conocer si podía adjuntar aquí mi investigación de biología y si no había ningún problema con la Organización del Bachillerato Internacional, aún cuando ya estoy graduado y con mi puntaje y dado que no lo sé, no la he adjuntado aquí aún.",
    "lang-bi-s6-biol-3": "Sin embargo, con estos productos, el profesor Paquito decidió abrir una editorial digital por parte de la Universidad Autónoma de Aguascalientes llamada <a href=\"https://revistas.uaa.mx/index.php/bi\" target=\"_blank\">BInvestigación</a> la cual inauguramos nosotros publicando artículos de las investigaciones que habíamos realizado para el Bachillerato Internacional publicándose el primer número con nuestros artículos un año después de habernos graduado, en marzo del 2019. Entre las que propuse está mi investigación de biología que puede consultarse <a href=\"https://revistas.uaa.mx/index.php/bi/issue/view/221\" target=\"_blank\">aquí</a> la cual lleva el título: <a href=\"https://revistas.uaa.mx/index.php/bi/article/view/1814/1729\" target=\"_blank\"><i>\"Diferencia de humedad en el suelo entre el Eucaliptus globulus y el Prosopis glandulosa en diferentes zonas de Aguascalientes\"</i></a>",
    "lang-bi-s6-biol-4": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/6/01-Biologia.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s6-chem": "Química 4",
    "lang-bi-s6-chem-1": "La maestra Guilda Guzmán Colis cerró con nosotros este proceso del Bachillerato Internacional asesorándonos también en este último semestre con quien se mantuvo la buena calidad de las clases y del aprendizaje. Aquí hicimos un repaso de todos los conocimientos además de revisar otra optativa la cual se trataba de \"Química Medicinal\" y lo que culminó nuestra preparación para los exámenes del Diploma.",
    "lang-bi-s6-chem-2": "En este semestre comenzamos a prepararnos para las evaluaciones externas y realizamos la investigación individual que consistió en realizar experimentalmente la prueba de una celda electroquímica mostrando la actividad de las dos semiecuaciones químicas involucradas en la demostración. Leí algunos sitios como <a href=\"https://ibsurvival.com/topic/15431-publishing-your-extended-essay/\" target=\"_blank\">IB Survival</a> para conocer si podía adjuntar aquí mi investigación de química y si no había ningún problema con la Organización del Bachillerato Internacional, aún cuando ya estoy graduado y con mi puntaje y dado que no lo sé, no la he adjuntado aquí aún.",
    "lang-bi-s6-chem-3": "Entre los artículos que propuse para publicarse en la editorial digital <a href=\"https://revistas.uaa.mx/index.php/bi\" target=\"_blank\">BInvestigación</a> estaba mi investigación de química la cual no terminó por ser una de las elegidas entre las que se fueran a publicar pero que el borrador puede consultarse <a href=\"01-Apuntes/03-BachilleratoInternacional/6/13-ArticuloCientificoQuimica.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s6-chem-4": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/6/02-Quimica.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s6-ingl": "Inglés 4",
    "lang-bi-s6-ingl-1": "Mantuvimos la continuidad con la maestra Isabel Fernández permaneciendo la misma forma de trabajo del semestre pasado y en esencia la misma dinámica de trabajo como en anteriores semestres. En este semestre leímos cuentos de Isaac Asimov para prepararnos para algunas de las preguntas que se abordan principalmente en las Evaluaciones Externas.",
    "lang-bi-s6-ingl-2": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/6/03-Ingles.pdf\" target=\"_blank\">aquí</a>. Son apuntes con mayormente actividades hechas en clase que con poco contexto quizá no sean de tanta utilidad.",
    "lang-bi-s6-mono": "Monografía 3",
    "lang-bi-s6-mono-1": "Finalizamos el proceso de la Monografía apoyados por la maestra Leticia Vázquez Méndez y personalmente, asesorado para redactarla y liberarla por el Profesor Guillermo Cebreros Lira, realizando una Monografía de Estudios del Mundo Contemporáneo involucrando las áreas de Matemáticas y Música realizando una conversión matemática de una escala musical a otra y explicar esta conversión. El proceso fue muy largo y pesado pero lo logramos terminar a mediados de febrero para que todos pusideramos exponer nuestras Monografías frente al grupo y familiares invitados.",
    "lang-bi-s6-mono-2": "Al final del semestre se había conseguido tener un anteproyecto sólido que requeriría de ciertas afinaciones por realizarse en el próximo semestre y si todo salía bien, enviarla con buen tiempo para moverse a los demás proyectos pendientes del Bachillerato Internacional.",
    "lang-bi-s6-mono-3": "Leí algunos sitios como <a href=\"https://ibsurvival.com/topic/15431-publishing-your-extended-essay/\" target=\"_blank\">IB Survival</a> para conocer si podía adjuntar aquí mi Monografía y si no había ningún problema con la Organización del Bachillerato Internacional, aún cuando ya estoy graduado y con mi puntaje y dado que no lo sé, no la he adjuntado aquí aún.",
    "lang-bi-s6-mono-4": "En este curso desarrollé muy pocos apuntes pero se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/6/04-Monografia.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s6-tdc": "Teoría del Conocimiento 4",
    "lang-bi-s6-tdc-1": "Tras la problemática el semestre pasado, los ánimos se cayeron mucho, pero el show debía continuar. El profesor Rodrigo Antonio Ramírez Roa llegó a ayudarnos a terminar la materia, aunque en sesiones fuera del salón de clases, la maestra Yéshica Chávez Murillo nos seguía apoyando y retroalimentando para lograr culminar con el ensayo, el cual logró terminarse en tiempo y forma a mediados de este curso.",
    "lang-bi-s6-tdc-2": "En este curso desarrollé muy pocos apuntes pero se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/6/05-TdC.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s6-lite": "Literatura 4",
    "lang-bi-s6-lite-1": "El profesor Lobo terminó este proceso manteniendo la misma gran calidad en sus clases dando un gran final a las sesiones que tuvimos en este periodo de dos años en el programa.",
    "lang-bi-s6-lite-2": "Para las evaluaciones también teníamos que analizar poesía por lo que principalmente este semestre lo dedicamos a la interpretación de poemas de Alfonsina Storni, Mario Benedetti y Octavio Paz y con el ensayo de literatura finalizado, esta era una de las materias más sólidas en cuanto a preparación para las evaluaciones.",
    "lang-bi-s6-lite-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/6/06-Literatura.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s6-cas": "Creatividad, Acción y Servicio 4",
    "lang-bi-s6-cas-1": "Terminamos el proceso con la profesora Teresa de Jesús López Huerta donde se retomaron los proyectos de semestres anteriores pero ahora con la limitante para algunos de no poder elegir tres veces el mismo proyecto, es decir, yo ya no podía elegir Reforestación nuevamente. Fue así que, junto a unos amigos, me embarqué en un proyecto para ayudar una asociación que atendía niños y adultos con cáncer, la cual fue una experiencia muy bonita.",
    "lang-bi-s6-cas-2": "En este curso desarrollé muy pocos apuntes pero se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/6/07-CAS.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s6-estu": "Estudios Matemáticos 4",
    "lang-bi-s6-estu-1": "Edgar Ahmed Muñoz Guzmán: El mejor profesor que me ha impartido clases.",
    "lang-bi-s6-estu-2": "El Profesor Ahmed cerró el proceso de matemáticas del programa manteniendo la excelente calidad hasta el final. Cabe aclarar que a este curso todavía asistí pero era el curso orientado a las evaluaciones de la materia \"Estudios Matemáticos\", en otra sección destaco la preparación para Matemáticas Nivel Medio. En esta clase se repasaron los temas de anteriores semestres y con tiempo libre, el profesor Ahmed nos dio algunas guías de temas extra de matemáticas para los exámenes de admisión a las universidades, lo cual fue de gran ayuda.",
    "lang-bi-s6-estu-3": "Aunque el profesor no disponía del tiempo para enseñarnos Matemáticas Nivel Medio a los que nos cambiamos de materia, él nos estuvo ayudando en las investigaciones de matemáticas, asesorándonos con los exámenes y buscando material que nosotros pudiéramos aprender para que nos fuera mejor en las evaluaciones finales. Es así que también me apoyó personalmente en mi investigación de matemáticas la cual consistió en realizar una exploración por medio de la combinatoria, modelando el problema: ¿cuál sería la contraseña más segura de un teléfono celular entre el patrón, el PIN y la contraseña de texto?",
    "lang-bi-s6-estu-4": "Leí algunos sitios como <a href=\"https://ibsurvival.com/topic/15431-publishing-your-extended-essay/\" target=\"_blank\">IB Survival</a> para conocer si podía adjuntar aquí mi investigación de matemáticas y si no había ningún problema con la Organización del Bachillerato Internacional, aún cuando ya estoy graduado y con mi puntaje y dado que no lo sé, no la he adjuntado aquí aún. Sin embargo adjunto algunos borradores de la propuesta de combinatoria de los tres problemas, pues el patrón fue lo más complicado de modelar a nivel de combinatoria que puede consultarse <a href=\"01-Apuntes/03-BachilleratoInternacional/6/11-MateNM-IA.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s6-estu-5": "Entre los artículos que propuse para publicarse en la editorial digital <a href=\"https://revistas.uaa.mx/index.php/bi\" target=\"_blank\">BInvestigación</a> estaba mi investigación de matemáticas la cual no terminó por ser una de las elegidas entre las que se fueran a publicar pero que el borrador puede consultarse <a href=\"01-Apuntes/03-BachilleratoInternacional/6/14-ArticuloCientificoMatematicas.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s6-estu-6": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/6/08-EM.pdf\" target=\"_blank\">aquí</a> los cuales considero de gran utilidad y a los que les guardo especial cariño.",
    "lang-bi-s6-hist": "Historia 4",
    "lang-bi-s6-hist-1": "La preparación de historia la terminamos con la maestra Diana Altagracia Muñoz Cruz, siendo un repaso a todo lo visto con las sensaciones de semestres anteriores.",
    "lang-bi-s6-hist-2": "Este semestre se terminó la investigación de historia que terminó por cambiar a ser una investigación guiada a revisar la importancia económica en Aguascalientes de la empresa Maquinaria Triunfo.",
    "lang-bi-s6-hist-3": "Leí algunos sitios como <a href=\"https://ibsurvival.com/topic/15431-publishing-your-extended-essay/\" target=\"_blank\">IB Survival</a> para conocer si podía adjuntar aquí mi investigación de historia y si no había ningún problema con la Organización del Bachillerato Internacional, aún cuando ya estoy graduado y con mi puntaje y dado que no lo sé, no la he adjuntado aquí aún.",
    "lang-bi-s6-hist-4": "En este curso desarrollé muy pocos apuntes pero se pueden consultar <a href=\"01-Apuntes/03-BachilleratoInternacional/6/09-Historia.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi-s6-mate": "Matemáticas Nivel Medio",
    "lang-bi-s6-mate-1": "Como mencioné en la sección de Estudios Matemáticos de este semestre, el profesor Ahmed no disponía de tiempo para prepararnos para este cambio de exámenes, por lo que, podría ayudarnos en las investigaciones y asesoramiento particular, pero el grueso de la materia debía ser revisado individualmente por nosotros.",
    "lang-bi-s6-mate-2": "Es así como nace la creación de la cual estoy más orgulloso: <a href=\"01-Apuntes/03-BachilleratoInternacional/6/10-MateNM.pdf\" target=\"_blank\">mis apuntes de Matemáticas Nivel Medio</a>. Todo el Bachillerato Internacional se destaca por ser un aprendizaje muy autodidacta y muy propio, sin embargo, no hubo otra materia en la que tuviéramos que estar a este nivel de investigación y aprendizaje propio como lo fue en matemáticas a menos de cinco meses de presentar las evaluaciones finales del Programa del Diploma.",
    "lang-bi-s6-mate-3": "Comencé a estudiar para esta nueva modalidad de matemáticas desde que salimos de vacaciones de quinto semestre. Con ayuda del libro de Matemáticas Nivel Medio del Bachillerato Internacional me dividí los temas y me los repartí en una agenda que parecía casi imposible de cumplir para mí siendo seis unidades las que habían que cubrirse además de desarrollar la investigación y repasar tanto para esta materia como para las demás.",
    "lang-bi-s6-mate-4": "Es principalmente gracias a esta materia, la razón de mis desvelos en esta temporada, pues apenas usaba mi tiempo del día para todos los pendientes de las demás materias y cuando me daba ya la medianoche era cuando finalmente podía despejar mis pendientes para avanzar con esta materia que considero como un éxito al ver el nivel de capacidad autodidacta que tomé gracias a esta experiencia, la forma en la que encontré cómo aprendía y el aprender tantas cosas es siempre especial volver a ver mis apuntes de esta preparación.",
    "lang-bi-s6-fisi": "Física: Admisión UAA",
    "lang-bi-s6-fisi-1": "Para estudiar la licenciatura, apliqué para la carrera de Ingeniería en Computación Inteligente en la Universidad Autónoma de Aguascalientes la cual en su examen de admisión evaluarían conocimientos avanzados de matemáticas y física.",
    "lang-bi-s6-fisi-2": "El examen de admisión donde estaban estos conocimientos más especializados se daría el día sábado 19 de mayo del 2018 y las evaluaciones externas finalizaban el jueves 17 de mayo. Desde abril ya tenía la mente también ocupada en repasar Física sobre todo (pues mi estrategia fue pensar que con lo que sabía por Matemáticas Nivel Medio bastaba) ya que si me ponía a hacer números, nosotros apenas y llevamos dos cursos de física y seguro hubo gente que le anduvo dedicando mínimo 150 horas a aprender física únicamente en el salón, sin contar estudio fuera de clases.",
    "lang-bi-s6-fisi-3": "Es así que yo estaba estudiando por mi cuenta, quizá de una forma un poco desorganizada. No fue hasta que volví a ver al Profesor Ahmed, quien al verme nervioso le comenté mi preocupación por no sentirme preparado para este examen de admisión. Además de ser el mejor docente que me haya impartido clases, al profesor Ahmed le debo infinitamente mi admisión a la carrera pues él me apoyó con una guía de estudio y ejercicios de repaso que él prepara normalmente como asesoría para estos exámenes.",
    "lang-bi-s6-fisi-4": "No pude dedicar mucho tiempo a repasar con este material mientras seguíamos en evaluaciones externas, pues los exámenes eran muy agotadores. Fue hasta el jueves 17 de mayo, cuando veía a la gran mayoría de mis amigos festejar, sentir ese \"peso menos\", irse a celebrar que todo el esfuerzo había terminado, que yo sólo tuve que irme a casa, seguir repasando, usar todo lo que disponía de jueves, todo lo que disponía de viernes e incluso las horas antes del examen que disponía para repasar elaborando <a href=\"01-Apuntes/03-BachilleratoInternacional/6/15-Fisica-Admision-UAA.pdf\" target=\"_blank\">mis apuntes de repaso de física para el examen de admisión</a> con los que estudié arduamente para el examen y con los que finalmente, terminando ese examen, caí rendido con mi mejor descanso en mucho tiempo. Finalmente había podido ver el amanecer de un universo en paz.",
    "lang-lic": "Licenciatura",
    "lang-lic-1": "Resumir cinco años de estudios y experiencias en estos párrafos es complicado. A nivel emocional comencé la etapa mal, con muchas cosas que acarreaba para mal en el inicio de la etapa y poco a poco fue mejorándose esta situación. A nivel de motivación comencé con muchas fuerzas pero llegando a la mitad de la carrera se me cayeron las ganas por la carrera debido a cómo, en mi opinión, cambió la dinámica de clases tras el gran suceso que nos ocurrió en esta etapa, que fue la pandemia originada por el COVID-19.",
    "lang-lic-2": "Sin embargo, el aprendizaje que me llevo de ciertas materias fue grande, hay muchas experiencias de aquí que atesoraré con gusto y sin duda los amigos que hice en esta etapa los atesoro con mucho afecto, me ayudaron a tener uno de los desarrollos de personaje más importantes de mi vida y son personas que espero llevarme para muchas más experiencias futuras.",
    "lang-lic-3": "Estudié la carrera de Ingeniería en Computación Inteligente en la <a href=\"https://www.uaa.mx/portal/\" target=\"_blank\">Universidad Autónoma de Aguascalientes</a> desde julio del 2018 hasta junio del 2023 con un rendimiento tal vez alto y con experiencias como varias participaciones en los eventos de ICPC. Tengo un repositorio de código que desarrollé en la carrera el cual puede consultarse <a href=\"https://github.com/Joul24py/UAA-ICI\" target=\"_blank\">aquí</a>.",
    "lang-lic-cp": "Cursos Propedéuticos",
    "lang-lic-cp-quote": "Hace mucho tiempo en una galaxia muy muy lejana... - Star Wars",
    "lang-lic-cp-1": "Este es el inicio de una nueva era, una nueva etapa, una nueva saga. La historia es muy diferente a la etapa anterior. Comenzar esta etapa me fue complicado y los primeros semestres fueron prueba de ello, sobre todo socialmente hablando, sin embargo, llegué a la carrera muy motivado con dar el 100% de mí y esforzarme todo lo posible por seguir creciendo y aprendiendo. Es así que inicié con mucha energía la carrera, dando todo de mí, dejando la mayor energía en este largo sprint de cinco años...",
    "lang-lic-cp-mate": "Propedéutico de Matemáticas",
    "lang-lic-cp-mate-1": "Para regularizarnos en las dos áreas más importantes de la carrera, nos dieron unos propedéuticos. El primero fue de matemáticas, impartido por el docente Juan Manuel Pérez Rosales, also known as Juan Pérez. El profesor es un profesor que se ve que sabe muchísimo muchísimo de matemáticas, la forma en la que te cuenta las matemáticas es increíble. El propedéutico para mí se me hizo impactante. Nos contó la construcción de las matemáticas partiendo de los números y las operaciones primitivas, el 0 y el 1, la suma y la multiplicación. A partir de ahí nos construyó todo lo que hoy conocemos de matemáticas. Fue un buen curso para darnos una pasadita de las matemáticas que debíamos saber y las que veríamos en semestres posteriores.",
    "lang-lic-cp-mate-2": "Mis apuntes a este propedéutico pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/00/01-Matematicas.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-cp-prog": "Propedéutico de Programación",
    "lang-lic-cp-prog-1": "De igual forma se nos buscó regularizar en programación pues muchos de nosotros no habíamos programado nunca en nuestra vida como era mi caso. El propedéutico fue impartido a la mitad del grupo por el profesor Alejandro Padilla Díaz y a la otra mitad por el profesor Miguel Ángel Meza de Luna. A mí me tocó en el segundo grupo con el profesor Miguel Ángel Meza de Luna.",
    "lang-lic-cp-prog-2": "El propedéutico impartido por el profesor Miguel Ángel Meza de Luna me pareció excelente. Me parecieron las mejores bases usando pseudocódigo con PseInt para aprender las estructuras básicas de la programación. Yo con eso sí sentía que podrían ser mis bases mínimas para defenderme a lo largo de la carrera y prácticamente así fue. Además de que la actitud del profesor ayuda mucho por su proactividad, su curso me pareció excelente como introducción desde el lado de la programación.",
    "lang-lic-cp-prog-3": "Mis apuntes de este propedéutico pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/00/02-Programacion.pdf\" target=\"_blank\">aquí</a>. De igual forma, los ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/01-PC-P-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-cp-prac": "Prácticas de Pares",
    "lang-lic-cp-prac-1": "Las prácticas de pares fueron otra clase de los propedéuticos que las impartían algunos de nuestros compañeros de semestres más avanzados, pero ellos ya nos introducían a un lenguaje de programación. La sintaxis me chocaba, no entendía los problemas y se me hizo un lío el cerebro con las explicaciones. A muchos les gustaron, a mí no, yo me sentía muy chiquito y muy tonto. Me gustaba más cuando los chicos sacaban retas de Smash o Rocket League pero en términos de la enseñanza de este propedéutico, yo me perdí mucho.",
    "lang-lic-cp-prac-2": "Por ello mismo no hice apuntes de este curso propedéutico.",
    "lang-lic-s1": "Primer Semestre",
    "lang-lic-s1-quote": "Los jóvenes no siempre son comprendidos - Star Wars: The Clone Wars (Temporada 5 Episodio 7: Una prueba de fuerza)",
    "lang-lic-s1-1": "Con mucha determinación como lo somos los recién llegados, salimos al primer semestre de la carrera. Con unos pocos conocidos que había hecho en los propedéuticos, estábamos intentando mantenernos juntos para que nos fuera bien a lo largo de la carrera teniendo grandes ambiciones dentro y fuera del aula de clases. Muchas ganas en las clases, mucho esfuerzo en proyectos extracurriculares como con algunos amigos que logré convencer para inscribirnos a eventos de programación competitiva del <a href=\"https://icpc.global/\" target=\"_blank\">ICPC: International Collegiate Programming Contest</a> o concursos para desarrollar software, aprender mucho y crecer lo mejor posible.",
    "lang-lic-s1-2": "En este semestre también seguí aumentando, aunque poco, el círculo de amistades que tendría en la carrera.",
    "lang-lic-s1-cd": "Cálculo Diferencial",
    "lang-lic-s1-cd-1": "Impartido por la maestra Irma Acero Díaz, creo que fue un curso regular, es una maestra que hace bien su trabajo, trata de enseñar lo mejor posible, pese a ciertos problemas en el salón, por lo que considero que pudo complicársenos su materia.",
    "lang-lic-s1-cd-2": "Los apuntes que hice para esta materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/01/01-CD.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s1-as": "Álgebra Superior",
    "lang-lic-s1-as-1": "Volvimos a ver al docente Juan Manuel Pérez Rosales en esta materia y definitivamente volvió a ser un viaje muy denso por el mundo del álgebra. La verdad sí era costoso seguirle el ritmo pero a mí me gustó su materia, aprendí mucho y la disfruté así como sentí que aproveché sus conocimientos de buena forma.",
    "lang-lic-s1-as-2": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/01/02-AS.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s1-lc1": "Lenguajes de Computación I",
    "lang-lic-s1-lc1-1": "Para tomar esta materia se dividió al grupo en dos; una mitad sería instruida por el profesor Alejandro Padilla Díaz y otra mitad por la maestra Rosalinda Avendaño López.",
    "lang-lic-s1-lc1-2": "La maestra Rosalinda Avendaño López fue quien me impartió esta materia y he de decir que es, para mí, de los mejores cinco docentes que me impartió clases mientras estuve en la carrera. Me llevo buenas enseñanzas de su materia donde solidificamos los conocimientos vistos en el propedéutico de programación viendo todas estas estructuras y llevándolas a la aplicación en el lenguaje de programación C.",
    "lang-lic-s1-lc1-3": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/01/03-LC1.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/02-S1-LC1-ClassExercises\" target=\"_blank\">aquí</a> así como el proyecto final de su materia, el cual se encuentra <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/03-S1-LC1-FinalProject\" target=\"_blank\">aquí</a>.",
    "lang-lic-s1-fec": "Fundamentos de Estructuras Computacionales",
    "lang-lic-s1-fec-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/01/04-FEC.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/04-S1-FEC-GraphExercise\" target=\"_blank\">aquí</a> así como el proyecto final de su materia, el cual se encuentra <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/05-S1-FEC-FinalProject\" target=\"_blank\">aquí</a>.",
    "lang-lic-s1-cb": "Contabilidad Básica",
    "lang-lic-s1-cb-1": "El profesor que nos impartió esta materia fue el docente Cuauhtémoc Torres Cruz y realmente nos enseñó mucho sobre el conocimiento de la contabilidad, la elaboración de un estado financiero, balance general, cálculo de ciertos impuestos como el I.V.A. o estados de resultados.",
    "lang-lic-s1-cb-2": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/01/05-CB.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s1-auto": "Autoestudio",
    "lang-lic-s1-auto-1": "Entre toda la energía que traía junto con mis amigos en los primeros semestres, buscando meter toda la energía, buscamos estudiar por nuestra parte algunas de las materias, ya sea para reforzar conocimientos o para llegar preparados para futuras materias.",
    "lang-lic-s1-auto-2": "En septiembre del 2018 comencé unos apuntes de cálculo diferencial basándome en un libro de la Editorial Patria los cuales concluí poco antes del final del semestre que me sirvieron como repaso para los exámanes de la respectiva materia del semestre. Estos apuntes pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/01/06-CalculoDiferencial.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s1-auto-3": "En septiembre del 2018 comencé unos apuntes de álgebra superior basándome en un libro de la Editorial Limusa los cuales no concluí aunque me sirvieron como repaso. Estos apuntes pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/01/07-AlgebraSuperior.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s1-auto-4": "En octubre del 2018 comencé unos apuntes de contabilidad basándome en un libro de la Editorial Patria los cuales no concluí. Estos apuntes pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/01/08-ContabilidadBasica.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s1-auto-5": "En noviembre del 2018 comencé unos apuntes de cálculo integral basándome en un libro de la Editorial Patria los cuales concluí en febrero del 2019 prácticamente iniciando el curso de cálculo integral de la carrera, por lo que había llegado muy preparado a dicho curso. Estos apuntes pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/01/09-CalculoIntegral.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s1-auto-6": "En diciembre del 2018 comencé unos apuntes de álgebra lineal basándome en un libro de la Editorial McGraw Hill los cuales no concluí por centrarme en terminar los de cálculo integral y que \"retomaría posteriormente\". Estos apuntes pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/01/10-AlgebraLineal.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s1-auto-7": "En diciembre del 2018 comencé unos apuntes de estadística y probabilidad basándome en un libro de la Editorial Pearson los cuales no concluí por centrarme en terminar los de cálculo integral y que \"retomaría posteriormente\". Estos apuntes pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/01/11-EstadisticaYProbabilidad.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s2": "Segundo Semestre",
    "lang-lic-s2-quote": "Un gran estudiante es lo que el maestro aspira ser - Star Wars: The Clone Wars (Temporada 3 Episodio 22: La caza del wookiee)",
    "lang-lic-s2-1": "En este semestre, mi grupo social creció un poco más. Además también, comencé a ayudar a algunas personas que se les dificultaban ciertas materias y comenzábamos a reunirnos para explicarles estos temas y salir bien en los exámenes. Así hacíamos un grupo para apoyarnos y que nos fuera bien en la carrera.",
    "lang-lic-s2-2": "Algunos planes habían sido pausados como los eventos de <a href=\"https://icpc.global/\" target=\"_blank\">ICPC</a> que volverían a retomarse en este semestre con un equipo renovado y reconfigurado de modo que los planes aún estaban por buen camino.",
    "lang-lic-s2-ci": "Cálculo Integral",
    "lang-lic-s2-ci-1": "Siendo alumnos del maestro Jaime Trujillo Domínguez tuvimos la clase de cálculo integral, la cual yo disfruté mucho por la rigurosidad en la que él planteaba los problemas y que con la misma él esperaba que la resolviéramos. Yo soy consciente que era el único raro al que le gustaba esto, pues a todos los demás les molestaba este hecho, sin embargo me parecía importante cuestionarnos de la forma en la que lo hacíamos cómo surgían muchas cosas en el cálculo integral como fue en este curso. Para mí bastaba este curso para también tener al profesor como uno de los mejores de la carrera en mi opinión.",
    "lang-lic-s2-ci-2": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/02/01-CI-Apuntes.pdf\" target=\"_blank\">aquí</a>. Además el profesor pedía que separemos en un cuaderno distinto los ejercicios de tarea, los cuales pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/02/02-CI-Ejercicios.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s2-lc2": "Lenguajes de Computación II",
    "lang-lic-s2-lc2-1": "Para esta materia nos dividieron en dos grupos; un grupo sería instruido por el profesor Francisco Javier Luna Rosas y otro por la maestra Rosalinda Avendaño López. Yo estuve en el grupo que sería asesorado por la maestra Rosalinda Avendaño López. Nuevamente pienso que la maestra hizo un gran trabajo explicándonos la programación orientada a objetos y sus aplicaciones en C#.",
    "lang-lic-s2-lc2-2": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/02/03-LC2.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/06-S2-LC2-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s2-ec": "Estruturas Computacionales",
    "lang-lic-s2-ec-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/02/04-EC.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/07-S2-EC-ClassExercises\" target=\"_blank\">aquí</a> así como el proyecto final de su materia, el cual se encuentra <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/08-S2-EC-FinalProject\" target=\"_blank\">aquí</a>.",
    "lang-lic-s2-eg": "Economía General",
    "lang-lic-s2-eg-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/02/05-EG.pdf\" target=\"_blank\">aquí</a>. De igual forma, desarrollamos un programa en clase para graficar las ecuaciones de la oferta y demanda que puede consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/09-S2-EG-FirstUnitProject\" target=\"_blank\">aquí</a>.",
    "lang-lic-s2-ld": "Lógica Digital",
    "lang-lic-s2-ld-1": "Impartida por el docente Arturo González León, fue una materia muy peculiar. Esta materia era la última clase del día y el profesor lograba transmitir todo el conocimiento que quería para una sesión de clase en veinte minutos. Sorprendentemente lograba dar una buena clase con veinte minutos diarios de sesión. En su materia vimos desde las bases como diferenciar sistemas analógicos y digitales hasta preliminares de autómatas. Fue una clase fuera de lo común pero una muy buena clase.",
    "lang-lic-s2-ld-2": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/02/06-LD.pdf\" target=\"_blank\">aquí en su forma en sucio</a> así como pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/02/07-LD-Formal.pdf\" target=\"_blank\">aquí en su forma en limpio</a> pues elaboramos diagramas muy bonitos que creo que con apuntes más limpios destacaban y le entendía a mis apuntes mejor.",
    "lang-lic-s3": "Tercer Semestre",
    "lang-lic-s3-quote": "Enseñar es un privilegio y es parte de la responsabilidad de un Jedi entrenar a la siguiente generación - Obi-Wan Kenobi (Star Wars: The Clone Wars)",
    "lang-lic-s3-1": "En tercer semestre, el grupo de apoyo alcanzó su máximo teniendo varios compañeros que también realizaban labores de apoyo en distintas materias. Socialmente hablando lograba recuperarme finalmente del mal inicio que tuve en esta etapa y aquí fue donde más se incrementó mi grupo social de la carrera.",
    "lang-lic-s3-2": "Personalmente creo que este fue el semestre más difícil o probablemente el segundo más difícil de todos. El estudio aquí sí estuvo pesado, las materias también y cubrir todo esto realmente fue una carga muy complicada pero con los grupos de estudio de apoyo que habíamos formado teníamos respaldo en hasta tres de las seis materias de este semestre, yo principalmente enfocado en asesorar para álgebra lineal, pero le entraba al quite en cualquiera de las seis materias de este semestre.",
    "lang-lic-s3-eca": "Estructuras Computacionales Avanzadas",
    "lang-lic-s3-eca-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/03/01-ECA.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/10-S3-ECA-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s3-lc3": "Lenguajes de Computación III",
    "lang-lic-s3-lc3-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/03/02-LC3.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/11-S3-LC3-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s3-rb": "Redacción Básica",
    "lang-lic-s3-rb-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/03/03-RB.pdf\" target=\"_blank\">aquí</a>. Además nos pidió desarrollar un glosario el cual puede consultarse <a href=\"01-Apuntes/04-Licenciatura/03/04-RB-Glosario.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s3-ia": "Inteligencia Artificial",
    "lang-lic-s3-ia-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/03/05-IA.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/12-S3-IA-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s3-al": "Álgebra Lineal",
    "lang-lic-s3-al-1": "Es gracias a esta materia que el profesor Jaime Trujillo Domínguez se alzó como uno de los mejores profesores que me han impartido clase y yo creo que está, para mí, entre los dos mejores profesores que me impartieron clase en la carrera.",
    "lang-lic-s3-al-2": "Desde que empezamos nos dijo el profesor que debíamos ponernos las pilas porque no íbamos a acabar el programa de lo exigente que era. Es así que el profesor nos mandaba la teoría a leerla y pasarla en limpio en casa para que en clase sólo hiciéramos ejercicios. Esto hacía algo autodidacta el aprendizaje y como realmente a mí me gustaría tener muchas materias sobre todo las más teóricas, que es lee en casa, resuelve las dudas en clase. Así que personalmente a mí me gustó mucho esta materia. Era muy muy pesada pero el profesor mostraba un dominio amplio por los temas del álgebra lineal además que se notaba lo que él nos decía de haber preparado tanto la clase desde las vacaciones previas a estas clases. Incluso nos ayudó mucho dándonos muchas asesorías extra clase en otros horarios incluso en semanas extemporáneas.",
    "lang-lic-s3-al-3": "Entre los dos cursos que impartió el profesor, creo que mi favorito fue éste. El hecho de leer la teoría en casa para llegar a clases a hacer ejercicios fue algo propuesto por el docente tratando de cumplir con el programa de la materia y que en mi opinión, esto deben hacer todas las materias con su teoría. Sé que a muchos compañeros les disgustaba esto, sin embargo de esta forma sentía cómo aprovechábamos el tiempo en casa y el tiempo en clase. No desperdiciábamos ni un segundo. Realmente este hecho me pareció uno de los más acertados de los cinco años de la carrera.",
    "lang-lic-s3-al-4": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/03/06-AL-Apuntes.pdf\" target=\"_blank\">aquí</a>. Además el profesor pedía que separemos en un cuaderno distinto los ejercicios de tarea, los cuales pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/03/07-AL-Ejercicios.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s3-edp": "Estadística Descriptiva y Probabilidad",
    "lang-lic-s3-edp-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/03/08-EDP.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s4": "Cuarto Semestre",
    "lang-lic-s4-quote": "Los grandes líderes inspiran grandeza en los demás - Star Wars: The Clone Wars (Temporada 1 Episodio 1: Emboscada)",
    "lang-lic-s4-1": "El buen paso comenzó a tambalearse en este semestre. Este semestre es el que cursamos en la primera mitad del 2020, es decir, es en este semestre donde nos vamos a clases virtuales por la pandemia del COVID-19. Clases presenciales tuvimos desde el inicio del semestre en enero hasta el muy recordado por mí viernes 13 de marzo del 2020.",
    "lang-lic-s4-2": "Nadie sabía qué hacer al respecto, la universidad se tomó unas semanas para pensar de modo que no estábamos haciendo nada a nivel escolar hasta los últimos días de abril, donde se retomaron las actividades con las distintas consideraciones de cada profesor, algunos por Microsoft Teams, otros por Google Meet, otros por Zoom y otros por distintas plataformas. Este atraso causó que termináramos el semestre casi en julio.",
    "lang-lic-s4-3": "El final del semestre me dejó un mal sabor de boca en cuanto a rendimiento así como a nivel social, las cosas comenzaban a complicarse a partir de este semestre. Sentía que ya no conseguía resultados con la misma facilidad que en los primeros semestres y al hablarlo con mi entorno cercano, me comenzaron a llevar en la universidad a puntos que no había pensado, pues durante toda mi estancia universitaria conseguía buenos resultados pero sin luchar principalmente por ellos, sino principalmente por el conocimiento y dejando que como objetivo secundario vinieran los resultados en cuanto a números y fue al final de este semestre cuando este entorno cercano me llevó a darle más importancia a las calificaciones que al conocimiento...",
    "lang-lic-s4-m": "Mecánica",
    "lang-lic-s4-m-1": "Instruidos por la maestra Mariana Alfaro Gómez, creo que tuvimos un buen curso de Mecánica. Revisamos los temas del curso de forma agradable, la maestra explicaba bien e íbamos avanzando adecuadamente en la materia hasta que cayó la pandemia.",
    "lang-lic-s4-m-2": "Sorprendentemente, la maestra fue de las que, creo, mejor se adaptó para terminar el semestre adecuadamente. Nos dejó ejercicios y opcionalmente podíamos unirnos a sesiones de Microsoft Teams en caso de haber dudas. Para este punto, la universidad todavía no había metido muchas restricciones por clase obligatoria, toma de asistencia u otras medidas, pues eran los primeros tres meses de pandemia, de modo que creo que esto también apoyó a tener este final de semestre agradable y que tuvo una dinámica inesperada pero ante el mal tiempo hubo una buena adaptación.",
    "lang-lic-s4-m-3": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/04/01-M.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s4-lc4": "Lenguajes de Computación IV",
    "lang-lic-s4-lc4-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/04/02-LC4.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/13-S4-LC4-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s4-pc": "Programación Científica",
    "lang-lic-s4-pc-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/04/03-PC.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/14-S4-PC-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s4-tipd": "Técnicas Inteligentes para Procesos de Desarrollo",
    "lang-lic-s4-tipd-1": "Repitiendo como nuestra docente, la maestra Rosalinda Avendaño López nos impartió nuevamente clases en esta materia la cual se trata de los aspectos principales de la ingeniería de software. Planificación de proyectos y todo lo que esto mismo conlleva.",
    "lang-lic-s4-tipd-2": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/04/04-TIPD.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/15-S4-TIPD-FinalProject\" target=\"_blank\">aquí</a>.",
    "lang-lic-s4-oc": "Organización Computacional",
    "lang-lic-s4-oc-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/04/05-OC.pdf\" target=\"_blank\">aquí en su forma en sucio</a> así como pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/04/06-OC-Formal.pdf\" target=\"_blank\">aquí en su forma en limpio</a> pues elaboramos diagramas muy bonitos que creo que con apuntes más limpios destacaban y le entendía a mis apuntes mejor. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/16-S4-OC-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s4-ad": "Análisis y Diseño",
    "lang-lic-s4-ad-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/04/07-AD.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s4-auto": "Autoestudio",
    "lang-lic-s4-auto-1": "Tratando de llegar con buena preparación a algunas materias que se avecinaban las cuales sabía que iba a necesitar echarle muchas ganas, decidí estudiar por mi propia cuenta algunas de estas áreas.",
    "lang-lic-s4-auto-2": "En enero del 2020 comencé unos apuntes de mecánica basándome en un libro de la Editorial Pearson los cuales no concluí. Estos apuntes pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/04/08-Mecanica.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s4-auto-3": "En enero del 2020 comencé unos apuntes de métodos numéricos basándome en un libro de la Editorial McGraw Hill los cuales no concluí. Estos apuntes pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/04/09-MetodosNumericos.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s4-auto-4": "En marzo del 2020 comencé unos apuntes de cálculo (libro que incluía los conocimientos de diferencial, integral y vectorial) basándome en un libro de la Editorial Pearson para prepararme para la materia de Ecuaciones Diferenciales del semestre entrante, sin embargo los apuntes no los concluí. Estos apuntes pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/04/10-Calculo.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s5": "Quinto Semestre",
    "lang-lic-s5-quote": "Adiós viejo amigo. Que la fuerza te acompañe - Obi-Wan Kenobi (Star Wars Episodio III: La Venganza de los Sith)",
    "lang-lic-s5-1": "Tras finalizar el semestre pasado con cierto descontento esperaba retomar un mejor paso para este semestre, sin embargo, el análisis y todo lo que supuso esto no lo tomé de la mejor manera. Primeramente pensaba que era culpa mía el hecho de sentir que había aprendido poco en el semestre pasado cuando era una situación fuera de mi control.",
    "lang-lic-s5-2": "Además, entre el semestre pasado y este, mi entorno cercano me introdujo ideas sobre darle mucha importancia a las calificaciones incluso por encima del aprendizaje. No sé de verdad por qué logré caer en esos juegos mentales al punto de empezar a dejar mis actividades como mi autoestudio o el hacer ejercicio y deporte (además de que no podía porque estábamos en pandemia. Todo el semestre fue pasarlo en clases virtuales).",
    "lang-lic-s5-3": "Creo que las semillas de las malas decisiones pudieron haberse plantado en el semestre pasado, pero el giro realmente comenzó en este semestre, perdiéndome de quien verdaderamente era...",
    "lang-lic-s5-bd": "Bases de Datos",
    "lang-lic-s5-bd-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/05/01-BD.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s5-oi": "Optimización Inteligente",
    "lang-lic-s5-oi-1": "La Doctora Aurora Torres Soto puede posicionarse como, creo yo, la mejor docente de la carrera. Desde mi opinión, tiene una gran forma de explicar a los alumnos las cosas para que entendamos las cosas a nosotros, quienes desconocemos de los temas. Desde mi perspectiva, las clases siempre tuvieron un buen ritmo, con una buena combinación de teoría junto con ejercicios prácticos y tareas que se hacen a mano así como las tareas programando. Honor a quien honor merece.",
    "lang-lic-s5-oi-2": "En la clase, la Doctora nos enseñó sobre algunos conocimientos de cálculo multivariable para tener bases para la optimización, además de conocer algunas metaheurísticas básicas. Las más importantes que vimos en la clase fue el Algoritmo Genético Simple, el Recocido Simulado y la Optimización por Colonia de Hormigas. Fue una pena que la única clase que me impartió fue en la modalidad virtual, pero incluso así, la Doctora realizó una muy buena cátedra de los conocimientos de esta materia.",
    "lang-lic-s5-oi-3": "Destaco de la Doctora Aurora la paciencia en la forma en la que respondía las dudas, la creatividad para usar distintos ejemplos para explicarnos teoría con una complejidad alta, creo yo. Fue una de las docentes de la carrera que más accesibilidad tuvo frente a las diferencias de ciertos miembros del grupo, permitiendo que el aprendizaje fuera amplio y claro para todos. Sus ejercicios, exámenes y el proyecto todos nos desafiaron de distintas maneras, desde aquellos ejercicios prácticos a mano así como los ejercicios que requerían programar en C++. La Doctora también nos introdujo el concepto de Benchmarks para las pruebas de nuestro código la cual el uso de la TSPLIB incluso fue parte del proyecto final.",
    "lang-lic-s5-oi-4": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/05/02-OI.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/17-S5-OI-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s5-a1": "Autómatas I",
    "lang-lic-s5-a1-1": "Otra muy buena clase de este semestre fue esta, impartida por el profesor Israel de la Parra González. Tristemente el profesor no tenía suficiente tiempo para algunas asesorías con nosotros, sin embargo las explicaciones de las clases eran muy buenas, la combinación de teoría y ejercicios fue buena y abordarlo todo estuvo muy bien equilibrado. Realmente creo que el profesor también tuvo un impacto positivo en nuestro salón.",
    "lang-lic-s5-a1-2": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/05/03-A1.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/18-S5-A1-FinalProject\" target=\"_blank\">aquí</a>.",
    "lang-lic-s5-ed": "Ecuaciones Diferenciales",
    "lang-lic-s5-ed-1": "El profesor Jaime Salvador Medina González fue un buen profesor. Creo que en general sentí que muchos compañeros gustaron más de sus clases que yo. El profesor tiene una muy buena actitud hacia los alumnos al dar clase. Trata de encajar con el humor del salón y es muy memorable su clase gracias a esto. Creo que fueron buenas clases, muy buenas clases, pero quizá me esperaba un poco de más profundidad en temas de esta materia. Igualmente el profesor hizo un buen curso para nosotros, con buen ritmo, buenos ejercicios, ameno y entretenido.",
    "lang-lic-s5-ed-2": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/05/04-ED.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s5-aidh": "Arquitectura Inteligente de Desarrollo Híbrido",
    "lang-lic-s5-aidh-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/05/05-AIDH.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/19-S5-AIDH-FinalProject\" target=\"_blank\">aquí</a>.",
    "lang-lic-s5-li": "Lenguajes Inteligentes",
    "lang-lic-s5-li-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/05/06-LI.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/20-S5-LI-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s6": "Sexto Semestre",
    "lang-lic-s6-quote": "Con la maldad no se nace, la maldad se aprende - Star Wars: The Clone Wars (Temporada 3 Episodio 13: Monstruo)",
    "lang-lic-s6-1": "En este semestre fue cuando me comenzó a disgustar la universidad. Fue aquí donde sentía que perdía más mi tiempo que realmente estar empleándolo en hacer cosas útiles. Las cosas se pusieron muy muy mal a partir de aquí.",
    "lang-lic-s6-2": "Anteriormente (al menos en mi caso) sentía alguna que otra materia que me disgustara por semestre, pero en este semetre los papeles se invirtieron, siendo ahora las materias que me gustaran las difíciles de encontrar en nuestro camino por la carrera.",
    "lang-lic-s6-3": "A partir de aquí y por ello, las ganas por la carrera decayeron muchísimo. Siendo el segundo semestre completamente virtual, la universidad todavía no se ponía muy rigurosa con las asistencias o las clases, de modo que mi rutina consistía en tratar de hacer ejercicio antes de algunas clases, tomar algunas que sí estaban dándose y como a partir de las 9:00 no tener clase hasta las 11:00. Fue un semestre bastante malo y comenzó a encadenar una racha de semestres que terminaron por matar mi gusto por la carrera.",
    "lang-lic-s6-iso": "Introducción a los Sistemas Operativos",
    "lang-lic-s6-iso-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/06/01-ISO.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s6-tcc": "Teoría de la Complejidad Computacional",
    "lang-lic-s6-tcc-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/06/02-TCC.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s6-io": "Investigación de Operaciones",
    "lang-lic-s6-io-1": "Esta materia es extraña. Nunca conocimos al profesor Jesús Ovalle Palacios ni su voz ni su rostro. Sus clases no fueron por videoconferencia sino que subía un archivo al espacio académico que contenía la teoría de los temas de investigación de operaciones, como optimización, método simplex y otros tópicos, más los ejercicios que contarían como la asistencia del día.",
    "lang-lic-s6-io-2": "Fue raro no sentir la presencia de un docente pero definitivamente prefiero esto a la clase base que teníamos donde dedicábamos el tiempo leyendo diapositivas o algo similar. Podíamos leer las diapositivas cuando quisiéramos y el ejercicio diario en cualquier momento antes de que termine el día.",
    "lang-lic-s6-io-3": "Pese a no conocer al profesor y nunca tratar directamente con él, hizo mejor trabajo que muchos profesores que su clase se basaba en leer diapositivas.",
    "lang-lic-s6-io-4": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/06/03-IO.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s6-ai": "Aprendizaje Inteligente",
    "lang-lic-s6-ai-1": "A partir de estas materias, el profesor Francisco Javier Luna Rosas mejora mucho como docente, donde se nota que prefiere dar clases de estos temas sobre inteligencia artificial que los de principios de la carrera.",
    "lang-lic-s6-ai-2": "Su conocimiento es amplio en estos temas y las actividades que deja son interesantes y variadas.",
    "lang-lic-s6-ai-3": "En la materia vimos los tipos de aprendizaje que se manejan en el machine learning: aprendizaje supervisado, no supervisado y por refuerzo. Estuvieron bien las formas en las que revisamos los temas.",
    "lang-lic-s6-ai-4": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/06/04-AI.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/21-S6-AI-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s6-ep": "Ética Profesional",
    "lang-lic-s6-ep-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/06/05-EP.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s6-de": "Desarrollo de Emprendedores",
    "lang-lic-s6-de-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/06/06-DE.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s7": "Séptimo Semestre",
    "lang-lic-s7-quote": "El miedo lleva a la ira, la ira al odio, el odio lleva al sufrimiento - Maestro Yoda (Star Wars Episodio I: La Amenaza Fantasma)",
    "lang-lic-s7-1": "Este semestre es el sinónimo de tocar fondo. Esta vez sin que nadie me dijera, me volvió a pasar por la cabeza lo mismo que sucedió de cuarto a quinto semestre. De modo que fui a este semestre a intentar dejarlo absolutamente todo para demostrarme que ciertamente podía tener un buen rendimiento (y tristemente enfocado más a las calificaciones).",
    "lang-lic-s7-2": "Por dicha exigencia se trató de un semestre en el que me paraba para estar detrás de la computadora (porque fue un semestre totalmente virtual nuevamente, a excepción de como tres ocasiones que nos intentaron llevar a un modelo híbrido pero no fue exitoso) desde las 7:00 de la mañana hasta las 2:00 de la tarde sin parar, luego quedarme a hacer las tareas y estudiar hasta las 4:00 de la tarde, donde sólo me paraba a comer y volver a las 5:00 a sentarme para hacer lo mismo anteriormente mencionado y quedarme normalmente hasta las 12:00 de la noche o a veces hasta más.",
    "lang-lic-s7-3": "Fue un semestre que llegó a parecerse al rendimiento de mi etapa final del Bachillerato Internacional pero con un sentimiento horrendo de que perdíamos todo el tiempo en no hacer nada. De hecho gracias a ese sentimiento que llegó a su cúspide en este semestre a partir de este hasta el final lo único que quería era salir de la carrera. Ya iba en séptimo como para tirar la toalla y salirme, pero al irme a dormir el sentimiento era tan fuerte de pensar que cada día que me levantaba era otro día desperdiciado sintiendo un vacío ya que no aprendí nada en ese día. Yo ya no quería nada más de la carrera, únicamente terminar. Y aunque me alentaban con que \"falta poco\", \"ya casi\", \"sólo tres semestres más\", mi entorno cercano no entendía que ese semestre se me hizo eterno.",
    "lang-lic-s7-4": "Fue un semestre muy duro, muy malo y probablemente el punto más bajo en el que me encontré en mi vida universitaria e incluso probablemente en toda mi vida.",
    "lang-lic-s7-5": "Como pequeño dato dentro de toda la depresión del semestre, durante el semestre pasado, es decir, en sexto semestre, había conocido la aplicación \"Notion\" con la que estuve probando en si hacía mis apuntes en dicha aplicación o no, pero todavía no fue formal. Sin embargo y ya con nulas ganas de apuntar algo en este tipo de clases, preferí cambiar mis apuntes a algo digital. Por lo que mis apuntes el resto de la carrera se hicieron en esta plataforma.",
    "lang-lic-s7-r1": "Redes I",
    "lang-lic-s7-r1-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/07/01-R1.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s7-a2": "Autómatas II",
    "lang-lic-s7-a2-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/07/02-A2.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/22-S7-A2-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s7-m1": "Metaheurísticas I",
    "lang-lic-s7-m1-1": "Dada por el profesor Francisco Javier Luna Rosas es mi clase favorita impartida por él y es aquí donde realmente observo el potencial que puede sacarse del profe, siendo asesorados en muchos temas y acercándose a él para conocer más y más de estos temas.",
    "lang-lic-s7-m1-2": "En su clase combinamos las técnicas de optimización vistas en Optimización Inteligente en quinto semestre con los modelos de aprendizaje vistos en Aprendizaje Inteligente en sexto semestre para distribuir carga entre equipos de cómputo que procesaran el análisis de sentimientos de tweets extraídos de Twitter sobre algún tema delicado. Fue un proyecto interesante y único.",
    "lang-lic-s7-m1-3": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/07/03-M1.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/23-S7-M1-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s7-dmd": "Desarrollo de Medios Digitales",
    "lang-lic-s7-dmd-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/07/04-DMD.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s7-le": "Lenguaje Ensamblador",
    "lang-lic-s7-le-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/07/05-LE.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/24-S7-LE-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s7-pi": "Procesamiento de Imágenes",
    "lang-lic-s7-pi-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/07/06-PI.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s7-esi": "Evolución de Software Inteligente",
    "lang-lic-s7-esi-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/07/07-ESI.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s8": "Octavo Semestre",
    "lang-lic-s8-quote": "Jamás pierdas la esperanza. No importa lo negro que todo parezca - Star Wars: The Clone Wars (Temporada 5 Episodio 20: El jedi equivocado)",
    "lang-lic-s8-1": "Hablando de sensaciones personales, este semestre fue horrible debido a que fue \"la cruda\" del exceso de exigencia del semestre anterior. El semestre anterior no logré los resultados de calificaciones que esperaba, me sobreesforcé muchísimo durmiendo tan poco y teniendo tan poco tiempo para mí mismo e incluso me perdí en un mundo de sólo dedicarle tiempo al semestre (como las almas perdidas de la película de Pixar: Soul que pasan de estar en \"la zona\" a volverse almas perdidas) al punto que fue el primer semestre que al terminarse no quería ni volver a ver mi computadora.",
    "lang-lic-s8-2": "Con esta mentalidad entré a octavo semestre, algo que se me hacía pesadísimo tener que afrontar siete horas de clase cuando no quería estar frente a mi computadora ni siquiera una hora. Estaba muy quemado, me sentía <i>burned out</i> y verdaderamente sentía que incluso esto me había dejado de gustar.",
    "lang-lic-s8-3": "Sin embargo, en este semestre me dieron la oportunidad de entrar a hacer mis prácticas profesionales en una empresa cuyo nombre es HermesCorp y sigo pensando que la oportunidad fue maravillosa. A los chicos de la empresa los sigo queriendo mucho hasta hoy en día, me enseñaron muchísimo día a día y sigo pensando que, habiendo tanta gente con más experiencia que yo en esta área y en estas tecnologías y que me hayan dado la oportunidad a mí de formarme en tecnologías BackEnd fue para mí sumamente especial. Me avergonzaba tener que estar peleando con mi burnout trabajando con los chicos de Hermes especialmente en este semestre donde de por sí me costaba mucho mantenerme frente a la computadora en clases y luego terminar para seguir programando. Quiero decir, me encantaba finalmente programar, sentir que lo hacíamos con un propósito y que era un desafío haciendo las cosas que hacíamos en las prácticas profesionales, pero mi burnout se mantenía ahí de modo que sí me costaba trabajar incluso aunque me gustara hacer lo que estábamos haciendo en las prácticas.",
    "lang-lic-s8-4": "Lo anterior comenzaba a dar un rayo de luz para los próximos semestres pues me enseñaron muchas cosas tanto a nivel técnico como de otros ámbitos más generales de la vida que empezaba a sentir una luz de esperanza para salir de este mal tramo ocasionado por los últimos semestres que estaba cursando de la universidad. Pero respecto a las clases, las clases siguieron igual pese a que ya estábamos adoptando un modelo híbrido.",
    "lang-lic-s8-asp": "Administración de Software y Proyectos",
    "lang-lic-s8-asp-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/08/01-ASP.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/25-S8-ASP-FinalProject\" target=\"_blank\">aquí</a>.",
    "lang-lic-s8-mddm": "Metodología de Desarrollo para Dispositivos Móviles",
    "lang-lic-s8-mddm-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/08/02-MDDM.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/26-S8-MDDM-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s8-sep": "Sistemas Expertos Probabilísticos",
    "lang-lic-s8-sep-1": "La clase nos la impartió la Doctora Eunice Esther Ponce de Leon Senti. Era una materia interesante donde estuvimos viendo teoría de los sistemas expertos junto con su respectiva teoría estadística que involucraba.",
    "lang-lic-s8-sep-2": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/08/03-SEP.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/27-S8-SEP-FinalProject\" target=\"_blank\">aquí</a>.",
    "lang-lic-s8-g": "Graficación",
    "lang-lic-s8-g-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/08/04-G.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/28-S8-G-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s8-r2": "Redes II",
    "lang-lic-s8-r2-1": "Guillermo Domínguez Aguilar es, no solo un gran docente, sino un gran profesional en las redes con conocimientos extremadamente amplios en los sistemas Linux y las redes de computadoras. Tiene tantísimos estudios y se sigue capacitando y actualizando que hasta era un honor ser su alumno.",
    "lang-lic-s8-r2-2": "El profesor Guido sí nos contaba cosas muy útiles de cosas como trucos para cablear mejor, diseñar mejor el sistema de cableado de una red en un edificio y la conexión de edificios dando ejemplos de cómo se implementó en la universidad y muchos otros tips así como experiencias del profesor. Esto era muy inspirador pues se veía su experiencia en el campo y cómo nos la pasaba a nosotros.",
    "lang-lic-s8-r2-3": "No fue una mala clase pero sé que pudo ser muchísimo mejor de no ser porque comenzamos con clases virtuales además de que el profesor sufrió un percance en un clúster que tenía en la universidad con el que haríamos el proyecto final y muchas de las actividades del semestre, que involucraban mover grandes cantidades de almacenamiento, fuerte poder de procesamiento y mucha pero mucha RAM, que claramente nuestros equipos chiquitos no podían se redujeron a las actividades en una escala en la que sí pudiéramos realizar estos procesos.",
    "lang-lic-s8-r2-4": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/08/05-R2.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s8-m2": "Metaheurísticas II",
    "lang-lic-s8-m2-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/08/06-M2.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/29-S8-M2-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s8-di": "Derecho Informático",
    "lang-lic-s8-di-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/08/07-DI.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s9": "Noveno Semestre",
    "lang-lic-s9-quote": "El reto de la esperanza es vencer la corrupción - Star Wars: The Clone Wars (Temporada 3 Episodio 5: Corrupción)",
    "lang-lic-s9-1": "Volvimos a las clases presenciales después de casi dos años de pandemia. La luz al final del túnel se veía cada vez más resplandeciente. Gracias a mis prácticas profesionales me iba sintiendo mejor pero mi burnout seguía ahí. Independientemente de cómo fuera este semestre, mi logro principal era tratar de eliminar lo más posible ese burnout mío para comenzar el año que venía con toda la energía.",
    "lang-lic-s9-2": "En este semestre ya estábamos con la tesina encima, otro requisito de titulación más. Afortunadamente yo ya iba muy avanzado pues la comencé desde el semestre pasado, en mayo del 2022 y toda la familiarización la había conseguido en septiembre del 2022, en este semestre. Quedaba leer y redactar mucho para hacer la experimentación. Sí me veía terminando la tesina este semestre.",
    "lang-lic-s9-3": "En este semestre me di cuenta de todos los errores que había cometido desde el 2020 hasta este punto. Quería corregir mi vida y comencé a hacerlo, tratando de salir del mal paso a como diera lugar, primero quitándome la meta de los resultados, perdonando muchas de las cosas de mi pasado y reconfigurando muchos aspectos de mi vida, para que en el próximo semestre y a partir del 2023, el regreso al buen camino fuera una realidad. Pero antes había que cursar un semestre en el que yo mantenía la esperanza que sería un buen semestre convenciéndome a mi mismo que \"ya no era virtual\" y así las cosas (y las clases) mejorarían. Para mí sorpresa, parecía que la calidad y dinámica de la carrera desde la pandemia había llegado para quedarse...",
    "lang-lic-s9-sw": "Servicios Web",
    "lang-lic-s9-sw-1": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/04-Licenciatura/09/01-SW.pdf\" target=\"_blank\">aquí</a> que son digitales. Mi repositorio del proyecto que desarrollamos en su materia se puede encontrar <a href=\"https://github.com/Joul24py/AppCitas\" target=\"_blank\">aquí</a>.",
    "lang-lic-s9-md": "Minería de Datos",
    "lang-lic-s9-md-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/09/02-MD.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/31-S9-MD-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s9-pa": "Paralelización de Algoritmos",
    "lang-lic-s9-pa-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/09/03-PA.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/32-S9-PA-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s9-tsi": "Teoría de Sistemas Interactivos",
    "lang-lic-s9-tsi-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/09/04-TSI.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s9-sis": "Seguridad e Integridad de Sistemas",
    "lang-lic-s9-sis-1": "Arturo Ocampo Silva. A este profesor le debo muchísimo. Lo considero un excelente profesor y sin duda era él quien nos hacía cambiar la mala cara del resto del día a una actitud muy alegre en su clase.",
    "lang-lic-s9-sis-2": "Primero, el profesor entraba con una actitud tremendamente positiva y alegre, se dirigía en momentos a todo el grupo en general y en momentos a personas en específico. Su conocimiento en el área es bastante bueno y todo esto te transmitía la alegría del profesor. Además, con esta actitud, el grupo agarró confianza con el profesor rápidamente que llegó al punto que varias veces nos desahogábamos con él de cómo nos sentíamos de frustrados porque las demás materias no eran lo que esperábamos, nos escuchaba y apoyaba diciéndonos que le alegraba que su clase nos subiera los ánimos tras soportar el resto del día.",
    "lang-lic-s9-sis-3": "El profesor también dio su clase con diapositivas pero él sabía que las diapositivas no eran el protagonista de la clase, sino sólo el apoyo. Hacíamos tantas cosas prácticas en clases regulares, porque los viernes era totalmente poner en práctica lo que aprendíamos usando un módem del profesor y conectándonos a él para ponernos a jugar entre las computadoras que estaban conectadas.",
    "lang-lic-s9-sis-4": "El profesor nos enseñaba para la vida, para la aplicación práctica, nos decía cuándo podíamos necesitar de conocimientos de un tema u otro, de recursos actualizados y hablando de esto, él sí actualizaba sus diapositivas, sabiendo que no hacerlo se percibiría cómo se va quedando obsoleto el conocimiento. Además que el hecho de que las actualizara mostraba su compromiso con enseñarnos.",
    "lang-lic-s9-sis-5": "Los exámenes del profesor eran una cosa impresionante. Nunca logré sacar uno de sus exámenes con calificación superior al 7 pero después de superar mi corrupción por las calificaciones, ni siquiera me importaba esto. Sus exámenes lograban lo que pocos exámenes hacían desde que cayó la pandemia que era desafiar al alumno. Si ya en clases hacíamos actividades prácticas, el profesor les daba una vuelta de tuerca para volverlas levemente más complejas pero lo suficiente para demostrar si sí habíamos aprendido; no bastaba con memorizar, había que comprender qué estábamos haciendo, en ocasiones cómo vulnerar correctamente el equipo del profesor, o analizar el tráfico de la red con el razonamiento debido para obtener conclusiones. Estos exámenes no eran \"memorízate la tonelada de teoría que te vomité en las últimas cinco semanas de clases para venir a responder de memoria mis preguntas\" sino realmente demostraban un desafío para el alumno.",
    "lang-lic-s9-sis-6": "No puedo estar más agradecido con el profesor porque realmente pensaba que estudiar ya no me interesaba, sin embargo, se debía a la muy mala calidad de las clases a las que tristemente nos acostumbramos y ver que todavía había alguna materia que me atrapaba para dedicarle horas por la tarde, que le ponía atención en clases, que me gustaba hacer sus tareas y sentirme desafiado en un examen pese a salir con un 6 de 10 de calificación es algo que yo agradezco mucho al profesor. Nos enseñó para la vida, fue nuestro motivo para ir a clases y esto lo veía ya que el resto de las materias tenían, si bien les iba, un 20% de asistencia pero en esta clase, el profesor conseguía un 90% de asistencia sin forzar pases de lista ni nada.",
    "lang-lic-s9-sis-7": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/09/05-SIS.pdf\" target=\"_blank\">aquí</a>. De igual forma, los programas y ejercicios que hicimos en clase pueden consultarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/33-S9-SIS-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s9-si1": "Seminario de Investigación I",
    "lang-lic-s9-si1-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/09/06-SI1.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-s10": "Décimo Semestre",
    "lang-lic-s10-quote": "This is a new day, a new beginning - Ahsoka Tano",
    "lang-lic-s10-1": "Finalmente había llegado el último capítulo. Cinco años estaban por terminar. El décimo semestre estaba frente a nosotros con sentimientos muy polarizados.",
    "lang-lic-s10-2": "Por un lado me daba tristeza que se terminara la carrera porque ya había vivido antes la separación de mi equipo de amigos al finalizar una etapa estudiantil y es triste, no convives con tu raza igual como lo hacías antes, toman caminos separados y sabía que mi relación con mis amigos como la conocía estaba llegando a su fin, con todo el tiempo que pasábamos juntos, estaba terminando y pronto volaríamos tomando diferentes caminos.",
    "lang-lic-s10-3": "Por otro lado, no veía la hora para que también este semestre terminara. Eran tres materias pero ya no tenía ganas de que ni siquiera una de ellas me desagradara. Esperaba demasiado de la carrera ¿no? Es así que al saber cómo estaba desarrollándose este semestre, no me importaba ni siquiera que se acercara el final de la carrera y que ello conllevaría volverme desempleado, lo único que quería era que las clases se terminaran y dejar de sentirme como me sentía en los últimos semestres.",
    "lang-lic-s10-4": "Con estos sentimientos, además de haber logrado dar vuelta a muchos de los malos sucesos hacia buen camino en el semestre pasado (en gran parte, también porque en estos momentos, la canción <a href=\"https://www.youtube.com/watch?v=oiDfdL5XhfY\" target=\"_blank\">Recovery de The Fold</a> se había vuelto el himno de mi vida), me preparaba para seguir luchando por recuperarme y seguir levantándome del mal paso, pues sabía que el trabajo no estaba terminado y que todavía no alcanzaba mi buen camino. Este pensamiento fue el que me hizo luchar cada día por culminar la carrera tratando de hacerlo en un buen paso. Personalmente creo que la etapa de \"la remontada\" finalizó el día en el que defendí mi tesina. El 18 de mayo del 2023 fue el día de la celebración de victoria. Donde los meses de recuperación habían dado sus frutos y donde para mí, los cinco años de la carrera habían finalizado. Donde finalmente se alzaría un nuevo día, un nuevo comienzo.",
    "lang-lic-s10-op1": "Optativa Profesionalizante I: Angular SPA Development",
    "lang-lic-s10-op1-1": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/04-Licenciatura/10/01-OP1.pdf\" target=\"_blank\">aquí</a> que son digitales. Mi repositorio del proyecto que desarrollamos en su materia se puede encontrar <a href=\"https://github.com/Joul24py/AppCitas-Front\" target=\"_blank\">aquí</a>.",
    "lang-lic-s10-op2": "Optativa Profesionalizante II: Machine Learning y Deep Learning",
    "lang-lic-s10-op2-1": "La materia la impartió el profesor Francisco Javier Luna Rosas. Después de haberlo tenido de docente desde segundo semestre, creo que esta fue la segunda materia donde apreciaba mucho su guía y la primera donde le entendía a la perfección a lo que quería enseñarnos.",
    "lang-lic-s10-op2-2": "En esta ocasión lo que nos enseñó estuvo muy bien, sin duda fue la materia por la que asistía a la universidad de este semestre, su guía me pareció muy buena y el conocimiento que posee en el área es extenso y notorio. Personalmente creo que es una guía increíble.",
    "lang-lic-s10-op2-3": "Mis apuntes de la materia se pueden encontrar <a href=\"01-Apuntes/04-Licenciatura/10/02-OP2.pdf\" target=\"_blank\">aquí</a> los cuales los hice en digital y quizá no sean muy útiles por lo poco que apunté, pero durante el semestre desarrollamos muchos programas todos altamente enfocados en los distintos tipos de redes neuronales. Mis implementaciones pueden encontrarse <a href=\"https://github.com/Joul24py/UAA-ICI/tree/main/35-S10-OP2-ClassExercises\" target=\"_blank\">aquí</a>.",
    "lang-lic-s10-si2": "Seminario de Investigación II",
    "lang-lic-s10-si2-1": "Los apuntes que desarrollé para su materia pueden consultarse <a href=\"01-Apuntes/04-Licenciatura/10/03-SI2.pdf\" target=\"_blank\">aquí</a>.",
    "lang-lic-thesis": "Tesina",
    "lang-lic-thesis-quote": "Nuestra gloria más grande no está en nunca caernos, sino en levantarnos cada vez que nos caemos - Kobe Bryant",
    "lang-lic-thesis-1": "El gran trabajo de mi vida. La tesina de la carrera. Realmente este proyecto dejaba de tener interés en mí conforme avanzaba más en la carrera, sin embargo, los sucesos extraescolares me hicieron pensar que, si iba a hacer algo, tenía que volver a hacerlo como en un principio: con pasión. Cuando antes de que me corrompiera por los resultados y las calificaciones, donde hacía las cosas por el aprendizaje, por lo que significaba para mí la experiencia y no por el resultado, pues como uno de mis más grandes ídolos dijo una vez: <i>\"Esas veces en las que estás muy cansado, no quieres exigirte pero aun así lo haces. Ese es realmente el sueño. No es el destino, es el camino\"</i>.",
    "lang-lic-thesis-2": "Fue así que decidí que este proyecto volviera a ser como lo que hacía antes de mi corrupción. Un proyecto que le dejara todo mi corazón y alma y no por los resultados o las calificaciones, sino por la avidez de conocer más de esta área, de explorar y de ser curioso a la par de desarrollar el documento y todo el procedimiento. Por ello, pese al mal final de la carrera, rescato mucho este proyecto. Es el proyecto que, en mi opinión, culmina la remontada del mal paso que estuve viviendo en los últimos años en el que estuve buscándome a mí mismo.",
    "lang-lic-thesis-3": "Claramente este trabajo no lo desarrollé solo. Agradezco infinitamente a mis directoras de la tesina, la Doctora Aurora Torres Soto y la Doctora María Dolores Torres Soto quienes me apoyaron en todo momento desde la formulación de la idea hasta la defensa de la tesina. Alexis Edmundo Gallegos Acosta, en su momento estudiante de doctorado, estaba realizando su tesis con este mismo dispositivo y me encaminó por tips muy útiles para comprender en un principio el funcionamiento de la diadema. Los profesores de la materia, Alejandro Padilla Díaz y Francisco Javier Álvarez Rodríguez también fueron un apoyo importante cada vez que asistía con ellos y supervisaban mi avance en este proyecto. Claramente también a todas las personas que fueron sujetos de prueba les agradezco su apoyo en el proyecto.",
    "lang-lic-thesis-4": "El repositorio de trabajo de mi tesina, donde puede encontrarse todo el producto final en sí puede consultarse <a href=\"https://github.com/Joul24py/UAA-ICI-Thesis\" target=\"_blank\">aquí</a>.",
    "lang-lic-thesis-5": "Ahora hablando al respecto del proyecto...",
    "lang-lic-thesis-6": "<b>ANÁLISIS COMPARATIVO DE ALGORITMOS EN LA CLASIFICACIÓN DE INTENCIÓN DE MOVIMIENTO MEDIANTE UNA INTERFAZ CEREBRO–COMPUTADORA</b>",
    "lang-lic-thesis-7": "<b>Resumen</b>",
    "lang-lic-thesis-8": "Las interfaces cerebro-computadora permiten un nuevo canal de comunicación directa entre el cerebro y la máquina. Para interpretar los pensamientos como intenciones de movimiento, se utilizan herramientas como electroencefalogramas (EEG) para recopilar la actividad cerebral. La interpretación de estos datos requiere algoritmos de inteligencia artificial computacionalmente efectivos.",
    "lang-lic-thesis-9": "El objetivo de esta investigación es comparar los modelos de máquina de vectores de soporte, bosque aleatorio y naive Bayes para identificar el modelo que clasifica eficientemente los datos obtenidos de un auricular Emotiv Epoc+ en relación con la intención de movimiento. Estos modelos se evaluaron en base a los conjuntos de datos sin procesar (tal como se recibieron de la experimentación) y los conjuntos de datos después de aplicar normalización y transformación. En general, la eficiencia de la máquina de vectores de soporte y el naive Bayes no supera el porcentaje de precisión del 50%, mientras que el bosque aleatorio mejora significativamente con cada evolución de los datos, alcanzando valores de eficiencia por encima del 80%. Esta investigación proporciona una descripción detallada del procedimiento realizado para obtener estos resultados.",
    "lang-lic-thesis-10": "<b>Palabras clave:</b>",
    "lang-lic-thesis-11": "Interfaz cerebro - computadora",
    "lang-lic-thesis-12": "Intención de movimiento",
    "lang-lic-thesis-13": "Aprendizaje Automático",
    "lang-lic-thesis-14": "Support Vector Machine",
    "lang-lic-thesis-15": "Naive Bayes",
    "lang-lic-thesis-16": "Random Forest",
    "lang-lic-thesis-17": "<b>Planteamiento del problema</b>",
    "lang-lic-thesis-18": "El problema de esta investigación radica en el uso de equipos informáticos, especialmente las dificultades que enfrentan las personas con discapacidades para controlar estos dispositivos computacionales. Sin embargo, las interfaces cerebro-computadora facilitan su uso (Marte, 2019).",
    "lang-lic-thesis-19": "El problema es que la implementación de una interfaz cerebro - computadora también implica el uso de inteligencia artificial. Además, este campo de aprendizaje automático ha desarrollado numerosos algoritmos. En esta investigación, nos preguntamos cuál es el mejor modelo entre la máquina de vectores de soporte, el naive Bayes y el bosque aleatorio.",
    "lang-lic-thesis-20": "<b>Justificación</b>",
    "lang-lic-thesis-21": "Desde una perspectiva social, tenemos una justificación en la que se sabe que el 16% de la población tiene una discapacidad significativa (OMS, 2023), y los Institutos Nacionales de Salud (2019) afirman que las interfaces cerebro-computadora mejoran el funcionamiento. Así, se establece la idea de mejorar la interacción con la computadora a través de una interfaz cerebro-computadora. Por lo tanto, esta investigación justifica su ejecución debido a la inclusión del uso de computadoras por parte de personas con discapacidades significativas.",
    "lang-lic-thesis-22": "Desde una perspectiva computacional, la pregunta gira en torno a: ¿Qué algoritmo realiza una mejor clasificación? Comparando SVM, Random Forest y Naive Bayes para la clasificación de la intención de movimiento para operar una computadora.",
    "lang-lic-thesis-23": "<b>Objetivos</b>",
    "lang-lic-thesis-24": "El objetivo general de esta investigación es el siguiente:",
    "lang-lic-thesis-25": "<i>Comparar la máquina de vectores de soporte, el bosque aleatorio y el naive Bayes para identificar el modelo que clasifica los datos obtenidos de un auricular Emotiv Epoc+ sobre la intención de movimiento con mayor eficiencia.</i>",
    "lang-lic-thesis-26": "Se establecieron objetivos específicos para ayudar a alcanzar el objetivo general:",
    "lang-lic-thesis-27": "Establecer una conexión eficiente entre el dispositivo Emotiv Epoc+ y un sistema informático que permita extraer los datos de actividad neuronal del usuario.",
    "lang-lic-thesis-28": "Adaptar las herramientas necesarias, como el programa Python desarrollado por CymatiCorp: CyKit, el programa OpenViBE y el software Emotiv, para asegurar la correcta recepción de los datos del dispositivo que actúa como EEG.",
    "lang-lic-thesis-29": "Realizar el preprocesamiento de los datos obtenidos para mejorar el rendimiento de los modelos de aprendizaje automático.",
    "lang-lic-thesis-30": "Implementar los algoritmos de la máquina de vectores de soporte, el bosque aleatorio y el naive Bayes para realizar pruebas de aprendizaje en los datos de actividad cerebral.",
    "lang-lic-thesis-31": "Analizar qué modelo de los mencionados clasifica la actividad cerebral del sujeto de prueba en la intención de movimiento con mayor eficiencia.",
    "lang-lic-thesis-32": "<b>Marco teórico</b>",
    "lang-lic-thesis-33": "El marco teórico abarca temas de los siguientes campos:",
    "lang-lic-thesis-34": "Introducción a la neuroanatomía",
    "lang-lic-thesis-35": "Electroencefalografía y estudios del cerebro",
    "lang-lic-thesis-36": "Fundamentos computacionales, inteligencia artificial y machine learning",
    "lang-lic-thesis-37": "Los procesos mentales de esta investigación: habla imaginada, evocación de un concepto e intención del movimiento",
    "lang-lic-thesis-38": "<b>Metodología</b>",
    "lang-lic-thesis-39": "En términos de material se requirió lo siguiente:",
    "lang-lic-thesis-40": "Equipo de cómputo con Windows 11",
    "lang-lic-thesis-41": "Python 3.10",
    "lang-lic-thesis-42": "Emotiv versión 1809 para Windows",
    "lang-lic-thesis-43": "Cykit versión 3.0",
    "lang-lic-thesis-44": "OpenViBE versión 2.7.2 para 64 bits",
    "lang-lic-thesis-45": "Emotiv Epoc+",
    "lang-lic-thesis-46": "Además, se necesitaron voluntarios para la experimentación en campo. Hubo un total de 27 sujetos de prueba, de los cuales 21 tenían entre 18 y 30 años. Seis de ellos tenían 30 años o más. Además, se enfatiza que de los 27 sujetos, 11 eran mujeres y 16 eran hombres.",
    "lang-lic-thesis-47": "Los pasos metodológicos fueron los siguientes:",
    "lang-lic-thesis-48": "Familiarización con la diadema",
    "lang-lic-thesis-49": "Diseño del protocolo de captura",
    "lang-lic-thesis-50": "Captura de datos individual",
    "lang-lic-thesis-51": "Preprocesamiento de datos",
    "lang-lic-thesis-52": "Evaluación de SVM, Random Forest y Naive Bayes",
    "lang-lic-thesis-53": "Comparación de algoritmos",
    "lang-lic-thesis-54": "Análisis e interpretación de resultados",
    "lang-lic-thesis-55": "Conclusiones",
    "lang-lic-thesis-56": "<b>Desarrollo</b>",
    "lang-lic-thesis-57": "El repositorio de trabajo de mi tesina, donde puede encontrarse todo el producto final en sí y donde se profundiza más respecto al desarrollo así como a otros temas, puede consultarse <a href=\"https://github.com/Joul24py/UAA-ICI-Thesis\" target=\"_blank\">aquí</a>.",
    "lang-lic-thesis-58": "<b>Evidencias audiovisuales</b>",
    "lang-lic-thesis-59": "<b>Conclusiones</b>",
    "lang-lic-thesis-60": "En conclusión, es destacable que se lograron alcanzar exitosamente los objetivos, observando que el bosque aleatorio es el algoritmo con el mejor rendimiento en este problema específico.",
    "lang-lic-thesis-61": "Además, hay mucho trabajo futuro que se puede realizar, como explorar más algoritmos, buscar técnicas adicionales de procesamiento de datos, realizar evaluaciones en tiempo real de este experimento o continuar la implementación utilizando el bosque aleatorio en una interfaz cerebro-computadora.",
    "lang-lic-thesis-62": "Vale la pena mencionar que algunos de los éxitos de la investigación fueron la buena familiarización con el auricular, la disposición social para participar en la prueba (gracias a todos los voluntarios por participar) y el preprocesamiento de datos elegido.",
    "lang-lic-thesis-63": "Como áreas de mejora, se podría realizar una experimentación adicional para definir mejor la tarea mental y estandarizar el entorno de pruebas."
}