{
    "lang-sel-label": "Idioma: ",
    "lang-sel-opt-es": "Español",
    "lang-sel-opt-en": "Inglés",
    "lang-port-name": "Joel Alejandro Espinoza Sánchez",
    "lang-port-title": "Mi Camino",
    "lang-intro-title": "Mi Camino",
    "lang-intro-p1": "Desarrollé este sitio web para mostrar y opinar respecto al aprendizaje que obtuve y los productos que hice durante mi aprendizaje, desde los apuntes que logré rescatar desde mi educación temprana hasta aquellos productos de mi educación más reciente o autodidacta como lo presento dividido por etapas como se observa a continuación.",
    "lang-intro-p2": "Además cuento mis experiencias de cómo fue estudiar en las distintas instituciones por las que pasé, contando tanto las buenas experiencias como las complicadas. Dejo mucho material de estudio que realicé a disposición pública con la esperanza de que a alguien le sirvan estos productos, ya sea como material de apoyo de estudio o como resolución de dudas.",
    "lang-intro-p3": "",
    "lang-bach": "Bachillerato",
    "lang-bach-1": "Desde antes de entrar al bachillerato yo ya visualizaba esta etapa como la etapa en la que yo quería que mi vida tomara un giro muy drástico al tipo de vida que tenía en mi etapa previa, principalmente en la cuestión social.",
    "lang-bach-2": "Mi intención nunca fue descuidar el (autoevaluado) gran trabajo académico que estaba realizando en mi etapa de educación básica, sin embargo nunca me di el tiempo de construir amistades y quería conseguir finalmente relaciones sociales sólidas y entré a esta etapa de tres años con este enfoque y con esta meta principalmente.",
    "lang-bach-3": "Esto lo conseguí además de no descuidar tanto mis calificaciones (a excepción del primer año) y llevándome de esta etapa recuerdos con personas con quienes me alegra mantener los vínculos que tiempo atrás comencé.",
    "lang-bach-4": "Estudié el bachillerato en el plantel central del Centro de Educación Media de la <a href=\"https://www.uaa.mx/portal/\" target=\"_blank\">Universidad Autónoma de Aguascalientes</a> desde julio del 2015 hasta junio del 2018 siendo, en general, una experiencia muy muy disfrutable desde el término social hasta términos académicos.",
    "lang-bach-s1": "Primer Semestre",
    "lang-bach-s1-quote": "Todo lo que podemos hacer es dar lo mejor de nosotros y, a veces, lo mejor que podemos hacer es empezar de nuevo - Peggy Carter (Capitán América y el Soldado del Invierno)",
    "lang-bach-s1-1": "Este primer semestre fue un golpe de realidad a nivel educativo, sintiendo que viniendo de la secundaria no estaba tan preparado para la exigencia que había en ciertas materias. Yo iba muy animado a la materia de álgebra pues el Profesor Eduardo Guerrero Miranda nos dio un propedéutico de matemáticas que me hicieron despertar la curiosidad por las matemáticas, pero por otro lado, materias como Biología o Historia las sentía muy cargadas de contenido que yo pensaba que no daría el ancho ni en este semestre ni en la continuación de estas materias en el semestre siguiente.",
    "lang-bach-s1-2": "Sin embargo, aunque las cosas no salieron tan bien, académicamente no me fue tan mal, pasando el semestre satisfactoriamente en todas las materias.",
    "lang-bach-s1-algb": "Álgebra",
    "lang-bach-s1-algb-1": "El semestre lo empezábamos diariamente a las 7:00 de la mañana con la materia de álgebra. Impartido por el Profesor Eduardo Guerrero Miranda, el curso fue dinámico y a veces frenético, pero en mi opinión siempre fue interesante, donde aprendimos las bases del álgebra, con ecuaciones, fracciones, factorización y demás temas que, desde mi opinión, estuvieron muy bien enseñados por el docente.",
    "lang-bach-s1-algb-2": "Con el profesor Eduardo me sentiré eternamente agradecido por impartirme este curso, pues con este curso entendí las matemáticas tras nueve años de llevarlas estudiando sin tenerles tanto gusto, pues no conocía su uso, comprensión y aplicación como lo hice hasta este curso. Fue gracias a él que les agarré interés y pasión, tanto que hasta el mismo profesor lo notó apuntándome para un concurso interno de matemáticas y que me motivó a participar en otras competiciones más grandes como las olimpiadas de matemáticas, a las que acabaría participando en el cuarto semestre de mi bachillerato (además del apoyo de otro amigo que conocí más adelante).",
    "lang-bach-s1-algb-3": "Fue un curso con definiciones de algunos temas de álgebra pero más que nada la realización de ejercicios que nos permitieran comprender cada tema del curso.",
    "lang-bach-s1-algb-4": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/1/01-Algebra.pdf\" target=\"_blank\">aquí</a> pese a que creo que son apuntes sucios con mi letra a puño que siempre ha sido muy fea pero considero que fue un buen desarrollo de los temas de la materia de álgebra por lo que pueden ser útiles.",
    "lang-bach-s1-hist": "Historia Moderna",
    "lang-bach-s1-hist-1": "Desde mi opinión, esta materia era una de las dos más difíciles de este semestre. Impartida por el profesor Ismael García González Cosío, la materia exigía de mucho esfuerzo pues se veía mucho contenido de sucesos previos al Primer Conflicto Armado Mundial, sin embargo, no fue un curso de historia tan diferente a la memorización de fechas y personajes de los tiempos que nos tocó estudiar.",
    "lang-bach-s1-hist-2": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/1/02-Historia-Apuntes.pdf\" target=\"_blank\">aquí</a> donde traté de realizarlos con más cuidado pues nos evaluaban los apuntes, igualmente las tareas que hicimos en la materia pueden consultarse <a href=\"01-Apuntes/02-Bachillerato/1/03-Historia-Tareas.pdf\" target=\"_blank\">aquí</a> pero no creo que sean tan valiosos estos apuntes a no ser que la información de los apuntes sea útil, pues es probablemente lo único que pueda sacarse de provecho de estos apuntes debido a lo mismo, fue una materia de alta memorización.",
    "lang-bach-s1-estr": "Estrategias Cognitivas",
    "lang-bach-s1-estr-1": "Esta materia ni siquiera sé por qué nos la impartían. No fue una materia difícil pero tampoco fue una materia de la cual recuerde algo importante que haya aprendido.",
    "lang-bach-s1-estr-2": "Recuerdo que fue un curso para aprender a desarrollar estrategias de aprendizaje, estrategias que ya tenía yo, sin embargo, la docente Alejandra Eudave Patiño nos impuso otras reglas que llevaron a que personalmente terminara detestando la materia.",
    "lang-bach-s1-estr-3": "Desde técnicas obligatorias sobre cómo subrayar hasta el hecho de cómo escribir. Yo ya tengo mis formas de subrayado o de organización de la información a través de mapas conceptuales o cuadros sinópticos. Me frustró que ni siquiera pudiera realizar la obtención de información a mi manera y que mi calificación sea qué tan parecida es mi forma de subrayar a la forma de subrayar de la docente.",
    "lang-bach-s1-estr-4": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/1/04-EstrategiasCognitivas.pdf\" target=\"_blank\">aquí</a> los cuales no son apuntes muy sucios, tampoco muy limpios pero personalmente no creo que haya información útil que obtener de estos apuntes pues la materia no tenía nada útil que ofrecer.",
    "lang-bach-s1-tics": "Tecnologías de la Información y la Comunicación",
    "lang-bach-s1-tics-1": "La materia era la materia de computación del semestre, donde nos enseñaron muchas cosas relacionadas al equipo de cómputo. Nos enseñaron lo básico de una computadora, algunas aplicaciones de Microsoft Office y un poco del funcionamiento informático de la institución.",
    "lang-bach-s1-tics-2": "Impartido por el profesor Juan Manuel Ortega, no considero que haya sido un mal curso (aunque tampoco muy destacable), realmente era buen conocimiento el que podía obtenerse de este curso.",
    "lang-bach-s1-tics-3": "La materia no requirió de realizar apuntes pues fue puramente realización práctica en equipos de cómputo, por lo que no tengo tantos apuntes, aunque la materia fue interesante. Lo poco que desarrollé de apuntes se puede consultar <a href=\"01-Apuntes/02-Bachillerato/1/05-TICs.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bach-s1-biol": "Biología Celular",
    "lang-bach-s1-biol-1": "Esta es, junto con la materia de Historia, lo más difícil que afronté en este primer semestre. La materia de biología celular fue muy difícil para mí, aunque, a diferencia de la materia de historia, aquí la memorización no se sentía en vano. Veíamos la estructura celular (que aunque pueden considerarse como pocos organelos, a mí se me hacía muy pesado aprender todo esto) pero esto lo ligábamos con cómo cada organelo participaba en funciones celulares cuando llegábamos a este tema, de modo que era constantemente avanzar necesitando el conocimiento anterior.",
    "lang-bach-s1-biol-2": "La materia me fue impartida por el gran docente Eduardo Alvarado Villalobos, quien se encargó de brindarnos muchísima información y muy clara acerca de la biología celular. Sus clases eran muy dinámicas, la forma de explicar y de aclararnos las dudas siempre fue de mucha ayuda para todo el salón y creo que fue uno de los pilares principales para todos los colegas que se especializaron en las ciencias naturales relacionadas a la biología.",
    "lang-bach-s1-biol-3": "En este curso desarrollé mis apuntes que se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/1/06-BiologiaCelular.pdf\" target=\"_blank\">aquí</a> los cuales no son apuntes muy sucios, tampoco muy limpios pero creo que son muy útiles por toda la información dada y estructurada en este curso.",
    "lang-bach-s1-leng": "Lengua y Comunicación",
    "lang-bach-s1-leng-1": "Esta fue otra pésima materia. La docente Jacquelina Díaz de León Magallanes es de las peores docentes que he tenido en toda mi vida. Su clase era inexistente, nunca aprendimos nada. A clases llegaba a platicarnos chismes que eran extremadamente irrelevantes, y cuando pensamos que sus clases serán un chiste es cuando a ella se le pegaba la gana de llegar seria.",
    "lang-bach-s1-leng-2": "La materia debía de abordar muchas cuestiones del español con lectura y ciertas cuestiones del lenguaje como la morfología o sintaxis pero no fue así, realmente no se abordó mucho y las actividades fueron muy carentes. Su clase se dejaba guiar en exceso por su estado de ánimo (no creo que esté mal, pero esto era un exceso).",
    "lang-bach-s1-leng-3": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/1/07-Lengua.pdf\" target=\"_blank\">aquí</a> los cuales son apuntes medianamente limpios pero no creo que se les pueda sacar ningún provecho. En la materia no hicimos nada.",
    "lang-bach-s1-ingl": "Inglés",
    "lang-bach-s1-ingl-1": "Esta materia de inglés estuvo entretenida. Aprendíamos inglés desde un punto de vista muy académico pero también lo practicábamos saliéndonos del esquema teniendo conversaciones largas o debates para solidificar nuestro dominio del inglés conversando.",
    "lang-bach-s1-ingl-2": "Fue una materia muy interesante la impartida por la docente Olga Patricia de Luna Aguilar, con múltiples formas de practicar y de aprender que creo que al final todos disfrutamos.",
    "lang-bach-s1-ingl-3": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/1/08-Ingles.pdf\" target=\"_blank\">aquí</a> los cuales son apuntes medianamente limpios pero no creo que se les pueda sacar ningún provecho debido a que el curso no se explica completamente con los pocos apuntes hecho.",
    "lang-bach-s2": "Segundo Semestre",
    "lang-bach-s2-quote": "A veces, aquello que has estado buscando toda tu vida, está ahí, junto a ti todo el tiempo - Peter Quill (Guardianes de la Galaxia Volumen 2)",
    "lang-bach-s2-1": "El segundo semestre que viví fue básicamente una muy buena continuación de los primeros seis meses en este plantel educativo. Las amistades que había iniciado el semestre anterior las estaba solidificando en este semestre además de darme la oportunidad de seguir conociendo más personas del plantel, todas con quienes pasaba buenos ratos.",
    "lang-bach-s2-2": "La continuación de un buen momento anímico socialmente seguía a la alza. Académicamente sólo esperaba poder mejorar un poco lo que había alcanzado el semestre pasado, pero no me avergonzaba, pues consideraba que había hecho un buen esfuerzo el semestre pasado.",
    "lang-bach-s2-3": "Sin embargo, en este semestre se nos presentó la posibilidad de poder cambiarnos al Programa del Diploma del Bachillerato Internacional, duda que nos dejaba a muchos del salón pensando si para tercer semestre sacrificaríamos las amistades y el salón en el que estábamos por la exigencia académica y los nuevos e inciertos desafíos de este programa.",
    "lang-bach-s2-hist": "Historia Contemporánea",
    "lang-bach-s2-hist-1": "Esta materia fue la continuación de la materia de historia del semestre pasado. Impartida por la docente Consuelo Medina de la Torre, no creo que haya sido un mal curso, pero adolecía de lo mismo que la materia del semestre pasado: propósito",
    "lang-bach-s2-hist-2": "La materia fue menos pesada y quizá más explicada, no estuvo mal, pero nunca entré totalmente en la dinámica de la materia debido a su alta memorización como la materia del semestre pasado, sin embargo no me pareció tan mala materia cuando la cursé.",
    "lang-bach-s2-hist-3": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/2/01-Historia-Apuntes.pdf\" target=\"_blank\">aquí</a> así como las tareas que hice <a href=\"01-Apuntes/02-Bachillerato/2/02-Historia-Tareas.pdf\" target=\"_blank\">aquí</a> los cuales son apuntes medianamente limpios pero no creo que se les pueda sacar ningún provecho pues es información de internet o de los libros de texto que tratábamos en clase.",
    "lang-bach-s2-etim": "Etimologías Grecolatinas",
    "lang-bach-s2-etim-1": "En esta materia estuvimos estudiando el origen etimológico de gran parte del vocabulario que usamos en el español, empezando por las raíces provenientes del griego y finalizando el curso con las raíces provenientes del latín.",
    "lang-bach-s2-etim-2": "El curso lo impartió la maestra Mary Antonia Montes y he de decir que fue un buen curso. Siento qu aprendí a tratar de comprender más que memorizar las raíces etimológicas de las palabras, asociando palabras que tienen prefijos o sufijos (u otras estructuras) similares y así asociando el significado de dicha estructura etimológica. Fue un buen curso.",
    "lang-bach-s2-etim-3": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/2/03-Etimologias-Apuntes.pdf\" target=\"_blank\">aquí</a> así como las tareas que hice <a href=\"01-Apuntes/02-Bachillerato/2/04-Etimologias-Tareas.pdf\" target=\"_blank\">aquí</a> los cuales son apuntes medianamente limpios  y con la diversidad de actividades que hicimos, pueden ser útiles.",
    "lang-bach-s2-evol": "Evolución y Biodiversidad",
    "lang-bach-s2-evol-1": "El profesor Eduardo Alvarado Villalobos repitió como nuestro docente en esta materia que sería la continuación a la materia de Biología Celular del semestre anterior. Siguiendo la misma tendencia que el semestre pasado, el profesor volvió a darnos una clase excelente. Con ejemplos muy claros de los temas de las teorías de la evolución y un muy extenso programa de la biodiversidad de los seres vivos que hasta hoy en día puedo recordar nombres de algunos dominios, reinos y phyllums. Un docente excelente que hizo un gran trabajo en enseñarnos estos temas.",
    "lang-bach-s2-evol-2": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/2/05-Evolucion-Apuntes.pdf\" target=\"_blank\">aquí</a> así como las tareas que hice <a href=\"01-Apuntes/02-Bachillerato/2/06-Evolucion-Tareas.pdf\" target=\"_blank\">aquí</a> los cuales son apuntes en donde traté de ser lo más limpio posible y creo que estos mismos pueden ser útiles.",
    "lang-bach-s2-ingl": "Inglés",
    "lang-bach-s2-ingl-1": "Esta segunda materia de inglés me pareció un poco inferior a la materia del periodo pasado. No fue mala, seguimos practicando el inglés conversando, con películas, en ejercicios y muchas otras dinámicas, sin embargo, sólo sentí que quizá no hubo un punto en el que nos tomáramos en serio la materia ni el docente ni los alumnos. No es algo malo, pues practicamos igualmente el inglés, pero creo que pudimos haber hecho más actividades para aprender inglés.",
    "lang-bach-s2-ingl-2": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/2/07-Ingles-Apuntes.pdf\" target=\"_blank\">aquí</a> así como las tareas que hice <a href=\"01-Apuntes/02-Bachillerato/2/08-Ingles-Tareas.pdf\" target=\"_blank\">aquí</a> los cuales son apuntes que quizá no reflejen todo el trabajo de la clase, pero algunas actividades pueden ser de utilidad.",
    "lang-bach-s2-tall": "Taller de Lectura y Redacción",
    "lang-bach-s2-tall-1": "Esta materia es todo lo que la materia anterior de Lengua y Comunicación no fue (creo que hasta en un sentido un poco excesivo). El curso, impartido por la docente Rosa Imelda López Hurtado, fue un curso realmente tomado en serio, creo que muy en serio. Vimos muchos temas relacionados al español, como las funciones de la lengua, algunos recursos literarios y otros tópicos que creo que se abordaron perfectamente además de leer obras como \"El Viudo Román\", \"Tomochic\" y \"Noches Blancas\"; sin duda que, en cuanto a conocimiento, es una materia y una docente que enseñaron y se pudo aprender muy satisfactoriamente.",
    "lang-bach-s2-tall-2": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/2/09-TLR-Apuntes.pdf\" target=\"_blank\">aquí</a> así como las tareas que hice <a href=\"01-Apuntes/02-Bachillerato/2/10-TLR-Tareas.pdf\" target=\"_blank\">aquí</a> los cuales son apuntes en donde traté de ser lo más limpio posible y creo que estos mismos pueden ser útiles.",
    "lang-bach-s2-geom": "Geometría y Trigonometría",
    "lang-bach-s2-geom-1": "Esta materia de matemáticas me dejó un poco inconforme. La materia la impartió el docente Sergio Noé Hernández de Lira. En pocas palabras no es un excelente maestro. Enseña lo básico y a un nivel regular, hace lo posible por aclarar tus dudas pero creo que deja que desear como docente de matemáticas. Incluso en algunas clases por, creo yo, no saber que hacer nos puso varias veces a ver una película.",
    "lang-bach-s2-geom-2": "Los apuntes que desarrollé se pueden consultar <a href=\"01-Apuntes/02-Bachillerato/2/11-Geometria-Apuntes.pdf\" target=\"_blank\">aquí</a> así como las tareas que hice <a href=\"01-Apuntes/02-Bachillerato/2/12-Geometria-Tareas.pdf\" target=\"_blank\">aquí</a> los cuales son apuntes que probablemente no sean muy útiles pero en la medida de lo posible, personalmente intenté resolver muchas de mis propias dudas del campo de la geometría y la trigonometría.",
    "lang-bach-s2-msi": "Manejo de Sistemas de la Información",
    "lang-bach-s2-msi-1": "Siendo la parte dos de la materia de computación de la prepa, esta materia nos enseñó algunas bases de redes de computadoras, coninuamos con programas de la suite de Microsoft Office y vimos un poco de otros programas útiles. La docente hizo un buen trabajo en enseñarnos estos temas pero sí considero que le hizo falta un poco más de empatía con aquellos alumnos que no eran tan rápidos con la computadora.",
    "lang-bach-s2-msi-2": "La materia no requirió de realizar apuntes pues fue puramente realización práctica en equipos de cómputo, por lo que no tengo tantos apuntes, aunque la materia fue interesante. Lo poco que desarrollé de apuntes se puede consultar <a href=\"01-Apuntes/02-Bachillerato/2/13-MSI.pdf\" target=\"_blank\">aquí</a>.",
    "lang-bi": "Bachillerato Internacional",
    "lang-bi-1": "Cuando cursé la preparatoria, el centro afiliado a la Universidad Autónoma de Aguascalientes tenía la opción de cursar el Programa del Diploma del <a href=\"https://www.ibo.org/es/\" target=\"_blank\">Bachillerato Internacional</a>. Este programa consta de dos años de cursos por lo que a mediados de segundo semestre de la preparatoria te permiten aplicar a este nuevo programa o continuar en el programa que se está llevando.",
    "lang-bi-2": "Fueron mis amigos quienes me animaron a hacer un intento por aplicar al Bachillerato Internacional y fui elegido junto con ellos para ser parte del programa de mi generación. Después de hablarlo con mi familia fue una opción que tomamos y que ahora, viendo al pasado, es una de las mejores decisiones que tomé. Es una de las mejores experiencias que viví tanto a nivel de educación gracias a la gran calidad de docentes, como a nivel social. Sin alejarme de mis grandes amigos de la preparatoria, además conocí muchas más personas que aún considero amigos cercanos, pues todo el grupo del Bachillerato Internacional, mis \"IB Brothers\" fueron y siguen siendo mi inspiración para trabajar duro. Además que, independientemente del programa educativo del que esté hablando, conocí personas increíbles, amigos únicos, gente que estimo y quiero mucho todavía hoy en día.",
    "lang-bi-3": "Tal vez en cuanto a calificaciones logré mejorar mis promedios con respecto a los anteriores dos semestres, pero igualmente la exigencia había incrementado muchísimo a niveles de trabajo a los que nunca me imaginé llegar, teniendo lo que yo denonimo como \"mi prime\" en esta etapa, logrando trabajar en alto rendimiento y con buena eficiencia durante los semestres aún con promedios de sueño muy muy bajos. Sé que \"mi prime\" quedó en esa etapa porque actualmente valoro mucho dormir y aunque no vuelva a estar a ese nivel de rendimiento, prefiero mucho mejor el buen descanso hoy en día.",
    "lang-bi-4": "Fui parte de la convocatoria Mayo 2018 del Bachillerato Internacional registrando las materias \"Español A: Literatura\" de Nivel Superior obteniendo 5 puntos, \"Inglés B\" de Nivel Superior logrando 5 puntos, \"Historia de América\" de Nivel Superior obteniendo 4 puntos, \"Matemáticas\" de Nivel Medio logrando 5 puntos, \"Biología\" de Nivel Medio obteniendo 4 puntos y \"Química\" de Nivel Medio logrando 3 puntos; además de obtener 2 puntos tras obtener una B en mi Monografía de Estudios del Mundo Contemporáneo y una B en mi calificación de Teoría del Conocimiento lo que da un total de 28 puntos conseguidos en este programa educativo."
}